

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xC0C1; &amp;#xAE00;&amp;#xB85C;&amp;#xB294; &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xB124;&amp;#xC694;. &amp;#x2192; &amp;#xB9E8;&amp;#xB0A0; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC5D0; &amp;#xCC0C;&amp;#xB4E4;&amp;#xC5B4; &amp;#xC0B4;&amp;#xC558;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;..&lt;/p&gt;
&lt;p&gt;&amp;#xC5BC;&amp;#xB9C8; &amp;#xC804; Fabu1ous&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xBD80;&amp;#xC0B0; &amp;#xBCA1;&amp;#xC2A4;&amp;#xCF54;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5F4;&amp;#xB9AC;&amp;#xB294; 2021 &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xD45C;&amp;#xB97C; &amp;#xD558;&amp;#xACE0; &amp;#xC654;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xD6C4;&amp;#xAE30;&amp;#xB97C; &amp;#xB0A8;&amp;#xACA8;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAC11;&amp;#xC790;&amp;#xAE30;-&amp;#xBC1C;&amp;#xD45C;&amp;#xB97C;-&amp;#xD558;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#&amp;#xAC11;&amp;#xC790;&amp;#xAE30;-&amp;#xBC1C;&amp;#xD45C;&amp;#xB97C;-&amp;#xD558;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC11;&amp;#xC790;&amp;#xAE30; &amp;#xBC1C;&amp;#xD45C;&amp;#xB97C; &amp;#xD558;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;?&#34;&gt;&lt;/a&gt;&amp;#xAC11;&amp;#xC790;&amp;#xAE30; &amp;#xBC1C;&amp;#xD45C;&amp;#xB97C; &amp;#xD558;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;?&lt;/h1&gt;&lt;p&gt;&amp;#xC5B4;&amp;#xB290; &amp;#xD3C9;&amp;#xD654;&amp;#xB85C;&amp;#xC6B4; &amp;#xC8FC;&amp;#xB9D0;, &amp;#xC2AC;&amp;#xB799;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC0AC;&amp;#xC9C4; &amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#xC62C;&amp;#xB77C;&amp;#xC624;&amp;#xB294;&amp;#xB370;..&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_17.13.31.png&#34; alt=&#34;Screen Shot 2021-09-07 at 17.13.31.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;Security One&amp;#xC5D0;&amp;#xC11C; 2021 &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#xB54C; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xC2DC;&amp;#xC6D0;&amp;#xD3EC;&amp;#xB7FC;&amp;#xC758; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB97C; &amp;#xBAA8;&amp;#xC9D1;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC758; &amp;#xCEA1;&amp;#xCC98;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC804; &amp;#xC8FC;&amp;#xB9D0;&amp;#xC5D0; &amp;#xB9E4;&amp;#xC6B0; &amp;#xBC14;&amp;#xC058;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2AC;&amp;#xB799;&amp;#xC744; &amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC8E0;. &amp;#xBB50;&amp;#xD558;&amp;#xB290;&amp;#xB77C; &amp;#xBC14;&amp;#xBE74;&amp;#xB0D0;&amp;#xAD6C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;.&lt;/p&gt;
&lt;p&gt;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Untitled.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC544;&amp;#xD06C;&amp;#xB77C;&amp;#xC2DC;&amp;#xC544; &amp;#xC5EC;&amp;#xD589;&amp;#xD558;&amp;#xB290;&amp;#xB77C; &amp;#xBC14;&amp;#xBE74;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xB2F9;&amp;#xD558;&amp;#xAC8C; &amp;#xC6D4;&amp;#xC694;&amp;#xC77C;&amp;#xC5D0; &amp;#xCD9C;&amp;#xADFC;&amp;#xD574;&amp;#xC11C; &amp;#xC2E0;&amp;#xCCAD; &amp;#xB9C8;&amp;#xAC10;&amp;#xC77C;&amp;#xC744; &amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xB9C8;&amp;#xAC10;&amp;#xC77C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2F9;&amp;#xC7A5; 3&amp;#xC77C;&amp;#xC774; &amp;#xB0A8;&amp;#xC544;&amp;#xC11C; &amp;#xD638;&amp;#xB2E4;&amp;#xB2E5; &amp;#xC8FC;&amp;#xC81C;&amp;#xB97C; &amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB8CC;&amp;#xBD80;&amp;#xD130; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xD589;&amp;#xD788; &amp;#xC608;&amp;#xC804;&amp;#xC5D0; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xB514;&amp;#xD551;&amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC778;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2020/11/15/l0ch/windows-patch-diffing-part1/&#34;&gt;[Research] Windows Patch Diffing &amp;#xB9DB;&amp;#xBCF4;&amp;#xAE30; Part 1&lt;/a&gt; &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2020/11/29/l0ch/windows-patch-diffing-part2/&#34;&gt;[Research] Windows Patch Diffing &amp;#xB9DB;&amp;#xBCF4;&amp;#xAE30; Part 2&lt;/a&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB450; &amp;#xAC1C;&amp;#xB97C; &amp;#xC4F0;&amp;#xBA74;&amp;#xC11C; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xBC1C;&amp;#xD45C;&amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xD574;&amp;#xB3C4; &amp;#xC88B;&amp;#xC744;&amp;#xAC83; &amp;#xAC19;&amp;#xB2E4;~ &amp;#xB77C;&amp;#xB294; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xB97C; &amp;#xD55C; &amp;#xC801;&amp;#xC774; &amp;#xC788;&amp;#xC5B4; &amp;#xC8FC;&amp;#xC81C;&amp;#xB294; &amp;#xAE08;&amp;#xBC29; &amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC911;&amp;#xAC04;&amp;#xC5D0; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB3C4; &amp;#xC870;&amp;#xAE08; &amp;#xCD94;&amp;#xAC00;&amp;#xD560; &amp;#xACB8; Windows &amp;#xD504;&amp;#xB9B0;&amp;#xD130; &amp;#xC2A4;&amp;#xD480;&amp;#xB7EC; API &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778; CVE-2020-0986&amp;#xACFC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; bypass&amp;#xD558;&amp;#xB294; CVE-2021-1648&amp;#xC744; patch diffing&amp;#xC73C;&amp;#xB85C; &amp;#xC9C1;&amp;#xC811; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB3C4; &amp;#xB123;&amp;#xC73C;&amp;#xBA74; &amp;#xC870;&amp;#xAE08; &amp;#xC5EC;&amp;#xC720;&amp;#xB86D;&amp;#xAC8C; &amp;#xC900;&amp;#xBE44;&amp;#xD558;&amp;#xACA0;&amp;#xAD6C;&amp;#xB098; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_20.30.34.png&#34; alt=&#34;Screen Shot 2021-09-07 at 20.30.34.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5B4;..&amp;#xC5EC;&amp;#xC720;&amp;#xB86D;&amp;#xAC8C;&amp;#x2026;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_20.45.42.png&#34; alt=&#34;Screen Shot 2021-09-07 at 20.45.42.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;43&amp;#xD398;&amp;#xC774;&amp;#xC9C0;.. &amp;#xC5B4;&amp;#xB77C;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_19.35.45.png&#34; alt=&#34;Screen Shot 2021-09-07 at 19.35.45.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xAD6D; &amp;#xC5EC;&amp;#xC720;&amp;#xB86D;&amp;#xAC8C; 3&amp;#xC77C; &amp;#xBC24;&amp;#xC0D8;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&#34;&amp;#xAC00;&amp;#xC790;-&amp;#xBD80;&amp;#xC0B0;&amp;#xC73C;&amp;#xB85C;&#34;&gt;&lt;a href=&#34;#&amp;#xAC00;&amp;#xC790;-&amp;#xBD80;&amp;#xC0B0;&amp;#xC73C;&amp;#xB85C;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC00;&amp;#xC790; &amp;#xBD80;&amp;#xC0B0;&amp;#xC73C;&amp;#xB85C;!&#34;&gt;&lt;/a&gt;&amp;#xAC00;&amp;#xC790; &amp;#xBD80;&amp;#xC0B0;&amp;#xC73C;&amp;#xB85C;!&lt;/h1&gt;&lt;p&gt;&lt;del&gt;&amp;#xBCBC;&amp;#xB77D;&amp;#xCE58;&amp;#xAE30;&amp;#xB85C;&lt;/del&gt; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xC900;&amp;#xBE44;&amp;#xD55C; &amp;#xB355;&amp;#xC5D0; &amp;#xB2E4;&amp;#xD589;&amp;#xD788; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790; &amp;#xC120;&amp;#xC815; &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0; &amp;#xC800;&amp;#xC640; Fabu1ous &amp;#xB458; &amp;#xB2E4; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB85C; &amp;#xC120;&amp;#xC815;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xB354;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;! &amp;#xC5BC;&amp;#xB978; &amp;#xAE40;&amp;#xD3EC;&amp;#xACF5;&amp;#xD56D;&amp;#xC5D0;&amp;#xC11C; &amp;#xAE40;&amp;#xD574;&amp;#xACF5;&amp;#xD56D;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xB294; &amp;#xD56D;&amp;#xACF5;&amp;#xD3B8;&amp;#xC744; &amp;#xC608;&amp;#xB9E4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC1C;&amp;#xD45C;&amp;#xAC00; 1&amp;#xC2DC;&amp;#xBD80;&amp;#xD130;&amp;#xC600;&amp;#xC73C;&amp;#xB2C8; &amp;#xC801;&amp;#xC5B4;&amp;#xB3C4; 9&amp;#xC2DC; &amp;#xBE44;&amp;#xD589;&amp;#xAE30;&amp;#xB294; &amp;#xD0C0;&amp;#xC57C; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xB9DE;&amp;#xCD9C; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC8E0;. &amp;#xAE40;&amp;#xD3EC;&amp;#xACF5;&amp;#xD56D;&amp;#xC5D0;&amp;#xC11C; 15&amp;#xBD84; &amp;#xAC70;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC0B4;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; 7&amp;#xC2DC;&amp;#xC5D0; &amp;#xC77C;&amp;#xC5B4;&amp;#xB098;&amp;#xB294;&amp;#xAC70; &amp;#xB108;&amp;#xBB34; &amp;#xD798;&amp;#xB4EC; &amp;#x3160;&amp;#x3160; &lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC800; &amp;#xC0C8;x.. &amp;#xC544;&amp;#xB2C8; &amp;#xC800; &amp;#xD615;&amp;#xC774;?  (Fabu1ous, &amp;#xACF5;&amp;#xD56D;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD55C;&amp;#xC2DC;&amp;#xAC04; &amp;#xBC18; &amp;#xAC70;&amp;#xB9AC;)&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xD2BC;! &amp;#xAE40;&amp;#xD574;&amp;#xACF5;&amp;#xD56D;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xB294; &amp;#xBE44;&amp;#xD589;&amp;#xAE30;&amp;#xB97C; &amp;#xD0C0;&amp;#xACE0; &amp;#xBD80;&amp;#xC0B0;&amp;#xC73C;&amp;#xB85C; &amp;#xCD9C;&amp;#xBC1C;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! (Photo by Fabu1ous)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Untitled%201.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD55C;&amp;#xC2DC;&amp;#xAC04; &amp;#xC815;&amp;#xB3C4;&amp;#xB97C; &amp;#xB0A0;&amp;#xC544; &amp;#xAE40;&amp;#xD574;&amp;#xACF5;&amp;#xD56D;&amp;#xC5D0; &amp;#xB3C4;&amp;#xCC29;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &amp;#xC804;&amp;#xC5ED;&amp;#xC5EC;&amp;#xD589; &amp;#xC774;&amp;#xD6C4;&amp;#xB85C; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C; &amp;#xC624;&amp;#xB294; &amp;#xBD80;&amp;#xC0B0;!.. &amp;#xC744; &amp;#xB290;&amp;#xB084; &amp;#xC0C8;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xBCA1;&amp;#xC2A4;&amp;#xCF54;&amp;#xB85C; &amp;#xD5A5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x3160;&amp;#x3160; &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_16.59.38.png&#34; alt=&#34;Screen Shot 2021-09-07 at 16.59.38.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB098; &amp;#xC0AC;&amp;#xC9C4; &amp;#xC9C4;&amp;#xC9DC; &amp;#xBABB;&amp;#xCC0D;&amp;#xB124;..? &lt;del&gt;PEXCO &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;&lt;/del&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xBCA1;&amp;#xC2A4;&amp;#xCF54;&amp;#xC5D0; &amp;#xB3C4;&amp;#xCC29;&amp;#xD558;&amp;#xB2C8; &amp;#xC810;&amp;#xC2EC;&amp;#xC2DC;&amp;#xAC04;&amp;#xC774;&amp;#xB77C; &amp;#xBC30;&amp;#xB3C4; &amp;#xACE0;&amp;#xD320;&amp;#xACE0; &amp;#xC2DC;&amp;#xAC04;&amp;#xB3C4; &amp;#xC880; &amp;#xB0A8;&amp;#xC544;&amp;#xC11C; &amp;#xBC25;&amp;#xBD80;&amp;#xD130; &amp;#xBA39;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_20.54.22.png&#34; alt=&#34;Screen Shot 2021-09-07 at 20.54.22.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xBD80;&amp;#xC0B0;&amp;#xAC00;&amp;#xBA74; &amp;#xBB50;&amp;#xB2E4;? &amp;#xB3FC;&amp;#xC9C0;&amp;#xAD6D;&amp;#xBC25;&amp;#xC774;&amp;#xB2E4;! &amp;#xC5EC;&amp;#xAE30; &amp;#xC874;&amp;#xB9DB;&amp;#xC774;&amp;#xC5D0;&amp;#xC694; &amp;#x3139;&amp;#x3147; &amp;#xAF2D;&amp;#xAC00;&amp;#xC2ED;&amp;#xC1FC;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_16.49.09.png&#34; alt=&#34;Screen Shot 2021-09-07 at 16.49.09.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB098; &amp;#xC774;&amp;#xAC70; &amp;#xBA39;&amp;#xC73C;&amp;#xB824;&amp;#xACE0; &amp;#xBD80;&amp;#xC0B0;&amp;#xC654;&amp;#xB124;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB300;&amp;#xAE30; &amp;#xB300;&amp;#xC2E0; &amp;#xC308;&amp;#xC7A5;&amp;#xC744; &amp;#xB123;&amp;#xC5B4; &amp;#xC8FC;&amp;#xB358;&amp;#xB370; &amp;#xBD80;&amp;#xC0B0; &amp;#xD2B9;&amp;#xC0C9;&amp;#xC778;&amp;#xAC00;&amp;#xC694;? &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &amp;#xC774; &amp;#xAC00;&amp;#xAC8C;&amp;#xB9CC;&amp;#xC758; &amp;#xB808;&amp;#xC2DC;&amp;#xD53C;&amp;#xC778;&amp;#xAC00;&amp;#xC694;? &amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xC5C4;&amp;#xCCAD; &amp;#xB9DB;&amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_16.48.47.png&#34; alt=&#34;Screen Shot 2021-09-07 at 16.48.47.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB3C4;&amp;#xCC29;&amp;#xD558;&amp;#xC790;&amp;#xB9C8;&amp;#xC790; &amp;#xD654;&amp;#xC7A5;&amp;#xC2E4; &amp;#xAE09;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0AC;&amp;#xB77C;&amp;#xC9C4; Fabu1ous &amp;#xAE30;&amp;#xB2E4;&amp;#xB9AC;&amp;#xBA74;&amp;#xC11C;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xD655;&amp;#xC2E4;&amp;#xD788; &amp;#xCF54;&amp;#xB85C;&amp;#xB098;&amp;#xB77C;&amp;#xC11C; &amp;#xBCA1;&amp;#xC2A4;&amp;#xCF54;&amp;#xC5D0;&amp;#xC11C; &amp;#xD558;&amp;#xB294; &amp;#xD589;&amp;#xC0AC;&amp;#xAC00; &amp;#xBAA8;&amp;#xB450; &amp;#xBE44;&amp;#xB300;&amp;#xBA74;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xB354;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;. &amp;#xBD81;&amp;#xC801;&amp;#xBD81;&amp;#xC801;&amp;#xD574;&amp;#xC57C; &amp;#xC7AC;&amp;#xBC0C;&amp;#xB294;&amp;#xB370; &amp;#xC544;&amp;#xC26C;&amp;#xC6E0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x3160;&amp;#x3160; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xB610; &amp;#xBC1C;&amp;#xD45C;&amp;#xD560; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8;&amp;#xB54C;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xC880; &amp;#xB354; &amp;#xB098;&amp;#xC544;&amp;#xC84C;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC900;&amp;#xBE44;&amp;#xAE30;&amp;#xAC04;&amp;#xC774; &amp;#xC870;&amp;#xAE08; &amp;#xC9E7;&amp;#xC544;&amp;#xC11C; &amp;#xC544;&amp;#xC26C;&amp;#xC6B4; &amp;#xC810;&amp;#xB3C4; &amp;#xC788;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xD589;&amp;#xD788; &amp;#xBC1C;&amp;#xD45C;&amp;#xB294; &amp;#xD070; &amp;#xC2E4;&amp;#xC218; &amp;#xC5C6;&amp;#xC774; &amp;#xBB34;&amp;#xC0AC;&amp;#xD788; &amp;#xB9C8;&amp;#xCE60; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB978; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xBD84;&amp;#xB4E4;&amp;#xC774; &amp;#xBC1C;&amp;#xD45C;&amp;#xD558;&amp;#xC2E0; &amp;#xB2E4;&amp;#xB978; &amp;#xC88B;&amp;#xC740; &amp;#xC8FC;&amp;#xC81C;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC9C1;&amp;#xC811; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xC88B;&amp;#xC740; &amp;#xACBD;&amp;#xD5D8;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xD3EC;&amp;#xB7FC;&amp;#xC744; &amp;#xC900;&amp;#xBE44;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0; &amp;#xC2A4;&amp;#xD0F6;&amp;#xBD84;&amp;#xB4E4;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC800;&amp;#xD76C; &amp;#xD300;&amp;#xC5D0; &amp;#xAD00;&amp;#xC2EC;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC8FC;&amp;#xC2E0; 2021 &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xBD84;&amp;#xB4E4; &amp;#xBAA8;&amp;#xB450; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Untitled%202.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;!&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Daily-Life] 부산까지 가서 발표한 썰 푼다, 시원포럼 발표 후기 - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xC0C1; &amp;#xAE00;&amp;#xB85C;&amp;#xB294; &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xB124;&amp;#xC694;. &amp;#x2192; &amp;#xB9E8;&amp;#xB0A0; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC5D0; &amp;#xCC0C;&amp;#xB4E4;&amp;#xC5B4; &amp;#xC0B4;&amp;#xC558;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;..&lt;/p&gt;
&lt;p&gt;&amp;#xC5BC;&amp;#xB9C8; &amp;#xC804; Fabu1ous&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xBD80;&amp;#xC0B0; &amp;#xBCA1;&amp;#xC2A4;&amp;#xCF54;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5F4;&amp;#xB9AC;&amp;#xB294; 2021 &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xD45C;&amp;#xB97C; &amp;#xD558;&amp;#xACE0; &amp;#xC654;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xD6C4;&amp;#xAE30;&amp;#xB97C; &amp;#xB0A8;&amp;#xACA8;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAC11;&amp;#xC790;&amp;#xAE30;-&amp;#xBC1C;&amp;#xD45C;&amp;#xB97C;-&amp;#xD558;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#&amp;#xAC11;&amp;#xC790;&amp;#xAE30;-&amp;#xBC1C;&amp;#xD45C;&amp;#xB97C;-&amp;#xD558;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC11;&amp;#xC790;&amp;#xAE30; &amp;#xBC1C;&amp;#xD45C;&amp;#xB97C; &amp;#xD558;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;?&#34;&gt;&lt;/a&gt;&amp;#xAC11;&amp;#xC790;&amp;#xAE30; &amp;#xBC1C;&amp;#xD45C;&amp;#xB97C; &amp;#xD558;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;?&lt;/h1&gt;&lt;p&gt;&amp;#xC5B4;&amp;#xB290; &amp;#xD3C9;&amp;#xD654;&amp;#xB85C;&amp;#xC6B4; &amp;#xC8FC;&amp;#xB9D0;, &amp;#xC2AC;&amp;#xB799;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC0AC;&amp;#xC9C4; &amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#xC62C;&amp;#xB77C;&amp;#xC624;&amp;#xB294;&amp;#xB370;..&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_17.13.31.png&#34; alt=&#34;Screen Shot 2021-09-07 at 17.13.31.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;Security One&amp;#xC5D0;&amp;#xC11C; 2021 &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#xB54C; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xC2DC;&amp;#xC6D0;&amp;#xD3EC;&amp;#xB7FC;&amp;#xC758; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB97C; &amp;#xBAA8;&amp;#xC9D1;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC758; &amp;#xCEA1;&amp;#xCC98;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC804; &amp;#xC8FC;&amp;#xB9D0;&amp;#xC5D0; &amp;#xB9E4;&amp;#xC6B0; &amp;#xBC14;&amp;#xC058;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2AC;&amp;#xB799;&amp;#xC744; &amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC8E0;. &amp;#xBB50;&amp;#xD558;&amp;#xB290;&amp;#xB77C; &amp;#xBC14;&amp;#xBE74;&amp;#xB0D0;&amp;#xAD6C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;.&lt;/p&gt;
&lt;p&gt;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Untitled.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC544;&amp;#xD06C;&amp;#xB77C;&amp;#xC2DC;&amp;#xC544; &amp;#xC5EC;&amp;#xD589;&amp;#xD558;&amp;#xB290;&amp;#xB77C; &amp;#xBC14;&amp;#xBE74;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xB2F9;&amp;#xD558;&amp;#xAC8C; &amp;#xC6D4;&amp;#xC694;&amp;#xC77C;&amp;#xC5D0; &amp;#xCD9C;&amp;#xADFC;&amp;#xD574;&amp;#xC11C; &amp;#xC2E0;&amp;#xCCAD; &amp;#xB9C8;&amp;#xAC10;&amp;#xC77C;&amp;#xC744; &amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xB9C8;&amp;#xAC10;&amp;#xC77C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2F9;&amp;#xC7A5; 3&amp;#xC77C;&amp;#xC774; &amp;#xB0A8;&amp;#xC544;&amp;#xC11C; &amp;#xD638;&amp;#xB2E4;&amp;#xB2E5; &amp;#xC8FC;&amp;#xC81C;&amp;#xB97C; &amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB8CC;&amp;#xBD80;&amp;#xD130; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xD589;&amp;#xD788; &amp;#xC608;&amp;#xC804;&amp;#xC5D0; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xB514;&amp;#xD551;&amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC778;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2020/11/15/l0ch/windows-patch-diffing-part1/&#34;&gt;[Research] Windows Patch Diffing &amp;#xB9DB;&amp;#xBCF4;&amp;#xAE30; Part 1&lt;/a&gt; &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2020/11/29/l0ch/windows-patch-diffing-part2/&#34;&gt;[Research] Windows Patch Diffing &amp;#xB9DB;&amp;#xBCF4;&amp;#xAE30; Part 2&lt;/a&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB450; &amp;#xAC1C;&amp;#xB97C; &amp;#xC4F0;&amp;#xBA74;&amp;#xC11C; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xBC1C;&amp;#xD45C;&amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xD574;&amp;#xB3C4; &amp;#xC88B;&amp;#xC744;&amp;#xAC83; &amp;#xAC19;&amp;#xB2E4;~ &amp;#xB77C;&amp;#xB294; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xB97C; &amp;#xD55C; &amp;#xC801;&amp;#xC774; &amp;#xC788;&amp;#xC5B4; &amp;#xC8FC;&amp;#xC81C;&amp;#xB294; &amp;#xAE08;&amp;#xBC29; &amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC911;&amp;#xAC04;&amp;#xC5D0; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB3C4; &amp;#xC870;&amp;#xAE08; &amp;#xCD94;&amp;#xAC00;&amp;#xD560; &amp;#xACB8; Windows &amp;#xD504;&amp;#xB9B0;&amp;#xD130; &amp;#xC2A4;&amp;#xD480;&amp;#xB7EC; API &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778; CVE-2020-0986&amp;#xACFC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; bypass&amp;#xD558;&amp;#xB294; CVE-2021-1648&amp;#xC744; patch diffing&amp;#xC73C;&amp;#xB85C; &amp;#xC9C1;&amp;#xC811; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB3C4; &amp;#xB123;&amp;#xC73C;&amp;#xBA74; &amp;#xC870;&amp;#xAE08; &amp;#xC5EC;&amp;#xC720;&amp;#xB86D;&amp;#xAC8C; &amp;#xC900;&amp;#xBE44;&amp;#xD558;&amp;#xACA0;&amp;#xAD6C;&amp;#xB098; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_20.30.34.png&#34; alt=&#34;Screen Shot 2021-09-07 at 20.30.34.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5B4;..&amp;#xC5EC;&amp;#xC720;&amp;#xB86D;&amp;#xAC8C;&amp;#x2026;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_20.45.42.png&#34; alt=&#34;Screen Shot 2021-09-07 at 20.45.42.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;43&amp;#xD398;&amp;#xC774;&amp;#xC9C0;.. &amp;#xC5B4;&amp;#xB77C;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_19.35.45.png&#34; alt=&#34;Screen Shot 2021-09-07 at 19.35.45.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xAD6D; &amp;#xC5EC;&amp;#xC720;&amp;#xB86D;&amp;#xAC8C; 3&amp;#xC77C; &amp;#xBC24;&amp;#xC0D8;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&#34;&amp;#xAC00;&amp;#xC790;-&amp;#xBD80;&amp;#xC0B0;&amp;#xC73C;&amp;#xB85C;&#34;&gt;&lt;a href=&#34;#&amp;#xAC00;&amp;#xC790;-&amp;#xBD80;&amp;#xC0B0;&amp;#xC73C;&amp;#xB85C;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC00;&amp;#xC790; &amp;#xBD80;&amp;#xC0B0;&amp;#xC73C;&amp;#xB85C;!&#34;&gt;&lt;/a&gt;&amp;#xAC00;&amp;#xC790; &amp;#xBD80;&amp;#xC0B0;&amp;#xC73C;&amp;#xB85C;!&lt;/h1&gt;&lt;p&gt;&lt;del&gt;&amp;#xBCBC;&amp;#xB77D;&amp;#xCE58;&amp;#xAE30;&amp;#xB85C;&lt;/del&gt; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xC900;&amp;#xBE44;&amp;#xD55C; &amp;#xB355;&amp;#xC5D0; &amp;#xB2E4;&amp;#xD589;&amp;#xD788; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790; &amp;#xC120;&amp;#xC815; &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0; &amp;#xC800;&amp;#xC640; Fabu1ous &amp;#xB458; &amp;#xB2E4; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB85C; &amp;#xC120;&amp;#xC815;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xB354;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;! &amp;#xC5BC;&amp;#xB978; &amp;#xAE40;&amp;#xD3EC;&amp;#xACF5;&amp;#xD56D;&amp;#xC5D0;&amp;#xC11C; &amp;#xAE40;&amp;#xD574;&amp;#xACF5;&amp;#xD56D;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xB294; &amp;#xD56D;&amp;#xACF5;&amp;#xD3B8;&amp;#xC744; &amp;#xC608;&amp;#xB9E4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC1C;&amp;#xD45C;&amp;#xAC00; 1&amp;#xC2DC;&amp;#xBD80;&amp;#xD130;&amp;#xC600;&amp;#xC73C;&amp;#xB2C8; &amp;#xC801;&amp;#xC5B4;&amp;#xB3C4; 9&amp;#xC2DC; &amp;#xBE44;&amp;#xD589;&amp;#xAE30;&amp;#xB294; &amp;#xD0C0;&amp;#xC57C; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xB9DE;&amp;#xCD9C; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC8E0;. &amp;#xAE40;&amp;#xD3EC;&amp;#xACF5;&amp;#xD56D;&amp;#xC5D0;&amp;#xC11C; 15&amp;#xBD84; &amp;#xAC70;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC0B4;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; 7&amp;#xC2DC;&amp;#xC5D0; &amp;#xC77C;&amp;#xC5B4;&amp;#xB098;&amp;#xB294;&amp;#xAC70; &amp;#xB108;&amp;#xBB34; &amp;#xD798;&amp;#xB4EC; &amp;#x3160;&amp;#x3160; &lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC800; &amp;#xC0C8;x.. &amp;#xC544;&amp;#xB2C8; &amp;#xC800; &amp;#xD615;&amp;#xC774;?  (Fabu1ous, &amp;#xACF5;&amp;#xD56D;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD55C;&amp;#xC2DC;&amp;#xAC04; &amp;#xBC18; &amp;#xAC70;&amp;#xB9AC;)&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xD2BC;! &amp;#xAE40;&amp;#xD574;&amp;#xACF5;&amp;#xD56D;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xB294; &amp;#xBE44;&amp;#xD589;&amp;#xAE30;&amp;#xB97C; &amp;#xD0C0;&amp;#xACE0; &amp;#xBD80;&amp;#xC0B0;&amp;#xC73C;&amp;#xB85C; &amp;#xCD9C;&amp;#xBC1C;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! (Photo by Fabu1ous)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Untitled%201.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD55C;&amp;#xC2DC;&amp;#xAC04; &amp;#xC815;&amp;#xB3C4;&amp;#xB97C; &amp;#xB0A0;&amp;#xC544; &amp;#xAE40;&amp;#xD574;&amp;#xACF5;&amp;#xD56D;&amp;#xC5D0; &amp;#xB3C4;&amp;#xCC29;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &amp;#xC804;&amp;#xC5ED;&amp;#xC5EC;&amp;#xD589; &amp;#xC774;&amp;#xD6C4;&amp;#xB85C; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C; &amp;#xC624;&amp;#xB294; &amp;#xBD80;&amp;#xC0B0;!.. &amp;#xC744; &amp;#xB290;&amp;#xB084; &amp;#xC0C8;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xBCA1;&amp;#xC2A4;&amp;#xCF54;&amp;#xB85C; &amp;#xD5A5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x3160;&amp;#x3160; &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_16.59.38.png&#34; alt=&#34;Screen Shot 2021-09-07 at 16.59.38.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB098; &amp;#xC0AC;&amp;#xC9C4; &amp;#xC9C4;&amp;#xC9DC; &amp;#xBABB;&amp;#xCC0D;&amp;#xB124;..? &lt;del&gt;PEXCO &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;&lt;/del&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xBCA1;&amp;#xC2A4;&amp;#xCF54;&amp;#xC5D0; &amp;#xB3C4;&amp;#xCC29;&amp;#xD558;&amp;#xB2C8; &amp;#xC810;&amp;#xC2EC;&amp;#xC2DC;&amp;#xAC04;&amp;#xC774;&amp;#xB77C; &amp;#xBC30;&amp;#xB3C4; &amp;#xACE0;&amp;#xD320;&amp;#xACE0; &amp;#xC2DC;&amp;#xAC04;&amp;#xB3C4; &amp;#xC880; &amp;#xB0A8;&amp;#xC544;&amp;#xC11C; &amp;#xBC25;&amp;#xBD80;&amp;#xD130; &amp;#xBA39;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_20.54.22.png&#34; alt=&#34;Screen Shot 2021-09-07 at 20.54.22.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xBD80;&amp;#xC0B0;&amp;#xAC00;&amp;#xBA74; &amp;#xBB50;&amp;#xB2E4;? &amp;#xB3FC;&amp;#xC9C0;&amp;#xAD6D;&amp;#xBC25;&amp;#xC774;&amp;#xB2E4;! &amp;#xC5EC;&amp;#xAE30; &amp;#xC874;&amp;#xB9DB;&amp;#xC774;&amp;#xC5D0;&amp;#xC694; &amp;#x3139;&amp;#x3147; &amp;#xAF2D;&amp;#xAC00;&amp;#xC2ED;&amp;#xC1FC;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_16.49.09.png&#34; alt=&#34;Screen Shot 2021-09-07 at 16.49.09.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB098; &amp;#xC774;&amp;#xAC70; &amp;#xBA39;&amp;#xC73C;&amp;#xB824;&amp;#xACE0; &amp;#xBD80;&amp;#xC0B0;&amp;#xC654;&amp;#xB124;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB300;&amp;#xAE30; &amp;#xB300;&amp;#xC2E0; &amp;#xC308;&amp;#xC7A5;&amp;#xC744; &amp;#xB123;&amp;#xC5B4; &amp;#xC8FC;&amp;#xB358;&amp;#xB370; &amp;#xBD80;&amp;#xC0B0; &amp;#xD2B9;&amp;#xC0C9;&amp;#xC778;&amp;#xAC00;&amp;#xC694;? &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &amp;#xC774; &amp;#xAC00;&amp;#xAC8C;&amp;#xB9CC;&amp;#xC758; &amp;#xB808;&amp;#xC2DC;&amp;#xD53C;&amp;#xC778;&amp;#xAC00;&amp;#xC694;? &amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xC5C4;&amp;#xCCAD; &amp;#xB9DB;&amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_16.48.47.png&#34; alt=&#34;Screen Shot 2021-09-07 at 16.48.47.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB3C4;&amp;#xCC29;&amp;#xD558;&amp;#xC790;&amp;#xB9C8;&amp;#xC790; &amp;#xD654;&amp;#xC7A5;&amp;#xC2E4; &amp;#xAE09;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0AC;&amp;#xB77C;&amp;#xC9C4; Fabu1ous &amp;#xAE30;&amp;#xB2E4;&amp;#xB9AC;&amp;#xBA74;&amp;#xC11C;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xD655;&amp;#xC2E4;&amp;#xD788; &amp;#xCF54;&amp;#xB85C;&amp;#xB098;&amp;#xB77C;&amp;#xC11C; &amp;#xBCA1;&amp;#xC2A4;&amp;#xCF54;&amp;#xC5D0;&amp;#xC11C; &amp;#xD558;&amp;#xB294; &amp;#xD589;&amp;#xC0AC;&amp;#xAC00; &amp;#xBAA8;&amp;#xB450; &amp;#xBE44;&amp;#xB300;&amp;#xBA74;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xB354;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;. &amp;#xBD81;&amp;#xC801;&amp;#xBD81;&amp;#xC801;&amp;#xD574;&amp;#xC57C; &amp;#xC7AC;&amp;#xBC0C;&amp;#xB294;&amp;#xB370; &amp;#xC544;&amp;#xC26C;&amp;#xC6E0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x3160;&amp;#x3160; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xB610; &amp;#xBC1C;&amp;#xD45C;&amp;#xD560; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8;&amp;#xB54C;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xC880; &amp;#xB354; &amp;#xB098;&amp;#xC544;&amp;#xC84C;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC900;&amp;#xBE44;&amp;#xAE30;&amp;#xAC04;&amp;#xC774; &amp;#xC870;&amp;#xAE08; &amp;#xC9E7;&amp;#xC544;&amp;#xC11C; &amp;#xC544;&amp;#xC26C;&amp;#xC6B4; &amp;#xC810;&amp;#xB3C4; &amp;#xC788;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xD589;&amp;#xD788; &amp;#xBC1C;&amp;#xD45C;&amp;#xB294; &amp;#xD070; &amp;#xC2E4;&amp;#xC218; &amp;#xC5C6;&amp;#xC774; &amp;#xBB34;&amp;#xC0AC;&amp;#xD788; &amp;#xB9C8;&amp;#xCE60; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB978; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xBD84;&amp;#xB4E4;&amp;#xC774; &amp;#xBC1C;&amp;#xD45C;&amp;#xD558;&amp;#xC2E0; &amp;#xB2E4;&amp;#xB978; &amp;#xC88B;&amp;#xC740; &amp;#xC8FC;&amp;#xC81C;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC9C1;&amp;#xC811; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xC88B;&amp;#xC740; &amp;#xACBD;&amp;#xD5D8;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xD3EC;&amp;#xB7FC;&amp;#xC744; &amp;#xC900;&amp;#xBE44;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0; &amp;#xC2A4;&amp;#xD0F6;&amp;#xBD84;&amp;#xB4E4;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC800;&amp;#xD76C; &amp;#xD300;&amp;#xC5D0; &amp;#xAD00;&amp;#xC2EC;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC8FC;&amp;#xC2E0; 2021 &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xBD84;&amp;#xB4E4; &amp;#xBAA8;&amp;#xB450; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/08/l0ch/securityone_forum_review/Untitled%202.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;!&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2021/09/08/l0ch/securityone_forum_review/Untitled 2.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/09/08/l0ch/securityone_forum_review/">

  <title>[Daily-Life] 부산까지 가서 발표한 썰 푼다, 시원포럼 발표 후기 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-09-08 22:00" pubdate>
      2021년 9월 8일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      20
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Daily-Life] 부산까지 가서 발표한 썰 푼다, 시원포럼 발표 후기</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! L0ch&#xC785;&#xB2C8;&#xB2E4;. &#xC77C;&#xC0C1; &#xAE00;&#xB85C;&#xB294; &#xC624;&#xB79C;&#xB9CC;&#xC5D0; &#xB3CC;&#xC544;&#xC654;&#xB124;&#xC694;. &#x2192; &#xB9E8;&#xB0A0; &#xC5F0;&#xAD6C;&#xC5D0; &#xCC0C;&#xB4E4;&#xC5B4; &#xC0B4;&#xC558;&#xB2E4;&#xB294; &#xB73B;..</p>
<p>&#xC5BC;&#xB9C8; &#xC804; Fabu1ous&#xC640; &#xD568;&#xAED8; &#xBD80;&#xC0B0; &#xBCA1;&#xC2A4;&#xCF54;&#xC5D0;&#xC11C; &#xC5F4;&#xB9AC;&#xB294; 2021 &#xC0AC;&#xC774;&#xBC84;&#xBCF4;&#xC548; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;&#xC5D0;&#xC11C; &#xBC1C;&#xD45C;&#xB97C; &#xD558;&#xACE0; &#xC654;&#xB294;&#xB370;&#xC694;, &#xAC04;&#xB2E8;&#xD55C; &#xD6C4;&#xAE30;&#xB97C; &#xB0A8;&#xACA8;&#xBCF4;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4; &#x314E;&#x314E;</p>
<h1 id="&#xAC11;&#xC790;&#xAE30;-&#xBC1C;&#xD45C;&#xB97C;-&#xD558;&#xB77C;&#xAD6C;&#xC694;"><a href="#&#xAC11;&#xC790;&#xAE30;-&#xBC1C;&#xD45C;&#xB97C;-&#xD558;&#xB77C;&#xAD6C;&#xC694;" class="headerlink" title="&#xAC11;&#xC790;&#xAE30; &#xBC1C;&#xD45C;&#xB97C; &#xD558;&#xB77C;&#xAD6C;&#xC694;?"></a>&#xAC11;&#xC790;&#xAE30; &#xBC1C;&#xD45C;&#xB97C; &#xD558;&#xB77C;&#xAD6C;&#xC694;?</h1><p>&#xC5B4;&#xB290; &#xD3C9;&#xD654;&#xB85C;&#xC6B4; &#xC8FC;&#xB9D0;, &#xC2AC;&#xB799;&#xC5D0; &#xC5B4;&#xB5A4; &#xC0AC;&#xC9C4; &#xD558;&#xB098;&#xAC00; &#xC62C;&#xB77C;&#xC624;&#xB294;&#xB370;..</p>
<p><img src="/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_17.13.31.png" srcset="/img/loading.gif" alt="Screen Shot 2021-09-07 at 17.13.31.png"></p>
<p>Security One&#xC5D0;&#xC11C; 2021 &#xC0AC;&#xC774;&#xBC84;&#xBCF4;&#xC548; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4; &#xB54C; &#xC9C4;&#xD589;&#xD560; &#xC2DC;&#xC6D0;&#xD3EC;&#xB7FC;&#xC758; &#xBC1C;&#xD45C;&#xC790;&#xB97C; &#xBAA8;&#xC9D1;&#xD55C;&#xB2E4;&#xB294; &#xB0B4;&#xC6A9;&#xC758; &#xCEA1;&#xCC98;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xC804; &#xC8FC;&#xB9D0;&#xC5D0; &#xB9E4;&#xC6B0; &#xBC14;&#xC058;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC2AC;&#xB799;&#xC744; &#xBCF4;&#xC9C0; &#xC54A;&#xC558;&#xC8E0;. &#xBB50;&#xD558;&#xB290;&#xB77C; &#xBC14;&#xBE74;&#xB0D0;&#xAD6C;&#xC694;?</p>
<p>.</p>
<p>.</p>
<p><img src="/2021/09/08/l0ch/securityone_forum_review/Untitled.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p>&#xC544;&#xD06C;&#xB77C;&#xC2DC;&#xC544; &#xC5EC;&#xD589;&#xD558;&#xB290;&#xB77C; &#xBC14;&#xBE74;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
</blockquote>
<p>&#xB2F9;&#xB2F9;&#xD558;&#xAC8C; &#xC6D4;&#xC694;&#xC77C;&#xC5D0; &#xCD9C;&#xADFC;&#xD574;&#xC11C; &#xC2E0;&#xCCAD; &#xB9C8;&#xAC10;&#xC77C;&#xC744; &#xBCF4;&#xB2C8;&#xAE4C; &#xB9C8;&#xAC10;&#xC77C;&#xAE4C;&#xC9C0; &#xB2F9;&#xC7A5; 3&#xC77C;&#xC774; &#xB0A8;&#xC544;&#xC11C; &#xD638;&#xB2E4;&#xB2E5; &#xC8FC;&#xC81C;&#xB97C; &#xC815;&#xD558;&#xACE0; &#xBC1C;&#xD45C;&#xC790;&#xB8CC;&#xBD80;&#xD130; &#xB9CC;&#xB4E4;&#xAE30;&#xB85C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xD589;&#xD788; &#xC608;&#xC804;&#xC5D0; &#xC708;&#xB3C4;&#xC6B0; &#xD328;&#xCE58;&#xB97C; &#xB514;&#xD551;&#xBD84;&#xC11D;&#xD55C; &#xC5F0;&#xAD6C;&#xAE00;&#xC778;</p>
<p><a href="https://hackyboiz.github.io/2020/11/15/l0ch/windows-patch-diffing-part1/">[Research] Windows Patch Diffing &#xB9DB;&#xBCF4;&#xAE30; Part 1</a> </p>
<p><a href="https://hackyboiz.github.io/2020/11/29/l0ch/windows-patch-diffing-part2/">[Research] Windows Patch Diffing &#xB9DB;&#xBCF4;&#xAE30; Part 2</a> </p>
<p>&#xC774; &#xB450; &#xAC1C;&#xB97C; &#xC4F0;&#xBA74;&#xC11C; &#xB098;&#xC911;&#xC5D0; &#xBC1C;&#xD45C;&#xC8FC;&#xC81C;&#xB85C; &#xD574;&#xB3C4; &#xC88B;&#xC744;&#xAC83; &#xAC19;&#xB2E4;~ &#xB77C;&#xB294; &#xC774;&#xC57C;&#xAE30;&#xB97C; &#xD55C; &#xC801;&#xC774; &#xC788;&#xC5B4; &#xC8FC;&#xC81C;&#xB294; &#xAE08;&#xBC29; &#xC815;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC911;&#xAC04;&#xC5D0; &#xB0B4;&#xC6A9;&#xB3C4; &#xC870;&#xAE08; &#xCD94;&#xAC00;&#xD560; &#xACB8; Windows &#xD504;&#xB9B0;&#xD130; &#xC2A4;&#xD480;&#xB7EC; API &#xCDE8;&#xC57D;&#xC810;&#xC778; CVE-2020-0986&#xACFC; &#xCDE8;&#xC57D;&#xC810; &#xD328;&#xCE58;&#xB97C; bypass&#xD558;&#xB294; CVE-2021-1648&#xC744; patch diffing&#xC73C;&#xB85C; &#xC9C1;&#xC811; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xB0B4;&#xC6A9;&#xB3C4; &#xB123;&#xC73C;&#xBA74; &#xC870;&#xAE08; &#xC5EC;&#xC720;&#xB86D;&#xAC8C; &#xC900;&#xBE44;&#xD558;&#xACA0;&#xAD6C;&#xB098; &#xC0DD;&#xAC01;&#xD588;&#xC5B4;&#xC694;. </p>
<p><img src="/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_20.30.34.png" srcset="/img/loading.gif" alt="Screen Shot 2021-09-07 at 20.30.34.png"></p>
<p>&#xC5B4;..&#xC5EC;&#xC720;&#xB86D;&#xAC8C;&#x2026;?</p>
<p><img src="/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_20.45.42.png" srcset="/img/loading.gif" alt="Screen Shot 2021-09-07 at 20.45.42.png"></p>
<p>43&#xD398;&#xC774;&#xC9C0;.. &#xC5B4;&#xB77C;?</p>
<p><img src="/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_19.35.45.png" srcset="/img/loading.gif" alt="Screen Shot 2021-09-07 at 19.35.45.png"></p>
<blockquote>
<p>&#xACB0;&#xAD6D; &#xC5EC;&#xC720;&#xB86D;&#xAC8C; 3&#xC77C; &#xBC24;&#xC0D8;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<h1 id="&#xAC00;&#xC790;-&#xBD80;&#xC0B0;&#xC73C;&#xB85C;"><a href="#&#xAC00;&#xC790;-&#xBD80;&#xC0B0;&#xC73C;&#xB85C;" class="headerlink" title="&#xAC00;&#xC790; &#xBD80;&#xC0B0;&#xC73C;&#xB85C;!"></a>&#xAC00;&#xC790; &#xBD80;&#xC0B0;&#xC73C;&#xB85C;!</h1><p><del>&#xBCBC;&#xB77D;&#xCE58;&#xAE30;&#xB85C;</del> &#xC5F4;&#xC2EC;&#xD788; &#xC900;&#xBE44;&#xD55C; &#xB355;&#xC5D0; &#xB2E4;&#xD589;&#xD788; &#xBC1C;&#xD45C;&#xC790; &#xC120;&#xC815; &#xACB0;&#xACFC;&#xC5D0; &#xC800;&#xC640; Fabu1ous &#xB458; &#xB2E4; &#xBC1C;&#xD45C;&#xC790;&#xB85C; &#xC120;&#xC815;&#xC774; &#xB418;&#xC5C8;&#xB354;&#xB77C;&#xAD6C;&#xC694;! &#xC5BC;&#xB978; &#xAE40;&#xD3EC;&#xACF5;&#xD56D;&#xC5D0;&#xC11C; &#xAE40;&#xD574;&#xACF5;&#xD56D;&#xC73C;&#xB85C; &#xAC00;&#xB294; &#xD56D;&#xACF5;&#xD3B8;&#xC744; &#xC608;&#xB9E4;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC1C;&#xD45C;&#xAC00; 1&#xC2DC;&#xBD80;&#xD130;&#xC600;&#xC73C;&#xB2C8; &#xC801;&#xC5B4;&#xB3C4; 9&#xC2DC; &#xBE44;&#xD589;&#xAE30;&#xB294; &#xD0C0;&#xC57C; &#xC2DC;&#xAC04;&#xC744; &#xB9DE;&#xCD9C; &#xC218; &#xC788;&#xC5C8;&#xC8E0;. &#xAE40;&#xD3EC;&#xACF5;&#xD56D;&#xC5D0;&#xC11C; 15&#xBD84; &#xAC70;&#xB9AC;&#xC5D0; &#xC0B4;&#xAE34; &#xD558;&#xC9C0;&#xB9CC; &#xADF8;&#xB798;&#xB3C4; 7&#xC2DC;&#xC5D0; &#xC77C;&#xC5B4;&#xB098;&#xB294;&#xAC70; &#xB108;&#xBB34; &#xD798;&#xB4EC; &#x3160;&#x3160; </p>
<blockquote>
<p>&#xC800; &#xC0C8;x.. &#xC544;&#xB2C8; &#xC800; &#xD615;&#xC774;?  (Fabu1ous, &#xACF5;&#xD56D;&#xAE4C;&#xC9C0; &#xD55C;&#xC2DC;&#xAC04; &#xBC18; &#xAC70;&#xB9AC;)</p>
</blockquote>
<p>&#xC544;&#xBB34;&#xD2BC;! &#xAE40;&#xD574;&#xACF5;&#xD56D;&#xC73C;&#xB85C; &#xAC00;&#xB294; &#xBE44;&#xD589;&#xAE30;&#xB97C; &#xD0C0;&#xACE0; &#xBD80;&#xC0B0;&#xC73C;&#xB85C; &#xCD9C;&#xBC1C;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;! (Photo by Fabu1ous)</p>
<p><img src="/2021/09/08/l0ch/securityone_forum_review/Untitled%201.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xD55C;&#xC2DC;&#xAC04; &#xC815;&#xB3C4;&#xB97C; &#xB0A0;&#xC544; &#xAE40;&#xD574;&#xACF5;&#xD56D;&#xC5D0; &#xB3C4;&#xCC29;&#xD588;&#xC5B4;&#xC694;. &#xC804;&#xC5ED;&#xC5EC;&#xD589; &#xC774;&#xD6C4;&#xB85C; &#xB450; &#xBC88;&#xC9F8;&#xB85C; &#xC624;&#xB294; &#xBD80;&#xC0B0;!.. &#xC744; &#xB290;&#xB084; &#xC0C8;&#xB3C4; &#xC5C6;&#xC774; &#xBC14;&#xB85C; &#xBCA1;&#xC2A4;&#xCF54;&#xB85C; &#xD5A5;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#x3160;&#x3160; </p>
<p><img src="/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_16.59.38.png" srcset="/img/loading.gif" alt="Screen Shot 2021-09-07 at 16.59.38.png"></p>
<blockquote>
<p>&#xB098; &#xC0AC;&#xC9C4; &#xC9C4;&#xC9DC; &#xBABB;&#xCC0D;&#xB124;..? <del>PEXCO &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;</del></p>
</blockquote>
<p>&#xBCA1;&#xC2A4;&#xCF54;&#xC5D0; &#xB3C4;&#xCC29;&#xD558;&#xB2C8; &#xC810;&#xC2EC;&#xC2DC;&#xAC04;&#xC774;&#xB77C; &#xBC30;&#xB3C4; &#xACE0;&#xD320;&#xACE0; &#xC2DC;&#xAC04;&#xB3C4; &#xC880; &#xB0A8;&#xC544;&#xC11C; &#xBC25;&#xBD80;&#xD130; &#xBA39;&#xC5C8;&#xC5B4;&#xC694;.</p>
<p><img src="/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_20.54.22.png" srcset="/img/loading.gif" alt="Screen Shot 2021-09-07 at 20.54.22.png"></p>
<blockquote>
<p>&#xBD80;&#xC0B0;&#xAC00;&#xBA74; &#xBB50;&#xB2E4;? &#xB3FC;&#xC9C0;&#xAD6D;&#xBC25;&#xC774;&#xB2E4;! &#xC5EC;&#xAE30; &#xC874;&#xB9DB;&#xC774;&#xC5D0;&#xC694; &#x3139;&#x3147; &#xAF2D;&#xAC00;&#xC2ED;&#xC1FC;</p>
</blockquote>
<p><img src="/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_16.49.09.png" srcset="/img/loading.gif" alt="Screen Shot 2021-09-07 at 16.49.09.png"></p>
<blockquote>
<p>&#xB098; &#xC774;&#xAC70; &#xBA39;&#xC73C;&#xB824;&#xACE0; &#xBD80;&#xC0B0;&#xC654;&#xB124;</p>
</blockquote>
<p>&#xB2E4;&#xB300;&#xAE30; &#xB300;&#xC2E0; &#xC308;&#xC7A5;&#xC744; &#xB123;&#xC5B4; &#xC8FC;&#xB358;&#xB370; &#xBD80;&#xC0B0; &#xD2B9;&#xC0C9;&#xC778;&#xAC00;&#xC694;? &#xC544;&#xB2C8;&#xBA74; &#xC774; &#xAC00;&#xAC8C;&#xB9CC;&#xC758; &#xB808;&#xC2DC;&#xD53C;&#xC778;&#xAC00;&#xC694;? &#xC544;&#xBB34;&#xD2BC; &#xC5C4;&#xCCAD; &#xB9DB;&#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/08/l0ch/securityone_forum_review/Screen_Shot_2021-09-07_at_16.48.47.png" srcset="/img/loading.gif" alt="Screen Shot 2021-09-07 at 16.48.47.png"></p>
<blockquote>
<p>&#xB3C4;&#xCC29;&#xD558;&#xC790;&#xB9C8;&#xC790; &#xD654;&#xC7A5;&#xC2E4; &#xAE09;&#xD558;&#xB2E4;&#xACE0; &#xC0AC;&#xB77C;&#xC9C4; Fabu1ous &#xAE30;&#xB2E4;&#xB9AC;&#xBA74;&#xC11C;</p>
</blockquote>
<p>&#xD655;&#xC2E4;&#xD788; &#xCF54;&#xB85C;&#xB098;&#xB77C;&#xC11C; &#xBCA1;&#xC2A4;&#xCF54;&#xC5D0;&#xC11C; &#xD558;&#xB294; &#xD589;&#xC0AC;&#xAC00; &#xBAA8;&#xB450; &#xBE44;&#xB300;&#xBA74;&#xC73C;&#xB85C; &#xC9C4;&#xD589;&#xB418;&#xB354;&#xB77C;&#xAD6C;&#xC694;. &#xBD81;&#xC801;&#xBD81;&#xC801;&#xD574;&#xC57C; &#xC7AC;&#xBC0C;&#xB294;&#xB370; &#xC544;&#xC26C;&#xC6E0;&#xC2B5;&#xB2C8;&#xB2E4;&#x3160;&#x3160; &#xB2E4;&#xC74C;&#xC5D0; &#xB610; &#xBC1C;&#xD45C;&#xD560; &#xAE30;&#xD68C;&#xAC00; &#xC788;&#xB2E4;&#xBA74; &#xADF8;&#xB54C;&#xB294; &#xC0C1;&#xD669;&#xC774; &#xC880; &#xB354; &#xB098;&#xC544;&#xC84C;&#xC73C;&#xBA74; &#xC88B;&#xACA0;&#xB124;&#xC694;.</p>
<p>&#xC900;&#xBE44;&#xAE30;&#xAC04;&#xC774; &#xC870;&#xAE08; &#xC9E7;&#xC544;&#xC11C; &#xC544;&#xC26C;&#xC6B4; &#xC810;&#xB3C4; &#xC788;&#xC5C8;&#xC9C0;&#xB9CC; &#xB2E4;&#xD589;&#xD788; &#xBC1C;&#xD45C;&#xB294; &#xD070; &#xC2E4;&#xC218; &#xC5C6;&#xC774; &#xBB34;&#xC0AC;&#xD788; &#xB9C8;&#xCE60; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB978; &#xBC1C;&#xD45C;&#xC790;&#xBD84;&#xB4E4;&#xC774; &#xBC1C;&#xD45C;&#xD558;&#xC2E0; &#xB2E4;&#xB978; &#xC88B;&#xC740; &#xC8FC;&#xC81C;&#xB4E4;&#xB3C4; &#xC9C1;&#xC811; &#xBCFC; &#xC218; &#xC788;&#xC5B4; &#xC88B;&#xC740; &#xACBD;&#xD5D8;&#xC774; &#xB418;&#xC5C8;&#xB124;&#xC694;. </p>
<p>&#xC774;&#xBC88; &#xD3EC;&#xB7FC;&#xC744; &#xC900;&#xBE44;&#xD574;&#xC8FC;&#xC2E0; &#xC2A4;&#xD0F6;&#xBD84;&#xB4E4;, &#xADF8;&#xB9AC;&#xACE0; &#xC800;&#xD76C; &#xD300;&#xC5D0; &#xAD00;&#xC2EC;&#xC744; &#xAC00;&#xC838;&#xC8FC;&#xC2E0; 2021 &#xC0AC;&#xC774;&#xBC84; &#xBCF4;&#xC548; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4; &#xCC38;&#xC5EC;&#xC790;&#xBD84;&#xB4E4; &#xBAA8;&#xB450; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2021/09/08/l0ch/securityone_forum_review/Untitled%202.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xC548;&#xB155;!</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Daily-Life/">Daily-Life</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/Fabu1ous/">Fabu1ous</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/review/">review</a>
                  
                  <a class="hover-with-bg" href="/tags/security-one/">security one</a>
                  
                  <a class="hover-with-bg" href="/tags/daily/">daily</a>
                  
                  <a class="hover-with-bg" href="/tags/gookbab/">gookbab</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/09/09/l0ch/2021-09-09/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2021-37678: Google TensorFlow의 임의 코드 실행 취약점과 YAML 지원 중단</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/09/08/l0ch/windows_1-day_patch_diffing/">
                    <span class="hidden-mobile">[Research] Windows 1-day patch 분석 및 bypass with diffing</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/09/08/l0ch/securityone_forum_review/';
        this.page.identifier = '/2021/09/08/l0ch/securityone_forum_review/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Daily-Life] 부산까지 가서 발표한 썰 푼다, 시원포럼 발표 후기&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
