

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; : ) &amp;#xC2DC;&amp;#xB8E8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC6D0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBD88;&amp;#xD2B9;&amp;#xC815; &amp;#xB2E4;&amp;#xC218;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xC774;-&amp;#xC81C;-&amp;#xC694;&amp;#xCCAD;&amp;#xACFC;-&amp;#xB2EC;&amp;#xB77C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#&amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xC774;-&amp;#xC81C;-&amp;#xC694;&amp;#xCCAD;&amp;#xACFC;-&amp;#xB2EC;&amp;#xB77C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xC774; &amp;#xC81C; &amp;#xC694;&amp;#xCCAD;&amp;#xACFC; &amp;#xB2EC;&amp;#xB77C;&amp;#xC694;&#34;&gt;&lt;/a&gt;&amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xC774; &amp;#xC81C; &amp;#xC694;&amp;#xCCAD;&amp;#xACFC; &amp;#xB2EC;&amp;#xB77C;&amp;#xC694;&lt;/h3&gt;&lt;p&gt;&amp;#xC124;&amp;#xBA85;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xB294; &amp;#xBB38;&amp;#xC7A5;&amp;#xACFC; &amp;#xAE38;&amp;#xC774;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xBA74; &amp;#xAE38;&amp;#xC774;&amp;#xB9CC;&amp;#xD07C; &amp;#xC798;&amp;#xB77C; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC7A5;&amp;#xB09C;&amp;#xAFB8;&amp;#xB7EC;&amp;#xAE30; &amp;#xC2DC;&amp;#xB8E8;&amp;#xAC00; &amp;#x201C;&amp;#xC2DC;&amp;#xB8E8;&amp;#xBC18;&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBB38;&amp;#xC7A5;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD574;&amp;#xB193;&amp;#xACE0; &amp;#xB450; &amp;#xAE00;&amp;#xC790;&amp;#xB9CC; &amp;#xC785;&amp;#xB825;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/06/syru/funny-smuggling-story-pt1/label_printer_for_prologue.png&#34; alt=&#34;label printer image for prologue&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB2E4;&amp;#xC74C; &amp;#xC785;&amp;#xB825;&amp;#xC774;&amp;#xC5C8;&amp;#xB358; &amp;#x201C;&amp;#xBBFC;&amp;#xCD08;&amp;#xB2E8;&amp;#x201D; &amp;#xB77C;&amp;#xBCA8;&amp;#xC774; &amp;#x201C;&amp;#xBC18;&amp;#xBBFC;&amp;#xCD08;&amp;#x201D;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4;&amp;#xBC84;&amp;#xB838;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; &amp;#xC2DC;&amp;#xB8E8;&amp;#xC758; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD55C; &amp;#xD6C4; &amp;#xB0A8;&amp;#xC740; &amp;#x2018;&amp;#xBC18;&amp;#x2019;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAE00;&amp;#xC790;&amp;#xAC00; &amp;#xB2E4;&amp;#xC74C; &amp;#xC694;&amp;#xCCAD;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xC77C;&amp;#xC774; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB098;&amp;#xC758; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xD0C0;&amp;#xC778;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB294; HTTP Request Smuggling&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;HTTP-Request-Smuggling&#34;&gt;&lt;a href=&#34;#HTTP-Request-Smuggling&#34; class=&#34;headerlink&#34; title=&#34;HTTP Request Smuggling&#34;&gt;&lt;/a&gt;HTTP Request Smuggling&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;HTTP &amp;#xC694;&amp;#xCCAD;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC77C;&amp;#xAD00;&amp;#xC131; &amp;#xC5C6;&amp;#xB294; &amp;#xD574;&amp;#xC11D;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://cwe.mitre.org/data/definitions/444.html&#34;&gt;CWE-444: Inconsistent Interpretation of HTTP Requests (&amp;#x2018;HTTP Request Smuggling&amp;#x2019;)&lt;/a&gt;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xB3D9;&amp;#xC77C;&amp;#xD55C;-TCP-Connection&amp;#xC5D0;&amp;#xC11C;-&amp;#xC5EC;&amp;#xB7EC;&amp;#xAC1C;&amp;#xC758;-HTTP-Message&amp;#xAC00;-&amp;#xCC98;&amp;#xB9AC;&amp;#xB41C;-&amp;#xC0AC;&amp;#xC5F0;&#34;&gt;&lt;a href=&#34;#&amp;#xB3D9;&amp;#xC77C;&amp;#xD55C;-TCP-Connection&amp;#xC5D0;&amp;#xC11C;-&amp;#xC5EC;&amp;#xB7EC;&amp;#xAC1C;&amp;#xC758;-HTTP-Message&amp;#xAC00;-&amp;#xCC98;&amp;#xB9AC;&amp;#xB41C;-&amp;#xC0AC;&amp;#xC5F0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; TCP Connection&amp;#xC5D0;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC;&amp;#xAC1C;&amp;#xC758; HTTP Message&amp;#xAC00; &amp;#xCC98;&amp;#xB9AC;&amp;#xB41C; &amp;#xC0AC;&amp;#xC5F0;&#34;&gt;&lt;/a&gt;&amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; TCP Connection&amp;#xC5D0;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC;&amp;#xAC1C;&amp;#xC758; HTTP Message&amp;#xAC00; &amp;#xCC98;&amp;#xB9AC;&amp;#xB41C; &amp;#xC0AC;&amp;#xC5F0;&lt;/h3&gt;&lt;p&gt;HTTP &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC740; TCP &amp;#xD1B5;&amp;#xC2E0; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;(UDP&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; HTTP 3&amp;#xB294; &amp;#xC774; &amp;#xAE00;&amp;#xC5D0;&amp;#xC120; &amp;#xC5B8;&amp;#xAE09;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;p&gt;TCP &amp;#xD1B5;&amp;#xC2E0;&amp;#xC740; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB294; 3way handshake&amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xAC70;&amp;#xCE69;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;HTTP &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; TCP &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC0C8;&amp;#xB85C; &amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xADF8;&amp;#xB9CC;&amp;#xD07C; handshake&amp;#xB3C4; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC904;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD574; HTTP&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; TCP &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;HTTP&amp;#xC5D0;&amp;#xC11C;-Body-&amp;#xC815;&amp;#xBCF4;&amp;#xB97C;-&amp;#xC5BB;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#HTTP&amp;#xC5D0;&amp;#xC11C;-Body-&amp;#xC815;&amp;#xBCF4;&amp;#xB97C;-&amp;#xC5BB;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;HTTP&amp;#xC5D0;&amp;#xC11C; Body &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;/a&gt;HTTP&amp;#xC5D0;&amp;#xC11C; Body &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://datatracker.ietf.org/doc/html/rfc7230#section-3.3.3&#34;&gt;RFC &amp;#xBB38;&amp;#xC11C;&lt;/a&gt;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; Body&amp;#xC758; &amp;#xAE38;&amp;#xC774;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xADDC;&amp;#xCE59;&amp;#xC744; &amp;#xB530;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Transfer-Encoding &amp;#xD5E4;&amp;#xB354;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0; chunked transfer coding&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB420; &amp;#xB54C; transfer coding&amp;#xC774; data &amp;#xC804;&amp;#xC1A1;&amp;#xC774; &amp;#xB05D;&amp;#xB0AC;&amp;#xC74C;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0AC; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0;&amp;#xC758; &amp;#xAE38;&amp;#xC774;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;Transfer-Encoding &amp;#xD5E4;&amp;#xB354;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; Content-Length &amp;#xD5E4;&amp;#xB354;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xB54C; &amp;#xD574;&amp;#xB2F9; &amp;#xD5E4;&amp;#xB354;&amp;#xC758; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;Transfer-Encoding &amp;#xD5E4;&amp;#xB354;&amp;#xC640; Content-Length &amp;#xD5E4;&amp;#xB354;&amp;#xAC00; &amp;#xBAA8;&amp;#xB450; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA74; Content-Length &amp;#xD5E4;&amp;#xB354; &amp;#xBB34;&amp;#xC2DC;&lt;/li&gt;
&lt;li&gt;Content-Length &amp;#xD5E4;&amp;#xB354;&amp;#xAC00; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; 400 Bad Request &amp;#xCC98;&amp;#xB9AC;&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;&amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xAC00;-&amp;#xC6F9;-&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC600;&amp;#xB2E4;&amp;#xBA74;&#34;&gt;&lt;a href=&#34;#&amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xAC00;-&amp;#xC6F9;-&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC600;&amp;#xB2E4;&amp;#xBA74;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xAC00; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC600;&amp;#xB2E4;&amp;#xBA74;&#34;&gt;&lt;/a&gt;&amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xAC00; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC600;&amp;#xB2E4;&amp;#xBA74;&lt;/h3&gt;&lt;p&gt;&amp;#xB77C;&amp;#xBCA8;&amp;#xAE30; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xB97C; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB85C; &amp;#xD655;&amp;#xC7A5; &amp;#xC2DC;&amp;#xCF1C;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB77C;&amp;#xBCA8;&amp;#xAE30; &amp;#xC785;&amp;#xB825;&amp;#xC740; &amp;#xC644;&amp;#xB8CC;&amp;#xB97C; &amp;#xB204;&amp;#xB97C; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xB2C8; Transfer-Encoding &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xC5B4;&amp;#xC6B8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB77C;&amp;#xBCA8; &amp;#xCEE4;&amp;#xD130;&amp;#xB294; &amp;#xC785;&amp;#xB825;&amp;#xBC1B;&amp;#xC740; &amp;#xAE38;&amp;#xC774;&amp;#xB9CC;&amp;#xD07C; &amp;#xC790;&amp;#xB974;&amp;#xB2C8; Content-Length&amp;#xAC00; &amp;#xC5B4;&amp;#xC6B8;&amp;#xB9AC;&amp;#xACA0;&amp;#xB124;&amp;#xC694;&lt;/p&gt;
&lt;p&gt;&amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xC5D0; &amp;#xBB38;&amp;#xC7A5;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xACE0; &amp;#xC790;&amp;#xB974;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD45C;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/06/syru/funny-smuggling-story-pt1/packet_diagram.png&#34; alt=&#34;packet diagram&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB77C;&amp;#xBCA8; &amp;#xC694;&amp;#xCCAD;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC751;&amp;#xB2F5;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD45C;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/06/syru/funny-smuggling-story-pt1/packet_simplify.png&#34; alt=&#34;simplified stream&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB41C; &amp;#xC6D0;&amp;#xC778;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC77C;&amp;#xAE4C;&amp;#xC694;? &amp;#xC6B0;&amp;#xC120; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xB77C;&amp;#xBCA8;&amp;#xCE74;&amp;#xD2B8;&amp;#xB9AC;&amp;#xC9C0;(TCP &amp;#xCEE4;&amp;#xB125;&amp;#xC158;)&amp;#xC5D0;&amp;#xC11C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0; &amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC758; &amp;#xB05D;(Transfer-Encoding)&amp;#xC774; &amp;#xAE30;&amp;#xC900;&amp;#xC774;&amp;#xC600;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB77C;&amp;#xBCA8; &amp;#xCEE4;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE38;&amp;#xC774;&amp;#xB85C; &amp;#xC785;&amp;#xB825;&amp;#xD55C; &amp;#xAC12;(Content-Length)&amp;#xC774; &amp;#xAE30;&amp;#xC900;&amp;#xC774;&amp;#xC600;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB77C;&amp;#xBCA8; &amp;#xCEE4;&amp;#xD130;&amp;#xB294; &amp;#xC55E;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xB4DC;&amp;#xB9B0; &amp;#xADDC;&amp;#xCE59;&amp;#xC744; &amp;#xC5B4;&amp;#xAE34; &amp;#xC608;&amp;#xC2DC;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xC694;&amp;#xCCAD;&amp;#xC5D0; &amp;#xC0BD;&amp;#xC785;&amp;#xB418;&amp;#xC5B4; &amp;#xD574;&amp;#xB2F9; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xB2E4;&amp;#xB978; &amp;#xC694;&amp;#xCCAD;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xBC84;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &lt;strong&gt;HTTP Request Smuggling&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACF5;&amp;#xACA9;&amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xC720;&amp;#xD615;&amp;#xC774; &amp;#xD06C;&amp;#xAC8C; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Content-Length &amp;#xD5E4;&amp;#xB354; &amp;#xC911;&amp;#xBCF5; &amp;#xBB38;&amp;#xC81C; &amp;#xC774;&amp;#xD558; CL-CL&amp;#xC774;&amp;#xB77C; &amp;#xBD80;&amp;#xB974;&amp;#xB294; &amp;#xC720;&amp;#xD615;&amp;#xACFC; Transfer-Encoding, Content-Length &amp;#xD5E4;&amp;#xB354; &amp;#xD63C;&amp;#xB3D9; &amp;#xBB38;&amp;#xC81C; &amp;#xC774;&amp;#xD558; CL-TE&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB974;&amp;#xB294; &amp;#xC720;&amp;#xD615;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xADF8;&amp;#xB0E5;-&amp;#xD45C;&amp;#xC900;&amp;#xB9CC;-&amp;#xB530;&amp;#xB974;&amp;#xBA74;-&amp;#xB418;&amp;#xB294;-&amp;#xAC83;-&amp;#xC544;&amp;#xB2CC;&amp;#xAC00;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#&amp;#xADF8;&amp;#xB0E5;-&amp;#xD45C;&amp;#xC900;&amp;#xB9CC;-&amp;#xB530;&amp;#xB974;&amp;#xBA74;-&amp;#xB418;&amp;#xB294;-&amp;#xAC83;-&amp;#xC544;&amp;#xB2CC;&amp;#xAC00;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xADF8;&amp;#xB0E5; &amp;#xD45C;&amp;#xC900;&amp;#xB9CC; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xB418;&amp;#xB294; &amp;#xAC83; &amp;#xC544;&amp;#xB2CC;&amp;#xAC00;&amp;#xC694;?&#34;&gt;&lt;/a&gt;&amp;#xADF8;&amp;#xB0E5; &amp;#xD45C;&amp;#xC900;&amp;#xB9CC; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xB418;&amp;#xB294; &amp;#xAC83; &amp;#xC544;&amp;#xB2CC;&amp;#xAC00;&amp;#xC694;?&lt;/h3&gt;&lt;p&gt;&amp;#xB9DE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCD5C;&amp;#xADFC; &amp;#xACF5;&amp;#xACA9; &amp;#xC720;&amp;#xD615;&amp;#xC740; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xD30C;&amp;#xC2F1;&amp;#xD560; &amp;#xB54C; &amp;#xD2B9;&amp;#xC815; &amp;#xD5E4;&amp;#xB354;&amp;#xB97C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD2B9;&amp;#xC218;&amp;#xBB38;&amp;#xC790;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xB2E4;&amp;#xB978; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; Buffer Overflow &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xADDC;&amp;#xCE59;&amp;#xB9CC; &amp;#xB530;&amp;#xB77C;&amp;#xC11C;&amp;#xB294; &amp;#xB300;&amp;#xC751;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xAC83;&amp;#xC774; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD45C;&amp;#xC900;&amp;#xC744; &amp;#xB530;&amp;#xB974;&amp;#xB294; &amp;#xAC83; &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xAE38;&amp;#xC774; &amp;#xAC80;&amp;#xC99D;&amp;#xC774;&amp;#xB098; &amp;#xD2B9;&amp;#xC218;&amp;#xBB38;&amp;#xC790; &amp;#xCC98;&amp;#xB9AC;&amp;#xB4F1;&amp;#xC744; &amp;#xC2E0;&amp;#xACBD;&amp;#xC368;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h2&gt;&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD3EC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xC0AC;&amp;#xB840;&amp;#xB97C; &amp;#xACF5;&amp;#xACA9; &amp;#xC720;&amp;#xD615;&amp;#xBCC4;&amp;#xB85C; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] 재밌는 HTTP Request Smuggling 이야기 (1) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; : ) &amp;#xC2DC;&amp;#xB8E8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC6D0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBD88;&amp;#xD2B9;&amp;#xC815; &amp;#xB2E4;&amp;#xC218;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xC774;-&amp;#xC81C;-&amp;#xC694;&amp;#xCCAD;&amp;#xACFC;-&amp;#xB2EC;&amp;#xB77C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#&amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xC774;-&amp;#xC81C;-&amp;#xC694;&amp;#xCCAD;&amp;#xACFC;-&amp;#xB2EC;&amp;#xB77C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xC774; &amp;#xC81C; &amp;#xC694;&amp;#xCCAD;&amp;#xACFC; &amp;#xB2EC;&amp;#xB77C;&amp;#xC694;&#34;&gt;&lt;/a&gt;&amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xC774; &amp;#xC81C; &amp;#xC694;&amp;#xCCAD;&amp;#xACFC; &amp;#xB2EC;&amp;#xB77C;&amp;#xC694;&lt;/h3&gt;&lt;p&gt;&amp;#xC124;&amp;#xBA85;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xB294; &amp;#xBB38;&amp;#xC7A5;&amp;#xACFC; &amp;#xAE38;&amp;#xC774;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xBA74; &amp;#xAE38;&amp;#xC774;&amp;#xB9CC;&amp;#xD07C; &amp;#xC798;&amp;#xB77C; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC7A5;&amp;#xB09C;&amp;#xAFB8;&amp;#xB7EC;&amp;#xAE30; &amp;#xC2DC;&amp;#xB8E8;&amp;#xAC00; &amp;#x201C;&amp;#xC2DC;&amp;#xB8E8;&amp;#xBC18;&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBB38;&amp;#xC7A5;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD574;&amp;#xB193;&amp;#xACE0; &amp;#xB450; &amp;#xAE00;&amp;#xC790;&amp;#xB9CC; &amp;#xC785;&amp;#xB825;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/06/syru/funny-smuggling-story-pt1/label_printer_for_prologue.png&#34; alt=&#34;label printer image for prologue&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB2E4;&amp;#xC74C; &amp;#xC785;&amp;#xB825;&amp;#xC774;&amp;#xC5C8;&amp;#xB358; &amp;#x201C;&amp;#xBBFC;&amp;#xCD08;&amp;#xB2E8;&amp;#x201D; &amp;#xB77C;&amp;#xBCA8;&amp;#xC774; &amp;#x201C;&amp;#xBC18;&amp;#xBBFC;&amp;#xCD08;&amp;#x201D;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4;&amp;#xBC84;&amp;#xB838;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; &amp;#xC2DC;&amp;#xB8E8;&amp;#xC758; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD55C; &amp;#xD6C4; &amp;#xB0A8;&amp;#xC740; &amp;#x2018;&amp;#xBC18;&amp;#x2019;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAE00;&amp;#xC790;&amp;#xAC00; &amp;#xB2E4;&amp;#xC74C; &amp;#xC694;&amp;#xCCAD;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xC77C;&amp;#xC774; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB098;&amp;#xC758; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xD0C0;&amp;#xC778;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB294; HTTP Request Smuggling&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;HTTP-Request-Smuggling&#34;&gt;&lt;a href=&#34;#HTTP-Request-Smuggling&#34; class=&#34;headerlink&#34; title=&#34;HTTP Request Smuggling&#34;&gt;&lt;/a&gt;HTTP Request Smuggling&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;HTTP &amp;#xC694;&amp;#xCCAD;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC77C;&amp;#xAD00;&amp;#xC131; &amp;#xC5C6;&amp;#xB294; &amp;#xD574;&amp;#xC11D;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://cwe.mitre.org/data/definitions/444.html&#34;&gt;CWE-444: Inconsistent Interpretation of HTTP Requests (&amp;#x2018;HTTP Request Smuggling&amp;#x2019;)&lt;/a&gt;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xB3D9;&amp;#xC77C;&amp;#xD55C;-TCP-Connection&amp;#xC5D0;&amp;#xC11C;-&amp;#xC5EC;&amp;#xB7EC;&amp;#xAC1C;&amp;#xC758;-HTTP-Message&amp;#xAC00;-&amp;#xCC98;&amp;#xB9AC;&amp;#xB41C;-&amp;#xC0AC;&amp;#xC5F0;&#34;&gt;&lt;a href=&#34;#&amp;#xB3D9;&amp;#xC77C;&amp;#xD55C;-TCP-Connection&amp;#xC5D0;&amp;#xC11C;-&amp;#xC5EC;&amp;#xB7EC;&amp;#xAC1C;&amp;#xC758;-HTTP-Message&amp;#xAC00;-&amp;#xCC98;&amp;#xB9AC;&amp;#xB41C;-&amp;#xC0AC;&amp;#xC5F0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; TCP Connection&amp;#xC5D0;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC;&amp;#xAC1C;&amp;#xC758; HTTP Message&amp;#xAC00; &amp;#xCC98;&amp;#xB9AC;&amp;#xB41C; &amp;#xC0AC;&amp;#xC5F0;&#34;&gt;&lt;/a&gt;&amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; TCP Connection&amp;#xC5D0;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC;&amp;#xAC1C;&amp;#xC758; HTTP Message&amp;#xAC00; &amp;#xCC98;&amp;#xB9AC;&amp;#xB41C; &amp;#xC0AC;&amp;#xC5F0;&lt;/h3&gt;&lt;p&gt;HTTP &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC740; TCP &amp;#xD1B5;&amp;#xC2E0; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;(UDP&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; HTTP 3&amp;#xB294; &amp;#xC774; &amp;#xAE00;&amp;#xC5D0;&amp;#xC120; &amp;#xC5B8;&amp;#xAE09;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;p&gt;TCP &amp;#xD1B5;&amp;#xC2E0;&amp;#xC740; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB294; 3way handshake&amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xAC70;&amp;#xCE69;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;HTTP &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; TCP &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC0C8;&amp;#xB85C; &amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xADF8;&amp;#xB9CC;&amp;#xD07C; handshake&amp;#xB3C4; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC904;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD574; HTTP&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; TCP &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;HTTP&amp;#xC5D0;&amp;#xC11C;-Body-&amp;#xC815;&amp;#xBCF4;&amp;#xB97C;-&amp;#xC5BB;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#HTTP&amp;#xC5D0;&amp;#xC11C;-Body-&amp;#xC815;&amp;#xBCF4;&amp;#xB97C;-&amp;#xC5BB;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;HTTP&amp;#xC5D0;&amp;#xC11C; Body &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;/a&gt;HTTP&amp;#xC5D0;&amp;#xC11C; Body &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://datatracker.ietf.org/doc/html/rfc7230#section-3.3.3&#34;&gt;RFC &amp;#xBB38;&amp;#xC11C;&lt;/a&gt;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; Body&amp;#xC758; &amp;#xAE38;&amp;#xC774;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xADDC;&amp;#xCE59;&amp;#xC744; &amp;#xB530;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Transfer-Encoding &amp;#xD5E4;&amp;#xB354;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0; chunked transfer coding&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB420; &amp;#xB54C; transfer coding&amp;#xC774; data &amp;#xC804;&amp;#xC1A1;&amp;#xC774; &amp;#xB05D;&amp;#xB0AC;&amp;#xC74C;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0AC; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0;&amp;#xC758; &amp;#xAE38;&amp;#xC774;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;Transfer-Encoding &amp;#xD5E4;&amp;#xB354;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; Content-Length &amp;#xD5E4;&amp;#xB354;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xB54C; &amp;#xD574;&amp;#xB2F9; &amp;#xD5E4;&amp;#xB354;&amp;#xC758; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;Transfer-Encoding &amp;#xD5E4;&amp;#xB354;&amp;#xC640; Content-Length &amp;#xD5E4;&amp;#xB354;&amp;#xAC00; &amp;#xBAA8;&amp;#xB450; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA74; Content-Length &amp;#xD5E4;&amp;#xB354; &amp;#xBB34;&amp;#xC2DC;&lt;/li&gt;
&lt;li&gt;Content-Length &amp;#xD5E4;&amp;#xB354;&amp;#xAC00; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; 400 Bad Request &amp;#xCC98;&amp;#xB9AC;&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;&amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xAC00;-&amp;#xC6F9;-&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC600;&amp;#xB2E4;&amp;#xBA74;&#34;&gt;&lt;a href=&#34;#&amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xAC00;-&amp;#xC6F9;-&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC600;&amp;#xB2E4;&amp;#xBA74;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xAC00; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC600;&amp;#xB2E4;&amp;#xBA74;&#34;&gt;&lt;/a&gt;&amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xAC00; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC600;&amp;#xB2E4;&amp;#xBA74;&lt;/h3&gt;&lt;p&gt;&amp;#xB77C;&amp;#xBCA8;&amp;#xAE30; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xB97C; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB85C; &amp;#xD655;&amp;#xC7A5; &amp;#xC2DC;&amp;#xCF1C;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB77C;&amp;#xBCA8;&amp;#xAE30; &amp;#xC785;&amp;#xB825;&amp;#xC740; &amp;#xC644;&amp;#xB8CC;&amp;#xB97C; &amp;#xB204;&amp;#xB97C; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xB2C8; Transfer-Encoding &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xC5B4;&amp;#xC6B8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB77C;&amp;#xBCA8; &amp;#xCEE4;&amp;#xD130;&amp;#xB294; &amp;#xC785;&amp;#xB825;&amp;#xBC1B;&amp;#xC740; &amp;#xAE38;&amp;#xC774;&amp;#xB9CC;&amp;#xD07C; &amp;#xC790;&amp;#xB974;&amp;#xB2C8; Content-Length&amp;#xAC00; &amp;#xC5B4;&amp;#xC6B8;&amp;#xB9AC;&amp;#xACA0;&amp;#xB124;&amp;#xC694;&lt;/p&gt;
&lt;p&gt;&amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xC5D0; &amp;#xBB38;&amp;#xC7A5;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xACE0; &amp;#xC790;&amp;#xB974;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD45C;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/06/syru/funny-smuggling-story-pt1/packet_diagram.png&#34; alt=&#34;packet diagram&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB77C;&amp;#xBCA8; &amp;#xC694;&amp;#xCCAD;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC751;&amp;#xB2F5;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD45C;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/06/syru/funny-smuggling-story-pt1/packet_simplify.png&#34; alt=&#34;simplified stream&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB41C; &amp;#xC6D0;&amp;#xC778;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC77C;&amp;#xAE4C;&amp;#xC694;? &amp;#xC6B0;&amp;#xC120; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xB77C;&amp;#xBCA8;&amp;#xCE74;&amp;#xD2B8;&amp;#xB9AC;&amp;#xC9C0;(TCP &amp;#xCEE4;&amp;#xB125;&amp;#xC158;)&amp;#xC5D0;&amp;#xC11C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0; &amp;#xB77C;&amp;#xBCA8;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC758; &amp;#xB05D;(Transfer-Encoding)&amp;#xC774; &amp;#xAE30;&amp;#xC900;&amp;#xC774;&amp;#xC600;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB77C;&amp;#xBCA8; &amp;#xCEE4;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE38;&amp;#xC774;&amp;#xB85C; &amp;#xC785;&amp;#xB825;&amp;#xD55C; &amp;#xAC12;(Content-Length)&amp;#xC774; &amp;#xAE30;&amp;#xC900;&amp;#xC774;&amp;#xC600;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB77C;&amp;#xBCA8; &amp;#xCEE4;&amp;#xD130;&amp;#xB294; &amp;#xC55E;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xB4DC;&amp;#xB9B0; &amp;#xADDC;&amp;#xCE59;&amp;#xC744; &amp;#xC5B4;&amp;#xAE34; &amp;#xC608;&amp;#xC2DC;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xC694;&amp;#xCCAD;&amp;#xC5D0; &amp;#xC0BD;&amp;#xC785;&amp;#xB418;&amp;#xC5B4; &amp;#xD574;&amp;#xB2F9; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xB2E4;&amp;#xB978; &amp;#xC694;&amp;#xCCAD;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xBC84;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &lt;strong&gt;HTTP Request Smuggling&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACF5;&amp;#xACA9;&amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xC720;&amp;#xD615;&amp;#xC774; &amp;#xD06C;&amp;#xAC8C; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Content-Length &amp;#xD5E4;&amp;#xB354; &amp;#xC911;&amp;#xBCF5; &amp;#xBB38;&amp;#xC81C; &amp;#xC774;&amp;#xD558; CL-CL&amp;#xC774;&amp;#xB77C; &amp;#xBD80;&amp;#xB974;&amp;#xB294; &amp;#xC720;&amp;#xD615;&amp;#xACFC; Transfer-Encoding, Content-Length &amp;#xD5E4;&amp;#xB354; &amp;#xD63C;&amp;#xB3D9; &amp;#xBB38;&amp;#xC81C; &amp;#xC774;&amp;#xD558; CL-TE&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB974;&amp;#xB294; &amp;#xC720;&amp;#xD615;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xADF8;&amp;#xB0E5;-&amp;#xD45C;&amp;#xC900;&amp;#xB9CC;-&amp;#xB530;&amp;#xB974;&amp;#xBA74;-&amp;#xB418;&amp;#xB294;-&amp;#xAC83;-&amp;#xC544;&amp;#xB2CC;&amp;#xAC00;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#&amp;#xADF8;&amp;#xB0E5;-&amp;#xD45C;&amp;#xC900;&amp;#xB9CC;-&amp;#xB530;&amp;#xB974;&amp;#xBA74;-&amp;#xB418;&amp;#xB294;-&amp;#xAC83;-&amp;#xC544;&amp;#xB2CC;&amp;#xAC00;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xADF8;&amp;#xB0E5; &amp;#xD45C;&amp;#xC900;&amp;#xB9CC; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xB418;&amp;#xB294; &amp;#xAC83; &amp;#xC544;&amp;#xB2CC;&amp;#xAC00;&amp;#xC694;?&#34;&gt;&lt;/a&gt;&amp;#xADF8;&amp;#xB0E5; &amp;#xD45C;&amp;#xC900;&amp;#xB9CC; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xB418;&amp;#xB294; &amp;#xAC83; &amp;#xC544;&amp;#xB2CC;&amp;#xAC00;&amp;#xC694;?&lt;/h3&gt;&lt;p&gt;&amp;#xB9DE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCD5C;&amp;#xADFC; &amp;#xACF5;&amp;#xACA9; &amp;#xC720;&amp;#xD615;&amp;#xC740; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xD30C;&amp;#xC2F1;&amp;#xD560; &amp;#xB54C; &amp;#xD2B9;&amp;#xC815; &amp;#xD5E4;&amp;#xB354;&amp;#xB97C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD2B9;&amp;#xC218;&amp;#xBB38;&amp;#xC790;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xB2E4;&amp;#xB978; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; Buffer Overflow &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xADDC;&amp;#xCE59;&amp;#xB9CC; &amp;#xB530;&amp;#xB77C;&amp;#xC11C;&amp;#xB294; &amp;#xB300;&amp;#xC751;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xAC83;&amp;#xC774; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD45C;&amp;#xC900;&amp;#xC744; &amp;#xB530;&amp;#xB974;&amp;#xB294; &amp;#xAC83; &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xAE38;&amp;#xC774; &amp;#xAC80;&amp;#xC99D;&amp;#xC774;&amp;#xB098; &amp;#xD2B9;&amp;#xC218;&amp;#xBB38;&amp;#xC790; &amp;#xCC98;&amp;#xB9AC;&amp;#xB4F1;&amp;#xC744; &amp;#xC2E0;&amp;#xACBD;&amp;#xC368;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h2&gt;&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD3EC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xC0AC;&amp;#xB840;&amp;#xB97C; &amp;#xACF5;&amp;#xACA9; &amp;#xC720;&amp;#xD615;&amp;#xBCC4;&amp;#xB85C; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2022/02/06/syru/funny-smuggling-story-pt1/thumnail.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2022/02/06/syru/funny-smuggling-story-pt1/">

  <title>[Research] 재밌는 HTTP Request Smuggling 이야기 (1) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2022-02-06 18:00" pubdate>
      2022년 2월 6일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.1k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      22
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] 재밌는 HTTP Request Smuggling 이야기 (1)</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694; : ) &#xC2DC;&#xB8E8;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC624;&#xB298;&#xC740; &#xAC04;&#xB2E8;&#xD55C; &#xC6D0;&#xB9AC;&#xC9C0;&#xB9CC; &#xBD88;&#xD2B9;&#xC815; &#xB2E4;&#xC218;&#xC5D0;&#xAC8C; &#xD53C;&#xD574;&#xB97C; &#xC904; &#xC218; &#xC788;&#xB294; &#xACF5;&#xACA9;&#xAE30;&#xBC95;&#xC744; &#xAC00;&#xC838;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xACB0;&#xACFC;&#xBB3C;&#xC774;-&#xC81C;-&#xC694;&#xCCAD;&#xACFC;-&#xB2EC;&#xB77C;&#xC694;"><a href="#&#xACB0;&#xACFC;&#xBB3C;&#xC774;-&#xC81C;-&#xC694;&#xCCAD;&#xACFC;-&#xB2EC;&#xB77C;&#xC694;" class="headerlink" title="&#xACB0;&#xACFC;&#xBB3C;&#xC774; &#xC81C; &#xC694;&#xCCAD;&#xACFC; &#xB2EC;&#xB77C;&#xC694;"></a>&#xACB0;&#xACFC;&#xBB3C;&#xC774; &#xC81C; &#xC694;&#xCCAD;&#xACFC; &#xB2EC;&#xB77C;&#xC694;</h3><p>&#xC124;&#xBA85;&#xC744; &#xC704;&#xD574; &#xB77C;&#xBCA8;&#xAE30;&#xB97C; &#xAC00;&#xC838;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xB77C;&#xBCA8;&#xAE30;&#xB294; &#xBB38;&#xC7A5;&#xACFC; &#xAE38;&#xC774;&#xB97C; &#xC785;&#xB825;&#xD558;&#xBA74; &#xAE38;&#xC774;&#xB9CC;&#xD07C; &#xC798;&#xB77C; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xC7A5;&#xB09C;&#xAFB8;&#xB7EC;&#xAE30; &#xC2DC;&#xB8E8;&#xAC00; &#x201C;&#xC2DC;&#xB8E8;&#xBC18;&#x201D;&#xC774;&#xB77C;&#xB294; &#xBB38;&#xC7A5;&#xC744; &#xC785;&#xB825;&#xD574;&#xB193;&#xACE0; &#xB450; &#xAE00;&#xC790;&#xB9CC; &#xC785;&#xB825;&#xD588;&#xB2E4;&#xACE0; &#xD558;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xB420;&#xAE4C;&#xC694;?</p>
<p><img src="/2022/02/06/syru/funny-smuggling-story-pt1/label_printer_for_prologue.png" srcset="/img/loading.gif" alt="label printer image for prologue"></p>
<p>&#xADF8;&#xB2E4;&#xC74C; &#xC785;&#xB825;&#xC774;&#xC5C8;&#xB358; &#x201C;&#xBBFC;&#xCD08;&#xB2E8;&#x201D; &#xB77C;&#xBCA8;&#xC774; &#x201C;&#xBC18;&#xBBFC;&#xCD08;&#x201D;&#xAC00; &#xB418;&#xC5B4;&#xBC84;&#xB838;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026;!</p>
<p>&#xC774;&#xB294; &#xC2DC;&#xB8E8;&#xC758; &#xC694;&#xCCAD;&#xC744; &#xCC98;&#xB9AC;&#xD55C; &#xD6C4; &#xB0A8;&#xC740; &#x2018;&#xBC18;&#x2019;&#xC774;&#xB77C;&#xB294; &#xAE00;&#xC790;&#xAC00; &#xB2E4;&#xC74C; &#xC694;&#xCCAD;&#xC5D0; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xBC1C;&#xC0DD;&#xD55C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7F0; &#xC77C;&#xC774; &#xC6F9; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0;&#xC11C;&#xB3C4; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBC88; &#xAE00;&#xC5D0;&#xC11C;&#xB294; &#xB098;&#xC758; &#xC694;&#xCCAD;&#xC774; &#xD0C0;&#xC778;&#xC5D0;&#xAC8C; &#xC601;&#xD5A5;&#xC744; &#xC904; &#xC218; &#xC788;&#xB294; HTTP Request Smuggling&#xC744; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="HTTP-Request-Smuggling"><a href="#HTTP-Request-Smuggling" class="headerlink" title="HTTP Request Smuggling"></a>HTTP Request Smuggling</h2><blockquote>
<p>HTTP &#xC694;&#xCCAD;&#xC5D0; &#xB300;&#xD55C; &#xC77C;&#xAD00;&#xC131; &#xC5C6;&#xB294; &#xD574;&#xC11D;</p>
</blockquote>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://cwe.mitre.org/data/definitions/444.html">CWE-444: Inconsistent Interpretation of HTTP Requests (&#x2018;HTTP Request Smuggling&#x2019;)</a></p>
<h3 id="&#xB3D9;&#xC77C;&#xD55C;-TCP-Connection&#xC5D0;&#xC11C;-&#xC5EC;&#xB7EC;&#xAC1C;&#xC758;-HTTP-Message&#xAC00;-&#xCC98;&#xB9AC;&#xB41C;-&#xC0AC;&#xC5F0;"><a href="#&#xB3D9;&#xC77C;&#xD55C;-TCP-Connection&#xC5D0;&#xC11C;-&#xC5EC;&#xB7EC;&#xAC1C;&#xC758;-HTTP-Message&#xAC00;-&#xCC98;&#xB9AC;&#xB41C;-&#xC0AC;&#xC5F0;" class="headerlink" title="&#xB3D9;&#xC77C;&#xD55C; TCP Connection&#xC5D0;&#xC11C; &#xC5EC;&#xB7EC;&#xAC1C;&#xC758; HTTP Message&#xAC00; &#xCC98;&#xB9AC;&#xB41C; &#xC0AC;&#xC5F0;"></a>&#xB3D9;&#xC77C;&#xD55C; TCP Connection&#xC5D0;&#xC11C; &#xC5EC;&#xB7EC;&#xAC1C;&#xC758; HTTP Message&#xAC00; &#xCC98;&#xB9AC;&#xB41C; &#xC0AC;&#xC5F0;</h3><p>HTTP &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC740; TCP &#xD1B5;&#xC2E0; &#xC704;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>(UDP&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; HTTP 3&#xB294; &#xC774; &#xAE00;&#xC5D0;&#xC120; &#xC5B8;&#xAE09;&#xD558;&#xC9C0; &#xC54A;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.)</p>
<p>TCP &#xD1B5;&#xC2E0;&#xC740; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC788;&#xB294; &#xD1B5;&#xC2E0;&#xC744; &#xC704;&#xD574; &#xC5EC;&#xB7EC; &#xC815;&#xBCF4;&#xB97C; &#xACF5;&#xC720;&#xD558;&#xB294; 3way handshake&#xACFC;&#xC815;&#xC744; &#xAC70;&#xCE69;&#xB2C8;&#xB2E4;.</p>
<p>HTTP &#xD1B5;&#xC2E0;&#xC744; &#xD560; &#xB54C;&#xB9C8;&#xB2E4; TCP &#xD1B5;&#xC2E0;&#xC744; &#xC0C8;&#xB85C; &#xD574;&#xC57C; &#xD55C;&#xB2E4;&#xBA74; &#xB2F9;&#xC5F0;&#xD788; &#xADF8;&#xB9CC;&#xD07C; handshake&#xB3C4; &#xD574;&#xC57C; &#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xC2DC;&#xAC04;&#xC744; &#xCD5C;&#xB300;&#xD55C; &#xC904;&#xC774;&#xAE30; &#xC704;&#xD574; HTTP&#xB294; &#xAE30;&#xC874;&#xC5D0; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; TCP &#xD1B5;&#xC2E0;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="HTTP&#xC5D0;&#xC11C;-Body-&#xC815;&#xBCF4;&#xB97C;-&#xC5BB;&#xB294;-&#xBC29;&#xBC95;"><a href="#HTTP&#xC5D0;&#xC11C;-Body-&#xC815;&#xBCF4;&#xB97C;-&#xC5BB;&#xB294;-&#xBC29;&#xBC95;" class="headerlink" title="HTTP&#xC5D0;&#xC11C; Body &#xC815;&#xBCF4;&#xB97C; &#xC5BB;&#xB294; &#xBC29;&#xBC95;"></a>HTTP&#xC5D0;&#xC11C; Body &#xC815;&#xBCF4;&#xB97C; &#xC5BB;&#xB294; &#xBC29;&#xBC95;</h3><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://datatracker.ietf.org/doc/html/rfc7230#section-3.3.3">RFC &#xBB38;&#xC11C;</a>&#xC5D0; &#xB530;&#xB974;&#xBA74; Body&#xC758; &#xAE38;&#xC774;&#xB294; &#xB2E4;&#xC74C; &#xADDC;&#xCE59;&#xC744; &#xB530;&#xB985;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Transfer-Encoding &#xD5E4;&#xB354;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xACE0; chunked transfer coding&#xC73C;&#xB85C; &#xC804;&#xB2EC;&#xB420; &#xB54C; transfer coding&#xC774; data &#xC804;&#xC1A1;&#xC774; &#xB05D;&#xB0AC;&#xC74C;&#xC744; &#xAC00;&#xB9AC;&#xD0AC; &#xB54C;&#xAE4C;&#xC9C0;&#xC758; &#xAE38;&#xC774;&#xB85C; &#xACB0;&#xC815;</li>
<li>Transfer-Encoding &#xD5E4;&#xB354;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xC720;&#xD6A8;&#xD55C; Content-Length &#xD5E4;&#xB354;&#xAC00; &#xC874;&#xC7AC;&#xD560; &#xB54C; &#xD574;&#xB2F9; &#xD5E4;&#xB354;&#xC758; &#xAC12;&#xC73C;&#xB85C; &#xACB0;&#xC815;</li>
<li>Transfer-Encoding &#xD5E4;&#xB354;&#xC640; Content-Length &#xD5E4;&#xB354;&#xAC00; &#xBAA8;&#xB450; &#xC874;&#xC7AC;&#xD558;&#xBA74; Content-Length &#xD5E4;&#xB354; &#xBB34;&#xC2DC;</li>
<li>Content-Length &#xD5E4;&#xB354;&#xAC00; &#xC5EC;&#xB7EC; &#xAC1C; &#xC788;&#xC73C;&#xBA74; 400 Bad Request &#xCC98;&#xB9AC;</li>
</ul>
<h3 id="&#xB77C;&#xBCA8;&#xAE30;&#xAC00;-&#xC6F9;-&#xC11C;&#xBE44;&#xC2A4;&#xC600;&#xB2E4;&#xBA74;"><a href="#&#xB77C;&#xBCA8;&#xAE30;&#xAC00;-&#xC6F9;-&#xC11C;&#xBE44;&#xC2A4;&#xC600;&#xB2E4;&#xBA74;" class="headerlink" title="&#xB77C;&#xBCA8;&#xAE30;&#xAC00; &#xC6F9; &#xC11C;&#xBE44;&#xC2A4;&#xC600;&#xB2E4;&#xBA74;"></a>&#xB77C;&#xBCA8;&#xAE30;&#xAC00; &#xC6F9; &#xC11C;&#xBE44;&#xC2A4;&#xC600;&#xB2E4;&#xBA74;</h3><p>&#xB77C;&#xBCA8;&#xAE30; &#xC774;&#xC57C;&#xAE30;&#xB97C; &#xC6F9; &#xC11C;&#xBE44;&#xC2A4;&#xB85C; &#xD655;&#xC7A5; &#xC2DC;&#xCF1C;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB77C;&#xBCA8;&#xAE30; &#xC785;&#xB825;&#xC740; &#xC644;&#xB8CC;&#xB97C; &#xB204;&#xB97C; &#xB54C;&#xAE4C;&#xC9C0; &#xC785;&#xB825;&#xD558;&#xB2C8; Transfer-Encoding &#xBC29;&#xC2DD;&#xC774; &#xC5B4;&#xC6B8;&#xB9AC;&#xACE0; &#xB77C;&#xBCA8; &#xCEE4;&#xD130;&#xB294; &#xC785;&#xB825;&#xBC1B;&#xC740; &#xAE38;&#xC774;&#xB9CC;&#xD07C; &#xC790;&#xB974;&#xB2C8; Content-Length&#xAC00; &#xC5B4;&#xC6B8;&#xB9AC;&#xACA0;&#xB124;&#xC694;</p>
<p>&#xB77C;&#xBCA8;&#xAE30;&#xC5D0; &#xBB38;&#xC7A5;&#xC744; &#xC785;&#xB825;&#xD558;&#xACE0; &#xC790;&#xB974;&#xB294; &#xACFC;&#xC815;&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xD45C;&#xD604;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2022/02/06/syru/funny-smuggling-story-pt1/packet_diagram.png" srcset="/img/loading.gif" alt="packet diagram"></p>
<p>&#xB77C;&#xBCA8; &#xC694;&#xCCAD;&#xC5D0; &#xB300;&#xD55C; &#xC751;&#xB2F5;&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xD45C;&#xD604;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2022/02/06/syru/funny-smuggling-story-pt1/packet_simplify.png" srcset="/img/loading.gif" alt="simplified stream"></p>
<p>&#xC774;&#xB807;&#xAC8C; &#xB41C; &#xC6D0;&#xC778;&#xC774; &#xBB34;&#xC5C7;&#xC77C;&#xAE4C;&#xC694;? &#xC6B0;&#xC120; &#xB3D9;&#xC77C;&#xD55C; &#xB77C;&#xBCA8;&#xCE74;&#xD2B8;&#xB9AC;&#xC9C0;(TCP &#xCEE4;&#xB125;&#xC158;)&#xC5D0;&#xC11C; &#xCC98;&#xB9AC;&#xB418;&#xC5C8;&#xACE0; &#xB77C;&#xBCA8;&#xAE30;&#xC5D0;&#xC11C;&#xB294; &#xBB38;&#xC790;&#xC5F4;&#xC758; &#xB05D;(Transfer-Encoding)&#xC774; &#xAE30;&#xC900;&#xC774;&#xC600;&#xC9C0;&#xB9CC; &#xB77C;&#xBCA8; &#xCEE4;&#xD130;&#xC5D0;&#xC11C;&#xB294; &#xAE38;&#xC774;&#xB85C; &#xC785;&#xB825;&#xD55C; &#xAC12;(Content-Length)&#xC774; &#xAE30;&#xC900;&#xC774;&#xC600;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. </p>
<p>&#xB77C;&#xBCA8; &#xCEE4;&#xD130;&#xB294; &#xC55E;&#xC11C; &#xC124;&#xBA85;&#xB4DC;&#xB9B0; &#xADDC;&#xCE59;&#xC744; &#xC5B4;&#xAE34; &#xC608;&#xC2DC;&#xB77C;&#xACE0; &#xBCFC; &#xC218;&#xB3C4; &#xC788;&#xACA0;&#xB124;&#xC694;</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xB2E4;&#xB978; &#xC694;&#xCCAD;&#xC5D0; &#xC0BD;&#xC785;&#xB418;&#xC5B4; &#xD574;&#xB2F9; &#xC694;&#xCCAD;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xAC8C; &#xD558;&#xAC70;&#xB098; &#xC644;&#xC804;&#xD788; &#xB2E4;&#xB978; &#xC694;&#xCCAD;&#xC73C;&#xB85C; &#xBC14;&#xAFD4;&#xBC84;&#xB9B4; &#xC218; &#xC788;&#xB294; &#xACF5;&#xACA9;&#xC774; &#xBC14;&#xB85C; <strong>HTTP Request Smuggling</strong>&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xACF5;&#xACA9;&#xAE30;&#xBC95;&#xC740; &#xC720;&#xD615;&#xC774; &#xD06C;&#xAC8C; &#xB450; &#xAC00;&#xC9C0;&#xB85C; &#xB098;&#xB269;&#xB2C8;&#xB2E4;.</p>
<p>Content-Length &#xD5E4;&#xB354; &#xC911;&#xBCF5; &#xBB38;&#xC81C; &#xC774;&#xD558; CL-CL&#xC774;&#xB77C; &#xBD80;&#xB974;&#xB294; &#xC720;&#xD615;&#xACFC; Transfer-Encoding, Content-Length &#xD5E4;&#xB354; &#xD63C;&#xB3D9; &#xBB38;&#xC81C; &#xC774;&#xD558; CL-TE&#xB77C;&#xACE0; &#xBD80;&#xB974;&#xB294; &#xC720;&#xD615;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xADF8;&#xB0E5;-&#xD45C;&#xC900;&#xB9CC;-&#xB530;&#xB974;&#xBA74;-&#xB418;&#xB294;-&#xAC83;-&#xC544;&#xB2CC;&#xAC00;&#xC694;"><a href="#&#xADF8;&#xB0E5;-&#xD45C;&#xC900;&#xB9CC;-&#xB530;&#xB974;&#xBA74;-&#xB418;&#xB294;-&#xAC83;-&#xC544;&#xB2CC;&#xAC00;&#xC694;" class="headerlink" title="&#xADF8;&#xB0E5; &#xD45C;&#xC900;&#xB9CC; &#xB530;&#xB974;&#xBA74; &#xB418;&#xB294; &#xAC83; &#xC544;&#xB2CC;&#xAC00;&#xC694;?"></a>&#xADF8;&#xB0E5; &#xD45C;&#xC900;&#xB9CC; &#xB530;&#xB974;&#xBA74; &#xB418;&#xB294; &#xAC83; &#xC544;&#xB2CC;&#xAC00;&#xC694;?</h3><p>&#xB9DE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xC8FC;&#xCCB4;&#xB4E4;&#xC774; &#xBAA8;&#xB450; &#xB3D9;&#xC77C;&#xD55C; &#xAE30;&#xC900;&#xC73C;&#xB85C; &#xCC98;&#xB9AC;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xCD5C;&#xADFC; &#xACF5;&#xACA9; &#xC720;&#xD615;&#xC740; &#xC694;&#xCCAD;&#xC744; &#xD30C;&#xC2F1;&#xD560; &#xB54C; &#xD2B9;&#xC815; &#xD5E4;&#xB354;&#xB97C; &#xC778;&#xC2DD;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB3C4;&#xB85D; &#xD2B9;&#xC218;&#xBB38;&#xC790;&#xB97C; &#xC0BD;&#xC785;&#xD558;&#xAC70;&#xB098; &#xB2E4;&#xB978; &#xB0B4;&#xC6A9;&#xC73C;&#xB85C; &#xC778;&#xC2DD;&#xD558;&#xB3C4;&#xB85D; Buffer Overflow &#xAE30;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xB4F1; &#xADDC;&#xCE59;&#xB9CC; &#xB530;&#xB77C;&#xC11C;&#xB294; &#xB300;&#xC751;&#xD558;&#xAE30; &#xC5B4;&#xB824;&#xC6B4; &#xAC83;&#xC774; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD45C;&#xC900;&#xC744; &#xB530;&#xB974;&#xB294; &#xAC83; &#xC678;&#xC5D0;&#xB3C4; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xAE38;&#xC774; &#xAC80;&#xC99D;&#xC774;&#xB098; &#xD2B9;&#xC218;&#xBB38;&#xC790; &#xCC98;&#xB9AC;&#xB4F1;&#xC744; &#xC2E0;&#xACBD;&#xC368;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h2><p>&#xB2E4;&#xC74C; &#xD3EC;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; &#xC2E4;&#xC81C;&#xB85C; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD55C; &#xC0AC;&#xB840;&#xB97C; &#xACF5;&#xACA9; &#xC720;&#xD615;&#xBCC4;&#xB85C; &#xB2E4;&#xB904;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/http/">http</a>
                  
                  <a class="hover-with-bg" href="/tags/http-smuggling/">http smuggling</a>
                  
                  <a class="hover-with-bg" href="/tags/research/">research</a>
                  
                  <a class="hover-with-bg" href="/tags/syru/">syru</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_syru.jpg" srcset="/img/loading.gif" alt="syru">
                  </div>

                  <div class="link-text">
                    <div class="link-title">syru</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/syru">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2022/02/08/fabu1ous/2022-02-08/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] HigherLogic Community RCE Vulnerability</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2022/02/05/idioth/2022-02-05/">
                    <span class="hidden-mobile">[하루한줄] CVE-2021-44790: Apache에서 발견된 integer underflow 코드 실행 취약점</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2022/02/06/syru/funny-smuggling-story-pt1/';
        this.page.identifier = '/2022/02/06/syru/funny-smuggling-story-pt1/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] 재밌는 HTTP Request Smuggling 이야기 (1)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
