

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;a href=&#34;#&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;/a&gt;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/1.gif&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. Fabu1ous&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB9D0; &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; Part 2&amp;#xB97C; &amp;#xB4E4;&amp;#xACE0; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xBC88; Part 1&amp;#xC5D0;&amp;#xC11C; &amp;#xD37C;&amp;#xC9D5; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC758; &amp;#xAC00;&amp;#xC7A5; &amp;#xBCF4;&amp;#xD3B8;&amp;#xC801;&amp;#xC778; &amp;#xBAA8;&amp;#xB378;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC124;&amp;#xBA85;&amp;#xC744; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD37C;&amp;#xC9D5; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC740; Preprocess&amp;#xC640; Iteration&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC73C;&amp;#xBA70; Iteration&amp;#xC740; Schedule, InputGen, InputEval, ConfUpdate, Continue &amp;#xCD1D; 5&amp;#xAC1C; &amp;#xB2E8;&amp;#xACC4;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; Preprocess&amp;#xC640; Schedule &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Part 1&amp;#xC744; &amp;#xC548; &amp;#xBCF4;&amp;#xC168;&amp;#xAC70;&amp;#xB098; &amp;#xB108;&amp;#xBB34; &amp;#xC624;&amp;#xB798;&amp;#xC804;&amp;#xC5D0; &amp;#xC77D;&amp;#xC5B4;&amp;#xC11C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xAC00;&amp;#xBB3C;&amp;#xAC00;&amp;#xBB3C;&amp;#xD558;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; Part 1&amp;#xC744; &amp;#xC4F1; &amp;#xD6D1;&amp;#xC5B4;&amp;#xBCF4;&amp;#xACE0; &amp;#xC624;&amp;#xC2DC;&amp;#xAE38; &amp;#xBC14;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;. Part 1&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC6A9;&amp;#xC5B4;&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC704; GIF &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xAC19;&amp;#xC740; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;3-Preprocess&#34;&gt;&lt;a href=&#34;#3-Preprocess&#34; class=&#34;headerlink&#34; title=&#34;3. Preprocess&#34;&gt;&lt;/a&gt;3. Preprocess&lt;/h1&gt;&lt;pre&gt;&lt;code class=&#34;hljs livescript&#34;&gt;Preprocess&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;(C)&lt;/span&gt; -&amp;gt;&lt;/span&gt; C&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xCCAB; iteration &amp;#xC218;&amp;#xD589; &amp;#xC804;&amp;#xC5D0; &amp;#xCD08;&amp;#xAE30; fuzz configuration &amp;#xC9D1;&amp;#xD569;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; Preprocess, &amp;#xC804;&amp;#xCC98;&amp;#xB9AC; &amp;#xB2E8;&amp;#xACC4;&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB974;&amp;#xBA70; &amp;#xC8FC;&amp;#xB85C; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;PUT&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; instrumentation &amp;#xC801;&amp;#xC6A9;&lt;/li&gt;
&lt;li&gt;&amp;#xC4F8;&amp;#xBAA8;&amp;#xC5C6;&amp;#xB294; configuration &amp;#xC81C;&amp;#xAC70;&lt;/li&gt;
&lt;li&gt;seed trimming&lt;/li&gt;
&lt;li&gt;driver app &amp;#xC0DD;&amp;#xC131;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;Preprocess&amp;#xB294; InputGen&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC900;&amp;#xBE44; &amp;#xB2E8;&amp;#xACC4;&amp;#xC758; &amp;#xC758;&amp;#xBBF8;&amp;#xB3C4; &amp;#xC9C0;&amp;#xB2C8;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;3-1-Instrumentation&#34;&gt;&lt;a href=&#34;#3-1-Instrumentation&#34; class=&#34;headerlink&#34; title=&#34;3.1 Instrumentation&#34;&gt;&lt;/a&gt;3.1 Instrumentation&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;PUT &amp;#xCF54;&amp;#xB4DC; &amp;#xC0AC;&amp;#xC774;&amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; instrumentation &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD574; &amp;#xAC01; input&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; PUT&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xC5B4;&amp;#xB514;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB3C4;&amp;#xB2EC;(code coverage)&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; Instrumenation&amp;#xC774;&amp;#xB77C; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;black-box, gray-box, white-box &amp;#xB4F1; &amp;#xD37C;&amp;#xC9D5; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; &amp;#xC0C9;&amp;#xC740; PUT&amp;#xC758; &amp;#xB0B4;&amp;#xBD80; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xB9CE;&amp;#xC774; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xB294;&amp;#xAC00;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xB294;&amp;#xB370;, gray-box&amp;#xC640; white-box&amp;#xB294; PUT&amp;#xC5D0; instrumentaion&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD574; execution feedback&amp;#xC744; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0; &amp;#xADF8;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xB354; &amp;#xC815;&amp;#xAD50;&amp;#xD55C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;PUT &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; processor trace, system call usage &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xC911; instrumentation&amp;#xC774; &amp;#xAC00;&amp;#xC7A5; &amp;#xC4F8;&amp;#xBAA8; &amp;#xC788;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Program instrumentation&amp;#xC740; static(&amp;#xC815;&amp;#xC801;)&amp;#xACFC; dynamic(&amp;#xB3D9;&amp;#xC801;) &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;. Static &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; PUT &amp;#xC2E4;&amp;#xD589; &amp;#xC804; Preprocess &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0;, dynamic &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; PUT&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; InputEval &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC801;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;Static Instrumentaion&lt;/p&gt;
&lt;p&gt;&amp;#xC8FC;&amp;#xB85C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xB3C4;&amp;#xC911; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xB098; intermediate code&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD568;&lt;/p&gt;
&lt;p&gt;&amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xC804;&amp;#xC5D0; &amp;#xC218;&amp;#xD589;&amp;#xB418;&amp;#xB2C8; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xC624;&amp;#xBC84;&amp;#xD574;&amp;#xB4DC;&amp;#xAC00; &amp;#xD06C;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C;&lt;/p&gt;
&lt;p&gt;PUT&amp;#xC774; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xAC01;&amp;#xAC01; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC5D0; &amp;#xAC19;&amp;#xC740; instrumentaion &amp;#xC801;&amp;#xC6A9; &amp;#xD544;&amp;#xC694;(&amp;#xADC0;&amp;#xCC2E;&amp;#xB2E4;!)&lt;/p&gt;
&lt;p&gt;&amp;#xC18C;&amp;#xC2A4; &amp;#xB808;&amp;#xBCA8; &amp;#xB9D0;&amp;#xACE0; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB808;&amp;#xBCA8;&amp;#xC5D0;&amp;#xC11C; static instrumentation&amp;#xB3C4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD568;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Dynamic instrumentaion&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xBC84;&amp;#xD574;&amp;#xB4DC;&amp;#xAC00; &amp;#xD06C;&amp;#xC9C0;&amp;#xB9CC; instrumentation&amp;#xC744; PUT&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; DLL&amp;#xC5D0; &amp;#xADF8;&amp;#xB54C;&amp;#xADF8;&amp;#xB54C; &amp;#xC801;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC7A5;&amp;#xC810;&lt;/p&gt;
&lt;p&gt;DynInst, DynamoRIO, Valgrid, QEMU &amp;#xB4F1; &amp;#xB3D9;&amp;#xC801; instrumentation tool&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAF2D; static&amp;#xACFC; dynamic &amp;#xBC29;&amp;#xC2DD; &amp;#xC911; &amp;#xD55C; &amp;#xAC00;&amp;#xC9C0; instrumentaion&amp;#xB9CC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; AFL&amp;#xC740; &amp;#xC804;&amp;#xC6A9; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xB85C; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; static instrumentation&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; QEMU&amp;#xB85C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB808;&amp;#xBCA8; dynamic instrumentation&amp;#xB3C4; &amp;#xC801;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC9C1;&amp;#xC811; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; external library&amp;#xC5D0;&amp;#xB3C4; instrumentation&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD574; &amp;#xC880; &amp;#xB354; &amp;#xC644;&amp;#xBCBD;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xCE21;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;3-1-1-Execution-Feedback&#34;&gt;&lt;a href=&#34;#3-1-1-Execution-Feedback&#34; class=&#34;headerlink&#34; title=&#34;3.1.1 Execution Feedback&#34;&gt;&lt;/a&gt;3.1.1 Execution Feedback&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;gray-box &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xC8FC;&amp;#xB85C; execution feedback&amp;#xC744; input&amp;#xC73C;&amp;#xB85C; &amp;#xBC1B;&amp;#xC544; test case&amp;#xB97C; &amp;#xBC1C;&amp;#xC804;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xC608;&amp;#xB85C; AFL&amp;#xACFC; AFL&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xD30C;&amp;#xC0DD;&amp;#xB41C; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC740; PUT&amp;#xC758; branch instruction&amp;#xC5D0; intstrumentation&amp;#xC744; &amp;#xAC78;&amp;#xC5B4; branch coverage &amp;#xACC4;&amp;#xC0B0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Branch coverage&amp;#xB294; bit vector&amp;#xC758; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; path collision&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xB178;&amp;#xB825;&amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;CollAFL : path-sensitive hash function&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&lt;/li&gt;
&lt;li&gt;LibFuzzer, Syzkaller : node coverage&amp;#xB97C; execution feedback&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&lt;/li&gt;
&lt;li&gt;Honggfuzz : execution feedback&amp;#xC744; &amp;#xC720;&amp;#xC800;&amp;#xAC00; &amp;#xACE0;&amp;#xB97C; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;3-1-2-In-Memory-Fuzzing&#34;&gt;&lt;a href=&#34;#3-1-2-In-Memory-Fuzzing&#34; class=&#34;headerlink&#34; title=&#34;3.1.2 In-Memory Fuzzing&#34;&gt;&lt;/a&gt;3.1.2 In-Memory Fuzzing&lt;/h3&gt;&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xD06C;&amp;#xBA74; &amp;#xC624;&amp;#xBC84;&amp;#xD574;&amp;#xB4DC;&amp;#xB3C4; &amp;#xD06C;&amp;#xACA0;&amp;#xC8E0;? &amp;#xB9E4;&amp;#xBC88; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; re-spawning&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; PUT&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xB9CC; &amp;#xD37C;&amp;#xC9D5; &amp;#xD574; &amp;#xC624;&amp;#xBC84;&amp;#xD574;&amp;#xB4DC; &amp;#xCD5C;&amp;#xC18C;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; GUI &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0; initializing&amp;#xC774; &amp;#xC815;&amp;#xB9D0; &amp;#xC624;&amp;#xB798; &amp;#xAC78;&amp;#xB9AC;&amp;#xB294;&amp;#xB370;, &amp;#xADF8;&amp;#xB798;&amp;#xC11C; initialization &amp;#xC791;&amp;#xC5C5;&amp;#xC774; &amp;#xB05D;&amp;#xB09C; &amp;#xC2DC;&amp;#xC810;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC2A4;&amp;#xB0C5;&amp;#xC0F7;&amp;#xC744; &amp;#xCC0D;&amp;#xC5B4;&amp;#xB193;&amp;#xACE0; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xAE30;&amp;#xC220;&amp;#xC744; in-memory fuzzing&amp;#xC774;&amp;#xB77C; &amp;#xBD80;&amp;#xB974;&amp;#xACE0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84; &amp;#xAC04;&amp;#xC758; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC774; &amp;#xB9CE;&amp;#xC740; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5; &amp;#xD560; &amp;#xB54C; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;GRR&amp;#xC740; input byte&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xC2A4;&amp;#xB0C5;&amp;#xC0F7;&amp;#xC744; &amp;#xCC0D;&amp;#xC5B4; &amp;#xB9E4; iteration&amp;#xB9C8;&amp;#xB2E4; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xCD08;&amp;#xAE30; &amp;#xC2E4;&amp;#xD589; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xAC74;&amp;#xB108;&amp;#xB701;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;AFL&amp;#xC740; fork server&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xC2A4;&amp;#xD0C0;&amp;#xD2B8;&amp;#xC5C5; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. In-memory fuzzing&amp;#xACFC; &amp;#xBE44;&amp;#xC2B7; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC2A4;&amp;#xB0C5;&amp;#xC0F7;&amp;#xC744; &amp;#xCC0D;&amp;#xB294; &amp;#xB300;&amp;#xC2E0; iteration &amp;#xB9C8;&amp;#xB2E4; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; fork &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;PUT&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xC6D0;&amp;#xC0C1;&amp;#xBCF5;&amp;#xAD6C; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; in-memory fuzzing&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. In-memory API fuzzing&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xB370; AFL&amp;#xC758; persistence mode&amp;#xAC00; &amp;#xC774;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. PUT&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xC6D0;&amp;#xC0C1; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xD2B9;&amp;#xC815; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB8E8;&amp;#xD504;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBC18;&amp;#xBCF5; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Winnie &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9E7;&amp;#xAC8C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; &amp;#xC774;&amp;#xB7F0; persistence mode&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; global state&amp;#xB97C; &amp;#xC11C;&amp;#xC11C;&amp;#xD788; &amp;#xC624;&amp;#xC5FC;&amp;#xC2DC;&amp;#xCF1C; false positive &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xB098;&amp;#xC62C; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; in-memory API fuzzing&amp;#xC744; &amp;#xD560; &amp;#xB550; entry-point&amp;#xAC00; &amp;#xB420; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xB4DC;&amp;#xB294; &amp;#xB178;&amp;#xB825;&amp;#xC774; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;3-1-3-Thread-Scheduling&#34;&gt;&lt;a href=&#34;#3-1-3-Thread-Scheduling&#34; class=&#34;headerlink&#34; title=&#34;3.1.3 Thread Scheduling&#34;&gt;&lt;/a&gt;3.1.3 Thread Scheduling&lt;/h3&gt;&lt;p&gt;Race condition &amp;#xBC84;&amp;#xADF8;&amp;#xB4E4;&amp;#xC740; non-deterministic behavior(&amp;#xBE44;&amp;#xACB0;&amp;#xC815;&amp;#xB860;&amp;#xC801; &amp;#xD589;&amp;#xB3D9;: &amp;#xAC19;&amp;#xC740; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xBC1B;&amp;#xACE0;&amp;#xB3C4; &amp;#xB2E4;&amp;#xB978; &amp;#xD589;&amp;#xB3D9;&amp;#xC744; &amp;#xBCF4;&amp;#xC784;)&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC544; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xD558;&amp;#xAE30; &amp;#xAE4C;&amp;#xB2E4;&amp;#xB86D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; instrumentation&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC4F0;&amp;#xB798;&amp;#xB4DC; &amp;#xCC98;&amp;#xB9AC; &amp;#xC21C;&amp;#xC11C;&amp;#xB97C; &amp;#xC815;&amp;#xD558;&amp;#xBA74;(Thread scheduling) &amp;#xD2B9;&amp;#xC815; &amp;#xBE44;&amp;#xACB0;&amp;#xC815;&amp;#xB860;&amp;#xC801; &amp;#xD589;&amp;#xB3D9;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;3-2-Seed-selection&#34;&gt;&lt;a href=&#34;#3-2-Seed-selection&#34; class=&#34;headerlink&#34; title=&#34;3.2 Seed selection&#34;&gt;&lt;/a&gt;3.2 Seed selection&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xB294; fuzz configuration &amp;#xC9D1;&amp;#xD569;&amp;#xC744; &amp;#xBC1B;&amp;#xC544; fuzzing algorithm&amp;#xC758; &amp;#xD589;&amp;#xB3D9;&amp;#xC744; &amp;#xC81C;&amp;#xC5B4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB38;&amp;#xC81C;&amp;#xB294; fuzz configuration&amp;#xC758; &amp;#xBA87;&amp;#xBA87; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB4E4; value domain(&amp;#xC815;&amp;#xC758;&amp;#xC5ED;)&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xBC29;&amp;#xB300;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; mutation-based fuzzer&amp;#xC758; seed&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. mp3&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2DC;&amp;#xB4DC;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#x201C;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; mp3&amp;#xD30C;&amp;#xC77C;&amp;#x201D;&amp;#xC758; &amp;#xBC94;&amp;#xC704;&amp;#xB294; &amp;#xBB34;&amp;#xD55C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC138;&amp;#xC0C1;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB178;&amp;#xB798;&amp;#xC640; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xC62C; &amp;#xB178;&amp;#xB798; &amp;#xBAA8;&amp;#xB450; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; mp3&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xBC94;&amp;#xC8FC;&amp;#xC548;&amp;#xC5D0; &amp;#xB4E4;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC2DC;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xAC78;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xCD08;&amp;#xAE30; seed pool&amp;#xC758; &amp;#xD06C;&amp;#xAE30; &amp;#xCD95;&amp;#xC18C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; seed selection problem&amp;#xC774;&amp;#xB77C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC00;&amp;#xC7A5; &amp;#xD754;&amp;#xD788; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; minset(&amp;#xCD5C;&amp;#xB300; coverage metric&amp;#xC744; &amp;#xAC16;&amp;#xB294; &amp;#xCD5C;&amp;#xC18C; seed &amp;#xC9D1;&amp;#xD569;)&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC801;&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04; &amp;#xBE44;&amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xB9CE;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD574;&amp;#xC57C; &amp;#xBC84;&amp;#xADF8; &amp;#xBC1C;&amp;#xACAC;&amp;#xC728;&amp;#xC744; &amp;#xC99D;&amp;#xAC00;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;seed selection&amp;#xC740; Preprocess &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; ConfUPDATE &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC591;&amp;#xD55C; coverage metic&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xBA3C;&amp;#xC800; AFL&amp;#xC740; &amp;#xAC01; branch&amp;#xC758; logarithmic counter(&amp;#xC9C0;&amp;#xC218; &amp;#xCE74;&amp;#xC6B4;&amp;#xD130;)&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; branch coverage &amp;#xAE30;&amp;#xBC18; &amp;#xD37C;&amp;#xC800;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. branch counter&amp;#xC758; &amp;#xD06C;&amp;#xAE30; &amp;#xC815;&amp;#xB3C4;(&amp;#xC0C1;&amp;#xC6A9;&amp;#xB85C;&amp;#xADF8;&amp;#xC758; &amp;#xCC99;&amp;#xB3C4;: &amp;#xADFC;&amp;#xC0AC;&amp;#xAC12;&amp;#xC758; &amp;#xD06C;&amp;#xAE30; &amp;#xB4F1;&amp;#xAE09;)&amp;#xAC00; &amp;#xB2EC;&amp;#xB77C;&amp;#xC57C; &amp;#xB2E4;&amp;#xB978; branch count&amp;#xB85C; &amp;#xCDE8;&amp;#xAE09;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;HonggFuzz&amp;#xB294; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC758; &amp;#xAC1C;&amp;#xC218;, &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; branch &amp;#xAC1C;&amp;#xC218;, &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; unique basic block &amp;#xAC1C;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; coverage&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;3-3-Seed-Trimming&#34;&gt;&lt;a href=&#34;#3-3-Seed-Trimming&#34; class=&#34;headerlink&#34; title=&#34;3.3 Seed Trimming&#34;&gt;&lt;/a&gt;3.3 Seed Trimming&lt;/h2&gt;&lt;p&gt;&amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xC791;&amp;#xC740; seed&amp;#xC77C;&amp;#xC218;&amp;#xB85D; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC18C;&amp;#xBAA8;&amp;#xB7C9;&amp;#xC774; &amp;#xC801;&amp;#xACE0;, &amp;#xB192;&amp;#xC740; &amp;#xCC98;&amp;#xB9AC;&amp;#xB7C9;(throughput)&amp;#xC744; &amp;#xAC16;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xBA87;&amp;#xBA87; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC740; &amp;#xD37C;&amp;#xC9D5; &amp;#xC804;&amp;#xC5D0; seed&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xC904;&amp;#xC774;&amp;#xB294; seed trimming &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Seed trimming&amp;#xC740; Preprocess&amp;#xB098; ConfUPDATE &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;AFL&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; seed&amp;#xAC00; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; coverage&amp;#xB97C; &amp;#xAC16;&amp;#xB294; &amp;#xBC94;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xC11C;&amp;#xD788; seed&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xB97C; &amp;#xC0AD;&amp;#xC81C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Linux system call handler&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5; &amp;#xD560; &amp;#xB54C;&amp;#xB294; static &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xB0B8; call dependency&amp;#xAC00; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xC120;&amp;#xC5D0;&amp;#xC11C; seed&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xC904;&amp;#xC774;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;3-4-Preparing-a-Driver-Application&#34;&gt;&lt;a href=&#34;#3-4-Preparing-a-Driver-Application&#34; class=&#34;headerlink&#34; title=&#34;3.4 Preparing a Driver Application&#34;&gt;&lt;/a&gt;3.4 Preparing a Driver Application&lt;/h2&gt;&lt;p&gt;PUT&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; PUT&amp;#xC774; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC77C; &amp;#xB54C;, &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xC18D; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC911;&amp;#xAC04;&amp;#xB2E4;&amp;#xB9AC; &amp;#xC5ED;&amp;#xD560;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; driver &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774;&amp;#xB77C; &amp;#xBD80;&amp;#xB974;&amp;#xB294;&amp;#xB370;, &amp;#xD754;&amp;#xD788; driver&amp;#xB77C;&amp;#xACE0; &amp;#xB9D0;&amp;#xD560; &amp;#xB54C; &amp;#xB5A0;&amp;#xC62C;&amp;#xB9AC;&amp;#xB294; device driver&amp;#xC640;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xAC1C;&amp;#xB150;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. fuzz campaign &amp;#xC2DC;&amp;#xC791; &amp;#xC804;&amp;#xC5D0; &amp;#xD55C; &amp;#xBC88;&amp;#xB9CC; &amp;#xB9CC;&amp;#xB4E4;&amp;#xBA74; &amp;#xB418;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xBC88;&amp;#xAC70;&amp;#xB85C;&amp;#xC6B4; &amp;#xC791;&amp;#xC5C5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC81C;&amp;#xAC00; &amp;#xC791;&amp;#xC131;&amp;#xD55C; WinAFL &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xADC0;&amp;#xCC2E;&amp;#xC740; &amp;#xC791;&amp;#xC5C5;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558; &amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xC2B7;&amp;#xD558;&amp;#xAC8C; &amp;#xCEE4;&amp;#xB110;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC720;&amp;#xC800; &amp;#xB79C;&amp;#xB4DC; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098; IoT &amp;#xC7A5;&amp;#xBE44;&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;&amp;#xD3F0; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC774; driver application&amp;#xC758; &amp;#xC608;&amp;#xC2DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Harness &amp;#xB610;&amp;#xD55C; Driver&amp;#xC758; &amp;#xAC1C;&amp;#xB150; &amp;#xC548;&amp;#xC5D0; &amp;#xC18D;&amp;#xD574;&amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;4-Scheduling&#34;&gt;&lt;a href=&#34;#4-Scheduling&#34; class=&#34;headerlink&#34; title=&#34;4. Scheduling&#34;&gt;&lt;/a&gt;4. Scheduling&lt;/h1&gt;&lt;pre&gt;&lt;code class=&#34;hljs livescript&#34;&gt;Schedule&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;(C, t_elapsed, t_limit)&lt;/span&gt; -&amp;gt;&lt;/span&gt; conf&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xCF00;&amp;#xC974;&amp;#xB9C1;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C; iteration&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD560; fuzz configuration&amp;#xC744; &amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC885;&amp;#xB958;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; configuration&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xB098;&amp;#xC758; configuration&amp;#xB9CC;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC2A4;&amp;#xCF00;&amp;#xC974;&amp;#xB9C1; &amp;#xB2E8;&amp;#xACC4;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; BFF&amp;#xB098; AFLFast&amp;#xCC98;&amp;#xB7FC; &amp;#xC798; &amp;#xC9DC;&amp;#xC5EC;&amp;#xC9C4; &amp;#xC2A4;&amp;#xCF00;&amp;#xC974;&amp;#xB9C1;&amp;#xC73C;&amp;#xB85C; &amp;#xC131;&amp;#xACF5;&amp;#xD55C; &amp;#xC0AC;&amp;#xB840;&amp;#xB3C4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD574; &amp;#xBCFC; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;white-box&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; symbolic executor &amp;#xB4F1; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB9CE;&amp;#xC544; &amp;#xC0DD;&amp;#xB7B5;&amp;#xD558;&amp;#xACE0; black-box&amp;#xC640; grey-box &amp;#xD37C;&amp;#xC800;&amp;#xC758; Scheduling &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xB9CC;&amp;#xC744; &amp;#xB2E4;&amp;#xB8F9;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;4-1-Fuzz-Configuration-Scheduling-FCS-Problem&#34;&gt;&lt;a href=&#34;#4-1-Fuzz-Configuration-Scheduling-FCS-Problem&#34; class=&#34;headerlink&#34; title=&#34;4.1 Fuzz Configuration Scheduling (FCS) Problem&#34;&gt;&lt;/a&gt;4.1 Fuzz Configuration Scheduling (FCS) Problem&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xCF00;&amp;#xC974;&amp;#xB9C1;&amp;#xC758; &amp;#xBAA9;&amp;#xC801;&amp;#xC740; &amp;#xD604;&amp;#xC7AC; &amp;#xC774;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCD5C;&amp;#xC120;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xB294; configuration&amp;#xC744; &amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; unique &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xAC00;&amp;#xC7A5; &amp;#xB9CE;&amp;#xC774; &amp;#xCC3E;&amp;#xAC70;&amp;#xB098;, &amp;#xAC00;&amp;#xC7A5; &amp;#xB113;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C8; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC608;&amp;#xC0C1;&amp;#xB418;&amp;#xB294; configuration&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC2A4;&amp;#xCF00;&amp;#xC974;&amp;#xB9C1; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC740; Exploration(&amp;#xD0D0;&amp;#xC0C9;)&amp;#xACFC; Exploitation(&amp;#xD65C;&amp;#xC6A9;) &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC08;&amp;#xB4F1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.(Exploration vs Exploitation trade off)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;exploration : &amp;#xBBF8;&amp;#xB798;&amp;#xB97C; &amp;#xC704;&amp;#xD574; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xB9CE;&amp;#xC740; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xD5A5;&amp;#xC73C;&amp;#xB85C; &amp;#xAC08; &amp;#xAC83;&amp;#xC774;&amp;#xB0D0;&lt;/li&gt;
&lt;li&gt;exploitation : &amp;#xC2E4;&amp;#xC9C1;&amp;#xC801;&amp;#xC778; &amp;#xC131;&amp;#xACFC;&amp;#xB97C; &amp;#xB0B4;&amp;#xB294; &amp;#xBC29;&amp;#xD5A5;&amp;#xC73C;&amp;#xB85C; &amp;#xAC08; &amp;#xAC83;&amp;#xC774;&amp;#xB0D0;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD37C;&amp;#xC9D5;&amp;#xC5D0;&amp;#xC120; &amp;#xC774;&amp;#xB7F0; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; Fuzz configuration Scheduling(FCS) &amp;#xBB38;&amp;#xC81C;&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;4-2-Black-box-FCS-Algorithms&#34;&gt;&lt;a href=&#34;#4-2-Black-box-FCS-Algorithms&#34; class=&#34;headerlink&#34; title=&#34;4.2 Black-box FCS Algorithms&#34;&gt;&lt;/a&gt;4.2 Black-box FCS Algorithms&lt;/h2&gt;&lt;p&gt;&amp;#xBE14;&amp;#xB799;&amp;#xBC15;&amp;#xC2A4;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; FCS &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; &amp;#xC774;&amp;#xC804; configuration&amp;#xC758; &amp;#xD37C;&amp;#xC9D5; &amp;#xACB0;&amp;#xACFC;&amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; &amp;#xD06C;&amp;#xB798;&amp;#xC26C;&amp;#xC640; &amp;#xBC84;&amp;#xADF8;&amp;#xC758; &amp;#xC218;, &amp;#xC18C;&amp;#xBAA8;&amp;#xB41C; &amp;#xC2DC;&amp;#xAC04; &amp;#xB4F1;&amp;#xC774; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;. &amp;#xC774;&amp;#xB7F0; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xCC98;&amp;#xC74C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB418;&amp;#xACE0; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xAC8C; BFF&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; BFF&amp;#xC758; &amp;#xC131;&amp;#xB2A5;&amp;#xC740; (&amp;#xC2E4;&amp;#xD589;&amp;#xB2F9; &amp;#xBC84;&amp;#xADF8;&amp;#xC218;)&amp;#xAC00; 85% &amp;#xC99D;&amp;#xAC00;&amp;#xD588;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC798; &amp;#xC9DC;&amp;#xC5EC;&amp;#xC9C4; FCS &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC758; &amp;#xC911;&amp;#xC694;&amp;#xC131;&amp;#xC774; &amp;#xC8FC;&amp;#xBAA9;&amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xACE7;&amp;#xBC14;&amp;#xB85C; &amp;#xD6C4;&amp;#xC18D; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB4E4;&amp;#xC774; &amp;#xB098;&amp;#xC654;&amp;#xB294;&amp;#xB370;, &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC544;&amp;#xC774;&amp;#xC774;&amp;#xC5B4;&amp;#xB85C; FCS &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xAC1C;&amp;#xC120;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xBE14;&amp;#xB799;&amp;#xBC15;&amp;#xC2A4; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xD37C;&amp;#xC9D5;&amp;#xC758; &amp;#xC218;&amp;#xD559;&amp;#xC801; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB358; Bernoulli trial(&amp;#xBCA0;&amp;#xB974;&amp;#xB204;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;)&amp;#xC5D0;&amp;#xC11C; WCCP/UW(Weighted Coupon Collector&amp;#x2019;s Problem with Unknown Weights)&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFC8;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/7.png&#34; alt&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xBCA0;&amp;#xB974;&amp;#xB204;&amp;#xC774; &amp;#xC2DC;&amp;#xD589;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB3D9;&amp;#xC804; &amp;#xB358;&amp;#xC9C0;&amp;#xAE30;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA74; &amp;#xB428;&lt;/li&gt;
&lt;li&gt;&amp;#xC131;&amp;#xACF5;, &amp;#xC2E4;&amp;#xD328; &amp;#xB458; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB9CC; &amp;#xC874;&amp;#xC7AC;&lt;/li&gt;
&lt;li&gt;&amp;#xAC01; configuration&amp;#xC740; &amp;#xACE0;&amp;#xC815;&amp;#xB41C; &amp;#xC131;&amp;#xACF5;&amp;#xB960;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xCFE0;&amp;#xD3F0; &amp;#xC218;&amp;#xC9D1; &amp;#xBB38;&amp;#xC81C;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD3EC;&amp;#xCF13;&amp;#xBAAC; &amp;#xBE75;&amp;#xC744; &amp;#xC0AC;&amp;#xBA74; 255&amp;#xB9C8;&amp;#xB9AC;&amp;#xC758; &amp;#xD3EC;&amp;#xCF13;&amp;#xBAAC;&amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xC2A4;&amp;#xD2F0;&amp;#xCEE4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC74C;.&lt;/li&gt;
&lt;li&gt;255&amp;#xB9C8;&amp;#xB9AC; &amp;#xD3EC;&amp;#xCF13;&amp;#xBAAC; &amp;#xC2A4;&amp;#xD2F0;&amp;#xCEE4;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBA87; &amp;#xAC1C;&amp;#xC758; &amp;#xBE75;&amp;#xC744; &amp;#xBA39;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xAC00;? &amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC9C8;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2DC;&amp;#xC791;&amp;#xB41C; &amp;#xBB38;&amp;#xC81C;&lt;/li&gt;
&lt;li&gt;&amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC131;&amp;#xACF5;&amp;#xB960;&amp;#xC758; &amp;#xCD5C;&amp;#xB300; &amp;#xBC94;&amp;#xC704;(upper-bound)&amp;#xAC00; &amp;#xBCC0;&amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC774; Multi-Armed Banbit(MAB) &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC870;&amp;#xC0AC;(investigate)&amp;#xD568;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD314;&amp;#xC774; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C; &amp;#xB2EC;&amp;#xB9B0; &amp;#xAC15;&amp;#xB3C4; &amp;#xBB38;&amp;#xC81C;(MAB)&amp;#xB294; decison science&amp;#xC5D0;&amp;#xC11C; exploration vs exploitation &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; &amp;#xC2AC;&amp;#xB86F;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xC2DC;&amp;#xAC04; &amp;#xB3D9;&amp;#xC548;&amp;#xB9CC; &amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xD55C; &amp;#xBC88;&amp;#xC5D0; &amp;#xD55C;&amp;#xAC1C;&amp;#xC758; &amp;#xC2AC;&amp;#xB86F;&amp;#xBA38;&amp;#xC2E0;&amp;#xB9CC;&amp;#xC744; &amp;#xC791;&amp;#xB3D9;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;(&amp;#xADF8;&amp;#xB7FC; &amp;#xAD73;&amp;#xC774; &amp;#xD314;&amp;#xC774; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C; &amp;#xB2EC;&amp;#xB824;&amp;#xC788;&amp;#xC744; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xB098;?) &amp;#xAC01; &amp;#xC2AC;&amp;#xB86F;&amp;#xBA38;&amp;#xC2E0;&amp;#xB9C8;&amp;#xB2E4; &amp;#xBCF4;&amp;#xC0C1;&amp;#xC774; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB54C; &amp;#xAC15;&amp;#xB3C4;&amp;#xAC00; &amp;#xCDE8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC120;&amp;#xD0DD;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBCF4;&amp;#xC0C1;&amp;#xC744; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xC2AC;&amp;#xB86F;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xB2F9;&amp;#xAE34;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xC2AC;&amp;#xB86F;&amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xBCF4;&amp;#xC0C1;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xAC15;&amp;#xB3C4;&amp;#xAC00; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xC2DC;&amp;#xAC04; &amp;#xB3D9;&amp;#xC548; &amp;#xCD5C;&amp;#xB300; &amp;#xC218;&amp;#xC775;&amp;#xC744; &amp;#xB0B4;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xADDC;&amp;#xCE59;&amp;#xC73C;&amp;#xB85C; &amp;#xC2AC;&amp;#xB86F;&amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xB808;&amp;#xBC84;&amp;#xB97C; &amp;#xB2F9;&amp;#xACA8;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xAC00;?&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xC870;&amp;#xAC74;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &amp;#xB3D9;&amp;#xC77C;&amp;#xD560; &amp;#xB54C; &amp;#xD37C;&amp;#xC9D5; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xBE60;&amp;#xB978; configuration&amp;#xC774; unique bug&amp;#xB97C; &amp;#xB354; &amp;#xB9CE;&amp;#xC774; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0;, &amp;#xBBF8;&amp;#xB798;&amp;#xC758; &amp;#xC131;&amp;#xACF5;&amp;#xB960;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; upper-bound&amp;#xB97C; &amp;#xC904;&amp;#xC774;&amp;#xB294;&amp;#xB370; &amp;#xC88B;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xC81C;&amp;#xC2DC;&amp;#xD568;&lt;/li&gt;
&lt;/ol&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD55C; &amp;#xBC88;&amp;#xC758; configuration selection &amp;#xB9C8;&amp;#xB2E4; &amp;#xACE0;&amp;#xC815;&amp;#xB41C; iteration &amp;#xD69F;&amp;#xC218;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xC2E0; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xC2DC;&amp;#xAC04; &amp;#xB3D9;&amp;#xC548; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xB9CC;&amp;#xD07C; iteration&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; BFF&amp;#xB97C; &amp;#xBC14;&amp;#xAFD4; &amp;#xB290;&amp;#xB9B0; configuration&amp;#xC5D0; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0AD;&amp;#xBE44;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD568;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAE30;&amp;#xC874; BFF&amp;#xC5D0; &amp;#xBE44;&amp;#xD574; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC2DC;&amp;#xAC04; &amp;#xB3D9;&amp;#xC548; &amp;#xC57D; 1.5&amp;#xBC30; &amp;#xB9CE;&amp;#xC740; unique bug&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB428;&lt;/p&gt;
&lt;h2 id=&#34;4-3-Grey-box-FCS-Algorithms&#34;&gt;&lt;a href=&#34;#4-3-Grey-box-FCS-Algorithms&#34; class=&#34;headerlink&#34; title=&#34;4.3 Grey-box FCS Algorithms&#34;&gt;&lt;/a&gt;4.3 Grey-box FCS Algorithms&lt;/h2&gt;&lt;p&gt;Code coverage &amp;#xB4F1; Grey-box&amp;#xC758; FCS &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC740; black-box&amp;#xC5D0; &amp;#xBE44;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC815;&amp;#xBCF4;&amp;#xC758; &amp;#xC120;&amp;#xD0DD; &amp;#xD3ED;&amp;#xC774; &amp;#xB113;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C4;&amp;#xD654; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;(Evolution Algorithm)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; AFL&amp;#xC774; grey-box FCS &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC758; &amp;#xC120;&amp;#xB450;&amp;#xC8FC;&amp;#xC790;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01; configuration&amp;#xB9C8;&amp;#xB2E4; &lt;code&gt;fitness&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xAC16;&amp;#xACE0;, &amp;#xC9C4;&amp;#xD654; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC774; &amp;#xC801;&amp;#xC808;&amp;#xD55C; configuartion&amp;#xC744; generic transformation(mutation, recombination)&amp;#xD574;&amp;#xC11C; &amp;#xC790;&amp;#xC2DD;&amp;#xC744; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xC790;&amp;#xC2DD;&amp;#xB4E4; &amp;#xC911; &amp;#xBD80;&amp;#xBAA8;&amp;#xBCF4;&amp;#xB2E4; fit &amp;#xD55C; &amp;#xB188;&amp;#xC774; &amp;#xC788;&amp;#xC744; &amp;#xAC70;&amp;#xB2E4;&amp;#xB77C;&amp;#xB294; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xC5D0; &amp;#xC9C4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC9C4;&amp;#xD654; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xC73C;&amp;#xB85C; FCS&amp;#xB97C; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC120; &amp;#xC544;&amp;#xB798; &amp;#xC9C8;&amp;#xBB38;&amp;#xB4E4;&amp;#xC744; &amp;#xB2F5;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;configuration&amp;#xC774; fit &amp;#xD55C; &amp;#xAE30;&amp;#xC900;&amp;#xC774; &amp;#xBB54;&amp;#xAC00;&lt;/li&gt;
&lt;li&gt;configuration&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xB098;&lt;/li&gt;
&lt;li&gt;&amp;#xC120;&amp;#xD0DD;&amp;#xD55C; configuration&amp;#xC73C;&amp;#xB85C; &amp;#xBB34;&amp;#xC5BC; &amp;#xD558;&amp;#xB098;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;high-level&amp;#xC5D0;&amp;#xC11C; &amp;#xC608;&amp;#xC0C1;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xC791;&amp;#xC740; input&amp;#xC744; fit &amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. AFL&amp;#xC740; configuration&amp;#xB4E4;&amp;#xC744; &amp;#xC6D0;&amp;#xD615; queue&amp;#xB85C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70; &amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; fit &amp;#xD55C; configuration&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xC11C; &amp;#xACE0;&amp;#xC815;&amp;#xB41C; &amp;#xD69F;&amp;#xC218;&amp;#xB9CC;&amp;#xD07C; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBE60;&amp;#xB978; configuration&amp;#xC744; &amp;#xC120;&amp;#xD638;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC740; black-box FCS&amp;#xC640; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;AFLFast&amp;#xB294; &amp;#xC544;&amp;#xB798; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC120;&amp;#xD638;&amp;#xD558;&amp;#xB294; input (Favroite input)&lt;ul&gt;
&lt;li&gt;&amp;#xD2B9;&amp;#xC815; control flow edge&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; configuration &amp;#xC911; AFLFast&amp;#xB294; &amp;#xC120;&amp;#xD0DD;&amp;#xC744; &amp;#xAC00;&amp;#xC7A5; &amp;#xC801;&amp;#xAC8C; &amp;#xBC1B;&amp;#xC740; configuration&amp;#xC744; &amp;#xC120;&amp;#xD638;&amp;#xD574; exploration &amp;#xC99D;&amp;#xAC00;&lt;/li&gt;
&lt;li&gt;&amp;#xC120;&amp;#xD0DD;&amp;#xBC1B;&amp;#xC740; &amp;#xD69F;&amp;#xC218;&amp;#xAC00; &amp;#xAC19;&amp;#xC740; configuration&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xAC00;&amp;#xC7A5; &amp;#xC801;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; path&amp;#xB97C; &amp;#xAC16;&amp;#xB294; configuration &amp;#xC120;&amp;#xD638;&amp;#xD574; &amp;#xD76C;&amp;#xADC0; path&amp;#xC758; &amp;#xD0D0;&amp;#xC0C9;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; exploration &amp;#xC99D;&amp;#xAC00;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;round-robin &amp;#xC120;&amp;#xD0DD; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xBC84;&amp;#xB9AC;&amp;#xACE0; fit configuration&amp;#xC758; &amp;#xC6B0;&amp;#xC120;&amp;#xC21C;&amp;#xC704;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xB2E4;&amp;#xC74C; configuration&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&lt;/li&gt;
&lt;li&gt;power schedule&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC815;&amp;#xD574;&amp;#xC9C4; &amp;#xD69F;&amp;#xC218;&amp;#xB9CC;&amp;#xD07C; &amp;#xC120;&amp;#xD0DD;&amp;#xB41C; configuration&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&lt;ul&gt;
&lt;li&gt;&amp;#xCC98;&amp;#xC74C;&amp;#xC5D4; &amp;#xC791;&amp;#xC740; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xC11C; &amp;#xC810;&amp;#xC810; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xD070; &amp;#xD3ED;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xD558;&amp;#xB294; &lt;code&gt;energy&lt;/code&gt;&amp;#xAC12;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&lt;/li&gt;
&lt;li&gt;path&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xB294; input&amp;#xC758; &amp;#xC218;&amp;#xB97C; &lt;code&gt;energy&lt;/code&gt; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xADDC;&amp;#xD654;&amp;#xD574;&amp;#xC11C; &amp;#xC801;&amp;#xAC8C; &amp;#xD37C;&amp;#xC9D5; &amp;#xB41C; configuration&amp;#xC774; &amp;#xC120;&amp;#xD0DD;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC7A5;&amp;#xB824;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;24&amp;#xC2DC;&amp;#xAC04; &amp;#xD37C;&amp;#xC9D5; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD574;&amp;#xBCF8; &amp;#xACB0;&amp;#xACFC; AFLFast&amp;#xB294; AFL&amp;#xC774; &amp;#xCC3E;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C; &amp;#xBC84;&amp;#xADF8; 3&amp;#xAC1C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC558;&amp;#xC73C;&amp;#xBA70;, AFL&amp;#xACFC; AFLFast &amp;#xB458;&amp;#xB2E4; &amp;#xCC3E;&amp;#xC740; &amp;#xBC84;&amp;#xADF8;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; AFLFast&amp;#xAC00; &amp;#xC57D; 7&amp;#xBC30;&amp;#xC815;&amp;#xB3C4; &amp;#xB354; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB2E4;&amp;#xC74C;-&amp;#xD30C;&amp;#xD2B8;-&amp;#xC608;&amp;#xACE0;&#34;&gt;&lt;a href=&#34;#&amp;#xB2E4;&amp;#xC74C;-&amp;#xD30C;&amp;#xD2B8;-&amp;#xC608;&amp;#xACE0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8; &amp;#xC608;&amp;#xACE0;&#34;&gt;&lt;/a&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8; &amp;#xC608;&amp;#xACE0;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC120; &amp;#xD37C;&amp;#xC9D5; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC758; &amp;#xC5EC;&amp;#xC12F; &amp;#xB2E8;&amp;#xACC4; &amp;#xC911; &amp;#xCCAB; &amp;#xB450; &amp;#xB2E8;&amp;#xACC4;&amp;#xC778; Preprocess&amp;#xC640; Scheduling&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xC9C1; &amp;#xAC08; &amp;#xAE38;&amp;#xC774; &amp;#xD55C;&amp;#xCC38; &amp;#xB0A8;&amp;#xC558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC7A0;&amp;#xC2DC; &amp;#xC26C;&amp;#xC5C8;&amp;#xB2E4;&amp;#xAC00; &amp;#xAC11;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D4; Input Generation&amp;#xACFC; Input Evaluation&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research]    fuzz 101 - part2 - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;a href=&#34;#&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;/a&gt;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/1.gif&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. Fabu1ous&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB9D0; &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; Part 2&amp;#xB97C; &amp;#xB4E4;&amp;#xACE0; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xBC88; Part 1&amp;#xC5D0;&amp;#xC11C; &amp;#xD37C;&amp;#xC9D5; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC758; &amp;#xAC00;&amp;#xC7A5; &amp;#xBCF4;&amp;#xD3B8;&amp;#xC801;&amp;#xC778; &amp;#xBAA8;&amp;#xB378;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC124;&amp;#xBA85;&amp;#xC744; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD37C;&amp;#xC9D5; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC740; Preprocess&amp;#xC640; Iteration&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC73C;&amp;#xBA70; Iteration&amp;#xC740; Schedule, InputGen, InputEval, ConfUpdate, Continue &amp;#xCD1D; 5&amp;#xAC1C; &amp;#xB2E8;&amp;#xACC4;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; Preprocess&amp;#xC640; Schedule &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Part 1&amp;#xC744; &amp;#xC548; &amp;#xBCF4;&amp;#xC168;&amp;#xAC70;&amp;#xB098; &amp;#xB108;&amp;#xBB34; &amp;#xC624;&amp;#xB798;&amp;#xC804;&amp;#xC5D0; &amp;#xC77D;&amp;#xC5B4;&amp;#xC11C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xAC00;&amp;#xBB3C;&amp;#xAC00;&amp;#xBB3C;&amp;#xD558;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; Part 1&amp;#xC744; &amp;#xC4F1; &amp;#xD6D1;&amp;#xC5B4;&amp;#xBCF4;&amp;#xACE0; &amp;#xC624;&amp;#xC2DC;&amp;#xAE38; &amp;#xBC14;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;. Part 1&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC6A9;&amp;#xC5B4;&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC704; GIF &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xAC19;&amp;#xC740; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;3-Preprocess&#34;&gt;&lt;a href=&#34;#3-Preprocess&#34; class=&#34;headerlink&#34; title=&#34;3. Preprocess&#34;&gt;&lt;/a&gt;3. Preprocess&lt;/h1&gt;&lt;pre&gt;&lt;code class=&#34;hljs livescript&#34;&gt;Preprocess&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;(C)&lt;/span&gt; -&amp;gt;&lt;/span&gt; C&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xCCAB; iteration &amp;#xC218;&amp;#xD589; &amp;#xC804;&amp;#xC5D0; &amp;#xCD08;&amp;#xAE30; fuzz configuration &amp;#xC9D1;&amp;#xD569;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; Preprocess, &amp;#xC804;&amp;#xCC98;&amp;#xB9AC; &amp;#xB2E8;&amp;#xACC4;&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB974;&amp;#xBA70; &amp;#xC8FC;&amp;#xB85C; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;PUT&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; instrumentation &amp;#xC801;&amp;#xC6A9;&lt;/li&gt;
&lt;li&gt;&amp;#xC4F8;&amp;#xBAA8;&amp;#xC5C6;&amp;#xB294; configuration &amp;#xC81C;&amp;#xAC70;&lt;/li&gt;
&lt;li&gt;seed trimming&lt;/li&gt;
&lt;li&gt;driver app &amp;#xC0DD;&amp;#xC131;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;Preprocess&amp;#xB294; InputGen&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC900;&amp;#xBE44; &amp;#xB2E8;&amp;#xACC4;&amp;#xC758; &amp;#xC758;&amp;#xBBF8;&amp;#xB3C4; &amp;#xC9C0;&amp;#xB2C8;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;3-1-Instrumentation&#34;&gt;&lt;a href=&#34;#3-1-Instrumentation&#34; class=&#34;headerlink&#34; title=&#34;3.1 Instrumentation&#34;&gt;&lt;/a&gt;3.1 Instrumentation&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;PUT &amp;#xCF54;&amp;#xB4DC; &amp;#xC0AC;&amp;#xC774;&amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; instrumentation &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD574; &amp;#xAC01; input&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; PUT&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xC5B4;&amp;#xB514;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB3C4;&amp;#xB2EC;(code coverage)&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; Instrumenation&amp;#xC774;&amp;#xB77C; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;black-box, gray-box, white-box &amp;#xB4F1; &amp;#xD37C;&amp;#xC9D5; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; &amp;#xC0C9;&amp;#xC740; PUT&amp;#xC758; &amp;#xB0B4;&amp;#xBD80; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xB9CE;&amp;#xC774; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xB294;&amp;#xAC00;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xB294;&amp;#xB370;, gray-box&amp;#xC640; white-box&amp;#xB294; PUT&amp;#xC5D0; instrumentaion&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD574; execution feedback&amp;#xC744; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0; &amp;#xADF8;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xB354; &amp;#xC815;&amp;#xAD50;&amp;#xD55C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;PUT &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; processor trace, system call usage &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xC911; instrumentation&amp;#xC774; &amp;#xAC00;&amp;#xC7A5; &amp;#xC4F8;&amp;#xBAA8; &amp;#xC788;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Program instrumentation&amp;#xC740; static(&amp;#xC815;&amp;#xC801;)&amp;#xACFC; dynamic(&amp;#xB3D9;&amp;#xC801;) &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;. Static &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; PUT &amp;#xC2E4;&amp;#xD589; &amp;#xC804; Preprocess &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0;, dynamic &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; PUT&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; InputEval &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC801;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;Static Instrumentaion&lt;/p&gt;
&lt;p&gt;&amp;#xC8FC;&amp;#xB85C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xB3C4;&amp;#xC911; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xB098; intermediate code&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD568;&lt;/p&gt;
&lt;p&gt;&amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xC804;&amp;#xC5D0; &amp;#xC218;&amp;#xD589;&amp;#xB418;&amp;#xB2C8; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xC624;&amp;#xBC84;&amp;#xD574;&amp;#xB4DC;&amp;#xAC00; &amp;#xD06C;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C;&lt;/p&gt;
&lt;p&gt;PUT&amp;#xC774; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xAC01;&amp;#xAC01; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC5D0; &amp;#xAC19;&amp;#xC740; instrumentaion &amp;#xC801;&amp;#xC6A9; &amp;#xD544;&amp;#xC694;(&amp;#xADC0;&amp;#xCC2E;&amp;#xB2E4;!)&lt;/p&gt;
&lt;p&gt;&amp;#xC18C;&amp;#xC2A4; &amp;#xB808;&amp;#xBCA8; &amp;#xB9D0;&amp;#xACE0; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB808;&amp;#xBCA8;&amp;#xC5D0;&amp;#xC11C; static instrumentation&amp;#xB3C4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD568;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Dynamic instrumentaion&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xBC84;&amp;#xD574;&amp;#xB4DC;&amp;#xAC00; &amp;#xD06C;&amp;#xC9C0;&amp;#xB9CC; instrumentation&amp;#xC744; PUT&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; DLL&amp;#xC5D0; &amp;#xADF8;&amp;#xB54C;&amp;#xADF8;&amp;#xB54C; &amp;#xC801;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC7A5;&amp;#xC810;&lt;/p&gt;
&lt;p&gt;DynInst, DynamoRIO, Valgrid, QEMU &amp;#xB4F1; &amp;#xB3D9;&amp;#xC801; instrumentation tool&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAF2D; static&amp;#xACFC; dynamic &amp;#xBC29;&amp;#xC2DD; &amp;#xC911; &amp;#xD55C; &amp;#xAC00;&amp;#xC9C0; instrumentaion&amp;#xB9CC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; AFL&amp;#xC740; &amp;#xC804;&amp;#xC6A9; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xB85C; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; static instrumentation&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; QEMU&amp;#xB85C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB808;&amp;#xBCA8; dynamic instrumentation&amp;#xB3C4; &amp;#xC801;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC9C1;&amp;#xC811; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; external library&amp;#xC5D0;&amp;#xB3C4; instrumentation&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD574; &amp;#xC880; &amp;#xB354; &amp;#xC644;&amp;#xBCBD;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xCE21;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;3-1-1-Execution-Feedback&#34;&gt;&lt;a href=&#34;#3-1-1-Execution-Feedback&#34; class=&#34;headerlink&#34; title=&#34;3.1.1 Execution Feedback&#34;&gt;&lt;/a&gt;3.1.1 Execution Feedback&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;gray-box &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xC8FC;&amp;#xB85C; execution feedback&amp;#xC744; input&amp;#xC73C;&amp;#xB85C; &amp;#xBC1B;&amp;#xC544; test case&amp;#xB97C; &amp;#xBC1C;&amp;#xC804;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xC608;&amp;#xB85C; AFL&amp;#xACFC; AFL&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xD30C;&amp;#xC0DD;&amp;#xB41C; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC740; PUT&amp;#xC758; branch instruction&amp;#xC5D0; intstrumentation&amp;#xC744; &amp;#xAC78;&amp;#xC5B4; branch coverage &amp;#xACC4;&amp;#xC0B0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Branch coverage&amp;#xB294; bit vector&amp;#xC758; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; path collision&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xB178;&amp;#xB825;&amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;CollAFL : path-sensitive hash function&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&lt;/li&gt;
&lt;li&gt;LibFuzzer, Syzkaller : node coverage&amp;#xB97C; execution feedback&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&lt;/li&gt;
&lt;li&gt;Honggfuzz : execution feedback&amp;#xC744; &amp;#xC720;&amp;#xC800;&amp;#xAC00; &amp;#xACE0;&amp;#xB97C; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;3-1-2-In-Memory-Fuzzing&#34;&gt;&lt;a href=&#34;#3-1-2-In-Memory-Fuzzing&#34; class=&#34;headerlink&#34; title=&#34;3.1.2 In-Memory Fuzzing&#34;&gt;&lt;/a&gt;3.1.2 In-Memory Fuzzing&lt;/h3&gt;&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xD06C;&amp;#xBA74; &amp;#xC624;&amp;#xBC84;&amp;#xD574;&amp;#xB4DC;&amp;#xB3C4; &amp;#xD06C;&amp;#xACA0;&amp;#xC8E0;? &amp;#xB9E4;&amp;#xBC88; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; re-spawning&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; PUT&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xB9CC; &amp;#xD37C;&amp;#xC9D5; &amp;#xD574; &amp;#xC624;&amp;#xBC84;&amp;#xD574;&amp;#xB4DC; &amp;#xCD5C;&amp;#xC18C;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; GUI &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0; initializing&amp;#xC774; &amp;#xC815;&amp;#xB9D0; &amp;#xC624;&amp;#xB798; &amp;#xAC78;&amp;#xB9AC;&amp;#xB294;&amp;#xB370;, &amp;#xADF8;&amp;#xB798;&amp;#xC11C; initialization &amp;#xC791;&amp;#xC5C5;&amp;#xC774; &amp;#xB05D;&amp;#xB09C; &amp;#xC2DC;&amp;#xC810;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC2A4;&amp;#xB0C5;&amp;#xC0F7;&amp;#xC744; &amp;#xCC0D;&amp;#xC5B4;&amp;#xB193;&amp;#xACE0; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xAE30;&amp;#xC220;&amp;#xC744; in-memory fuzzing&amp;#xC774;&amp;#xB77C; &amp;#xBD80;&amp;#xB974;&amp;#xACE0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84; &amp;#xAC04;&amp;#xC758; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC774; &amp;#xB9CE;&amp;#xC740; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5; &amp;#xD560; &amp;#xB54C; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;GRR&amp;#xC740; input byte&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xC2A4;&amp;#xB0C5;&amp;#xC0F7;&amp;#xC744; &amp;#xCC0D;&amp;#xC5B4; &amp;#xB9E4; iteration&amp;#xB9C8;&amp;#xB2E4; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xCD08;&amp;#xAE30; &amp;#xC2E4;&amp;#xD589; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xAC74;&amp;#xB108;&amp;#xB701;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;AFL&amp;#xC740; fork server&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xC2A4;&amp;#xD0C0;&amp;#xD2B8;&amp;#xC5C5; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. In-memory fuzzing&amp;#xACFC; &amp;#xBE44;&amp;#xC2B7; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC2A4;&amp;#xB0C5;&amp;#xC0F7;&amp;#xC744; &amp;#xCC0D;&amp;#xB294; &amp;#xB300;&amp;#xC2E0; iteration &amp;#xB9C8;&amp;#xB2E4; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; fork &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;PUT&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xC6D0;&amp;#xC0C1;&amp;#xBCF5;&amp;#xAD6C; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; in-memory fuzzing&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. In-memory API fuzzing&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xB370; AFL&amp;#xC758; persistence mode&amp;#xAC00; &amp;#xC774;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. PUT&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xC6D0;&amp;#xC0C1; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xD2B9;&amp;#xC815; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB8E8;&amp;#xD504;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBC18;&amp;#xBCF5; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Winnie &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9E7;&amp;#xAC8C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; &amp;#xC774;&amp;#xB7F0; persistence mode&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; global state&amp;#xB97C; &amp;#xC11C;&amp;#xC11C;&amp;#xD788; &amp;#xC624;&amp;#xC5FC;&amp;#xC2DC;&amp;#xCF1C; false positive &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xB098;&amp;#xC62C; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; in-memory API fuzzing&amp;#xC744; &amp;#xD560; &amp;#xB550; entry-point&amp;#xAC00; &amp;#xB420; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xB4DC;&amp;#xB294; &amp;#xB178;&amp;#xB825;&amp;#xC774; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;3-1-3-Thread-Scheduling&#34;&gt;&lt;a href=&#34;#3-1-3-Thread-Scheduling&#34; class=&#34;headerlink&#34; title=&#34;3.1.3 Thread Scheduling&#34;&gt;&lt;/a&gt;3.1.3 Thread Scheduling&lt;/h3&gt;&lt;p&gt;Race condition &amp;#xBC84;&amp;#xADF8;&amp;#xB4E4;&amp;#xC740; non-deterministic behavior(&amp;#xBE44;&amp;#xACB0;&amp;#xC815;&amp;#xB860;&amp;#xC801; &amp;#xD589;&amp;#xB3D9;: &amp;#xAC19;&amp;#xC740; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xBC1B;&amp;#xACE0;&amp;#xB3C4; &amp;#xB2E4;&amp;#xB978; &amp;#xD589;&amp;#xB3D9;&amp;#xC744; &amp;#xBCF4;&amp;#xC784;)&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC544; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xD558;&amp;#xAE30; &amp;#xAE4C;&amp;#xB2E4;&amp;#xB86D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; instrumentation&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC4F0;&amp;#xB798;&amp;#xB4DC; &amp;#xCC98;&amp;#xB9AC; &amp;#xC21C;&amp;#xC11C;&amp;#xB97C; &amp;#xC815;&amp;#xD558;&amp;#xBA74;(Thread scheduling) &amp;#xD2B9;&amp;#xC815; &amp;#xBE44;&amp;#xACB0;&amp;#xC815;&amp;#xB860;&amp;#xC801; &amp;#xD589;&amp;#xB3D9;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;3-2-Seed-selection&#34;&gt;&lt;a href=&#34;#3-2-Seed-selection&#34; class=&#34;headerlink&#34; title=&#34;3.2 Seed selection&#34;&gt;&lt;/a&gt;3.2 Seed selection&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xB294; fuzz configuration &amp;#xC9D1;&amp;#xD569;&amp;#xC744; &amp;#xBC1B;&amp;#xC544; fuzzing algorithm&amp;#xC758; &amp;#xD589;&amp;#xB3D9;&amp;#xC744; &amp;#xC81C;&amp;#xC5B4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB38;&amp;#xC81C;&amp;#xB294; fuzz configuration&amp;#xC758; &amp;#xBA87;&amp;#xBA87; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB4E4; value domain(&amp;#xC815;&amp;#xC758;&amp;#xC5ED;)&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xBC29;&amp;#xB300;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; mutation-based fuzzer&amp;#xC758; seed&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. mp3&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2DC;&amp;#xB4DC;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#x201C;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; mp3&amp;#xD30C;&amp;#xC77C;&amp;#x201D;&amp;#xC758; &amp;#xBC94;&amp;#xC704;&amp;#xB294; &amp;#xBB34;&amp;#xD55C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC138;&amp;#xC0C1;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB178;&amp;#xB798;&amp;#xC640; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xC62C; &amp;#xB178;&amp;#xB798; &amp;#xBAA8;&amp;#xB450; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; mp3&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xBC94;&amp;#xC8FC;&amp;#xC548;&amp;#xC5D0; &amp;#xB4E4;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC2DC;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xAC78;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xCD08;&amp;#xAE30; seed pool&amp;#xC758; &amp;#xD06C;&amp;#xAE30; &amp;#xCD95;&amp;#xC18C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; seed selection problem&amp;#xC774;&amp;#xB77C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC00;&amp;#xC7A5; &amp;#xD754;&amp;#xD788; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; minset(&amp;#xCD5C;&amp;#xB300; coverage metric&amp;#xC744; &amp;#xAC16;&amp;#xB294; &amp;#xCD5C;&amp;#xC18C; seed &amp;#xC9D1;&amp;#xD569;)&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC801;&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04; &amp;#xBE44;&amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xB9CE;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD574;&amp;#xC57C; &amp;#xBC84;&amp;#xADF8; &amp;#xBC1C;&amp;#xACAC;&amp;#xC728;&amp;#xC744; &amp;#xC99D;&amp;#xAC00;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;seed selection&amp;#xC740; Preprocess &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; ConfUPDATE &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC591;&amp;#xD55C; coverage metic&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xBA3C;&amp;#xC800; AFL&amp;#xC740; &amp;#xAC01; branch&amp;#xC758; logarithmic counter(&amp;#xC9C0;&amp;#xC218; &amp;#xCE74;&amp;#xC6B4;&amp;#xD130;)&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; branch coverage &amp;#xAE30;&amp;#xBC18; &amp;#xD37C;&amp;#xC800;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. branch counter&amp;#xC758; &amp;#xD06C;&amp;#xAE30; &amp;#xC815;&amp;#xB3C4;(&amp;#xC0C1;&amp;#xC6A9;&amp;#xB85C;&amp;#xADF8;&amp;#xC758; &amp;#xCC99;&amp;#xB3C4;: &amp;#xADFC;&amp;#xC0AC;&amp;#xAC12;&amp;#xC758; &amp;#xD06C;&amp;#xAE30; &amp;#xB4F1;&amp;#xAE09;)&amp;#xAC00; &amp;#xB2EC;&amp;#xB77C;&amp;#xC57C; &amp;#xB2E4;&amp;#xB978; branch count&amp;#xB85C; &amp;#xCDE8;&amp;#xAE09;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;HonggFuzz&amp;#xB294; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC758; &amp;#xAC1C;&amp;#xC218;, &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; branch &amp;#xAC1C;&amp;#xC218;, &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; unique basic block &amp;#xAC1C;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; coverage&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;3-3-Seed-Trimming&#34;&gt;&lt;a href=&#34;#3-3-Seed-Trimming&#34; class=&#34;headerlink&#34; title=&#34;3.3 Seed Trimming&#34;&gt;&lt;/a&gt;3.3 Seed Trimming&lt;/h2&gt;&lt;p&gt;&amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xC791;&amp;#xC740; seed&amp;#xC77C;&amp;#xC218;&amp;#xB85D; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC18C;&amp;#xBAA8;&amp;#xB7C9;&amp;#xC774; &amp;#xC801;&amp;#xACE0;, &amp;#xB192;&amp;#xC740; &amp;#xCC98;&amp;#xB9AC;&amp;#xB7C9;(throughput)&amp;#xC744; &amp;#xAC16;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xBA87;&amp;#xBA87; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC740; &amp;#xD37C;&amp;#xC9D5; &amp;#xC804;&amp;#xC5D0; seed&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xC904;&amp;#xC774;&amp;#xB294; seed trimming &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Seed trimming&amp;#xC740; Preprocess&amp;#xB098; ConfUPDATE &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;AFL&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; seed&amp;#xAC00; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; coverage&amp;#xB97C; &amp;#xAC16;&amp;#xB294; &amp;#xBC94;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xC11C;&amp;#xD788; seed&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xB97C; &amp;#xC0AD;&amp;#xC81C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Linux system call handler&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5; &amp;#xD560; &amp;#xB54C;&amp;#xB294; static &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xB0B8; call dependency&amp;#xAC00; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xC120;&amp;#xC5D0;&amp;#xC11C; seed&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xC904;&amp;#xC774;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;3-4-Preparing-a-Driver-Application&#34;&gt;&lt;a href=&#34;#3-4-Preparing-a-Driver-Application&#34; class=&#34;headerlink&#34; title=&#34;3.4 Preparing a Driver Application&#34;&gt;&lt;/a&gt;3.4 Preparing a Driver Application&lt;/h2&gt;&lt;p&gt;PUT&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; PUT&amp;#xC774; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC77C; &amp;#xB54C;, &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xC18D; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC911;&amp;#xAC04;&amp;#xB2E4;&amp;#xB9AC; &amp;#xC5ED;&amp;#xD560;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; driver &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774;&amp;#xB77C; &amp;#xBD80;&amp;#xB974;&amp;#xB294;&amp;#xB370;, &amp;#xD754;&amp;#xD788; driver&amp;#xB77C;&amp;#xACE0; &amp;#xB9D0;&amp;#xD560; &amp;#xB54C; &amp;#xB5A0;&amp;#xC62C;&amp;#xB9AC;&amp;#xB294; device driver&amp;#xC640;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xAC1C;&amp;#xB150;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. fuzz campaign &amp;#xC2DC;&amp;#xC791; &amp;#xC804;&amp;#xC5D0; &amp;#xD55C; &amp;#xBC88;&amp;#xB9CC; &amp;#xB9CC;&amp;#xB4E4;&amp;#xBA74; &amp;#xB418;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xBC88;&amp;#xAC70;&amp;#xB85C;&amp;#xC6B4; &amp;#xC791;&amp;#xC5C5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC81C;&amp;#xAC00; &amp;#xC791;&amp;#xC131;&amp;#xD55C; WinAFL &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xADC0;&amp;#xCC2E;&amp;#xC740; &amp;#xC791;&amp;#xC5C5;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558; &amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xC2B7;&amp;#xD558;&amp;#xAC8C; &amp;#xCEE4;&amp;#xB110;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC720;&amp;#xC800; &amp;#xB79C;&amp;#xB4DC; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098; IoT &amp;#xC7A5;&amp;#xBE44;&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;&amp;#xD3F0; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC774; driver application&amp;#xC758; &amp;#xC608;&amp;#xC2DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Harness &amp;#xB610;&amp;#xD55C; Driver&amp;#xC758; &amp;#xAC1C;&amp;#xB150; &amp;#xC548;&amp;#xC5D0; &amp;#xC18D;&amp;#xD574;&amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;4-Scheduling&#34;&gt;&lt;a href=&#34;#4-Scheduling&#34; class=&#34;headerlink&#34; title=&#34;4. Scheduling&#34;&gt;&lt;/a&gt;4. Scheduling&lt;/h1&gt;&lt;pre&gt;&lt;code class=&#34;hljs livescript&#34;&gt;Schedule&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;(C, t_elapsed, t_limit)&lt;/span&gt; -&amp;gt;&lt;/span&gt; conf&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xCF00;&amp;#xC974;&amp;#xB9C1;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C; iteration&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD560; fuzz configuration&amp;#xC744; &amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC885;&amp;#xB958;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; configuration&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xB098;&amp;#xC758; configuration&amp;#xB9CC;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC2A4;&amp;#xCF00;&amp;#xC974;&amp;#xB9C1; &amp;#xB2E8;&amp;#xACC4;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; BFF&amp;#xB098; AFLFast&amp;#xCC98;&amp;#xB7FC; &amp;#xC798; &amp;#xC9DC;&amp;#xC5EC;&amp;#xC9C4; &amp;#xC2A4;&amp;#xCF00;&amp;#xC974;&amp;#xB9C1;&amp;#xC73C;&amp;#xB85C; &amp;#xC131;&amp;#xACF5;&amp;#xD55C; &amp;#xC0AC;&amp;#xB840;&amp;#xB3C4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD574; &amp;#xBCFC; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;white-box&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; symbolic executor &amp;#xB4F1; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB9CE;&amp;#xC544; &amp;#xC0DD;&amp;#xB7B5;&amp;#xD558;&amp;#xACE0; black-box&amp;#xC640; grey-box &amp;#xD37C;&amp;#xC800;&amp;#xC758; Scheduling &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xB9CC;&amp;#xC744; &amp;#xB2E4;&amp;#xB8F9;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;4-1-Fuzz-Configuration-Scheduling-FCS-Problem&#34;&gt;&lt;a href=&#34;#4-1-Fuzz-Configuration-Scheduling-FCS-Problem&#34; class=&#34;headerlink&#34; title=&#34;4.1 Fuzz Configuration Scheduling (FCS) Problem&#34;&gt;&lt;/a&gt;4.1 Fuzz Configuration Scheduling (FCS) Problem&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xCF00;&amp;#xC974;&amp;#xB9C1;&amp;#xC758; &amp;#xBAA9;&amp;#xC801;&amp;#xC740; &amp;#xD604;&amp;#xC7AC; &amp;#xC774;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCD5C;&amp;#xC120;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xB294; configuration&amp;#xC744; &amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; unique &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xAC00;&amp;#xC7A5; &amp;#xB9CE;&amp;#xC774; &amp;#xCC3E;&amp;#xAC70;&amp;#xB098;, &amp;#xAC00;&amp;#xC7A5; &amp;#xB113;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C8; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC608;&amp;#xC0C1;&amp;#xB418;&amp;#xB294; configuration&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC2A4;&amp;#xCF00;&amp;#xC974;&amp;#xB9C1; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC740; Exploration(&amp;#xD0D0;&amp;#xC0C9;)&amp;#xACFC; Exploitation(&amp;#xD65C;&amp;#xC6A9;) &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC08;&amp;#xB4F1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.(Exploration vs Exploitation trade off)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;exploration : &amp;#xBBF8;&amp;#xB798;&amp;#xB97C; &amp;#xC704;&amp;#xD574; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xB9CE;&amp;#xC740; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xD5A5;&amp;#xC73C;&amp;#xB85C; &amp;#xAC08; &amp;#xAC83;&amp;#xC774;&amp;#xB0D0;&lt;/li&gt;
&lt;li&gt;exploitation : &amp;#xC2E4;&amp;#xC9C1;&amp;#xC801;&amp;#xC778; &amp;#xC131;&amp;#xACFC;&amp;#xB97C; &amp;#xB0B4;&amp;#xB294; &amp;#xBC29;&amp;#xD5A5;&amp;#xC73C;&amp;#xB85C; &amp;#xAC08; &amp;#xAC83;&amp;#xC774;&amp;#xB0D0;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD37C;&amp;#xC9D5;&amp;#xC5D0;&amp;#xC120; &amp;#xC774;&amp;#xB7F0; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; Fuzz configuration Scheduling(FCS) &amp;#xBB38;&amp;#xC81C;&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;4-2-Black-box-FCS-Algorithms&#34;&gt;&lt;a href=&#34;#4-2-Black-box-FCS-Algorithms&#34; class=&#34;headerlink&#34; title=&#34;4.2 Black-box FCS Algorithms&#34;&gt;&lt;/a&gt;4.2 Black-box FCS Algorithms&lt;/h2&gt;&lt;p&gt;&amp;#xBE14;&amp;#xB799;&amp;#xBC15;&amp;#xC2A4;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; FCS &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; &amp;#xC774;&amp;#xC804; configuration&amp;#xC758; &amp;#xD37C;&amp;#xC9D5; &amp;#xACB0;&amp;#xACFC;&amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; &amp;#xD06C;&amp;#xB798;&amp;#xC26C;&amp;#xC640; &amp;#xBC84;&amp;#xADF8;&amp;#xC758; &amp;#xC218;, &amp;#xC18C;&amp;#xBAA8;&amp;#xB41C; &amp;#xC2DC;&amp;#xAC04; &amp;#xB4F1;&amp;#xC774; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;. &amp;#xC774;&amp;#xB7F0; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xCC98;&amp;#xC74C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB418;&amp;#xACE0; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xAC8C; BFF&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; BFF&amp;#xC758; &amp;#xC131;&amp;#xB2A5;&amp;#xC740; (&amp;#xC2E4;&amp;#xD589;&amp;#xB2F9; &amp;#xBC84;&amp;#xADF8;&amp;#xC218;)&amp;#xAC00; 85% &amp;#xC99D;&amp;#xAC00;&amp;#xD588;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC798; &amp;#xC9DC;&amp;#xC5EC;&amp;#xC9C4; FCS &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC758; &amp;#xC911;&amp;#xC694;&amp;#xC131;&amp;#xC774; &amp;#xC8FC;&amp;#xBAA9;&amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xACE7;&amp;#xBC14;&amp;#xB85C; &amp;#xD6C4;&amp;#xC18D; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB4E4;&amp;#xC774; &amp;#xB098;&amp;#xC654;&amp;#xB294;&amp;#xB370;, &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC544;&amp;#xC774;&amp;#xC774;&amp;#xC5B4;&amp;#xB85C; FCS &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xAC1C;&amp;#xC120;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xBE14;&amp;#xB799;&amp;#xBC15;&amp;#xC2A4; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xD37C;&amp;#xC9D5;&amp;#xC758; &amp;#xC218;&amp;#xD559;&amp;#xC801; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB358; Bernoulli trial(&amp;#xBCA0;&amp;#xB974;&amp;#xB204;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;)&amp;#xC5D0;&amp;#xC11C; WCCP/UW(Weighted Coupon Collector&amp;#x2019;s Problem with Unknown Weights)&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFC8;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/7.png&#34; alt&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xBCA0;&amp;#xB974;&amp;#xB204;&amp;#xC774; &amp;#xC2DC;&amp;#xD589;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB3D9;&amp;#xC804; &amp;#xB358;&amp;#xC9C0;&amp;#xAE30;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA74; &amp;#xB428;&lt;/li&gt;
&lt;li&gt;&amp;#xC131;&amp;#xACF5;, &amp;#xC2E4;&amp;#xD328; &amp;#xB458; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB9CC; &amp;#xC874;&amp;#xC7AC;&lt;/li&gt;
&lt;li&gt;&amp;#xAC01; configuration&amp;#xC740; &amp;#xACE0;&amp;#xC815;&amp;#xB41C; &amp;#xC131;&amp;#xACF5;&amp;#xB960;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xCFE0;&amp;#xD3F0; &amp;#xC218;&amp;#xC9D1; &amp;#xBB38;&amp;#xC81C;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD3EC;&amp;#xCF13;&amp;#xBAAC; &amp;#xBE75;&amp;#xC744; &amp;#xC0AC;&amp;#xBA74; 255&amp;#xB9C8;&amp;#xB9AC;&amp;#xC758; &amp;#xD3EC;&amp;#xCF13;&amp;#xBAAC;&amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xC2A4;&amp;#xD2F0;&amp;#xCEE4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC74C;.&lt;/li&gt;
&lt;li&gt;255&amp;#xB9C8;&amp;#xB9AC; &amp;#xD3EC;&amp;#xCF13;&amp;#xBAAC; &amp;#xC2A4;&amp;#xD2F0;&amp;#xCEE4;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBA87; &amp;#xAC1C;&amp;#xC758; &amp;#xBE75;&amp;#xC744; &amp;#xBA39;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xAC00;? &amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC9C8;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2DC;&amp;#xC791;&amp;#xB41C; &amp;#xBB38;&amp;#xC81C;&lt;/li&gt;
&lt;li&gt;&amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC131;&amp;#xACF5;&amp;#xB960;&amp;#xC758; &amp;#xCD5C;&amp;#xB300; &amp;#xBC94;&amp;#xC704;(upper-bound)&amp;#xAC00; &amp;#xBCC0;&amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC774; Multi-Armed Banbit(MAB) &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC870;&amp;#xC0AC;(investigate)&amp;#xD568;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD314;&amp;#xC774; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C; &amp;#xB2EC;&amp;#xB9B0; &amp;#xAC15;&amp;#xB3C4; &amp;#xBB38;&amp;#xC81C;(MAB)&amp;#xB294; decison science&amp;#xC5D0;&amp;#xC11C; exploration vs exploitation &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; &amp;#xC2AC;&amp;#xB86F;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xC2DC;&amp;#xAC04; &amp;#xB3D9;&amp;#xC548;&amp;#xB9CC; &amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xD55C; &amp;#xBC88;&amp;#xC5D0; &amp;#xD55C;&amp;#xAC1C;&amp;#xC758; &amp;#xC2AC;&amp;#xB86F;&amp;#xBA38;&amp;#xC2E0;&amp;#xB9CC;&amp;#xC744; &amp;#xC791;&amp;#xB3D9;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;(&amp;#xADF8;&amp;#xB7FC; &amp;#xAD73;&amp;#xC774; &amp;#xD314;&amp;#xC774; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C; &amp;#xB2EC;&amp;#xB824;&amp;#xC788;&amp;#xC744; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xB098;?) &amp;#xAC01; &amp;#xC2AC;&amp;#xB86F;&amp;#xBA38;&amp;#xC2E0;&amp;#xB9C8;&amp;#xB2E4; &amp;#xBCF4;&amp;#xC0C1;&amp;#xC774; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB54C; &amp;#xAC15;&amp;#xB3C4;&amp;#xAC00; &amp;#xCDE8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC120;&amp;#xD0DD;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBCF4;&amp;#xC0C1;&amp;#xC744; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xC2AC;&amp;#xB86F;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xB2F9;&amp;#xAE34;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xC2AC;&amp;#xB86F;&amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xBCF4;&amp;#xC0C1;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xAC15;&amp;#xB3C4;&amp;#xAC00; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xC2DC;&amp;#xAC04; &amp;#xB3D9;&amp;#xC548; &amp;#xCD5C;&amp;#xB300; &amp;#xC218;&amp;#xC775;&amp;#xC744; &amp;#xB0B4;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xADDC;&amp;#xCE59;&amp;#xC73C;&amp;#xB85C; &amp;#xC2AC;&amp;#xB86F;&amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xB808;&amp;#xBC84;&amp;#xB97C; &amp;#xB2F9;&amp;#xACA8;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xAC00;?&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xC870;&amp;#xAC74;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &amp;#xB3D9;&amp;#xC77C;&amp;#xD560; &amp;#xB54C; &amp;#xD37C;&amp;#xC9D5; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xBE60;&amp;#xB978; configuration&amp;#xC774; unique bug&amp;#xB97C; &amp;#xB354; &amp;#xB9CE;&amp;#xC774; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0;, &amp;#xBBF8;&amp;#xB798;&amp;#xC758; &amp;#xC131;&amp;#xACF5;&amp;#xB960;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; upper-bound&amp;#xB97C; &amp;#xC904;&amp;#xC774;&amp;#xB294;&amp;#xB370; &amp;#xC88B;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xC81C;&amp;#xC2DC;&amp;#xD568;&lt;/li&gt;
&lt;/ol&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD55C; &amp;#xBC88;&amp;#xC758; configuration selection &amp;#xB9C8;&amp;#xB2E4; &amp;#xACE0;&amp;#xC815;&amp;#xB41C; iteration &amp;#xD69F;&amp;#xC218;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xC2E0; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xC2DC;&amp;#xAC04; &amp;#xB3D9;&amp;#xC548; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xB9CC;&amp;#xD07C; iteration&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; BFF&amp;#xB97C; &amp;#xBC14;&amp;#xAFD4; &amp;#xB290;&amp;#xB9B0; configuration&amp;#xC5D0; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0AD;&amp;#xBE44;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD568;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAE30;&amp;#xC874; BFF&amp;#xC5D0; &amp;#xBE44;&amp;#xD574; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC2DC;&amp;#xAC04; &amp;#xB3D9;&amp;#xC548; &amp;#xC57D; 1.5&amp;#xBC30; &amp;#xB9CE;&amp;#xC740; unique bug&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB428;&lt;/p&gt;
&lt;h2 id=&#34;4-3-Grey-box-FCS-Algorithms&#34;&gt;&lt;a href=&#34;#4-3-Grey-box-FCS-Algorithms&#34; class=&#34;headerlink&#34; title=&#34;4.3 Grey-box FCS Algorithms&#34;&gt;&lt;/a&gt;4.3 Grey-box FCS Algorithms&lt;/h2&gt;&lt;p&gt;Code coverage &amp;#xB4F1; Grey-box&amp;#xC758; FCS &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC740; black-box&amp;#xC5D0; &amp;#xBE44;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC815;&amp;#xBCF4;&amp;#xC758; &amp;#xC120;&amp;#xD0DD; &amp;#xD3ED;&amp;#xC774; &amp;#xB113;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C4;&amp;#xD654; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;(Evolution Algorithm)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; AFL&amp;#xC774; grey-box FCS &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC758; &amp;#xC120;&amp;#xB450;&amp;#xC8FC;&amp;#xC790;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01; configuration&amp;#xB9C8;&amp;#xB2E4; &lt;code&gt;fitness&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xAC16;&amp;#xACE0;, &amp;#xC9C4;&amp;#xD654; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC774; &amp;#xC801;&amp;#xC808;&amp;#xD55C; configuartion&amp;#xC744; generic transformation(mutation, recombination)&amp;#xD574;&amp;#xC11C; &amp;#xC790;&amp;#xC2DD;&amp;#xC744; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xC790;&amp;#xC2DD;&amp;#xB4E4; &amp;#xC911; &amp;#xBD80;&amp;#xBAA8;&amp;#xBCF4;&amp;#xB2E4; fit &amp;#xD55C; &amp;#xB188;&amp;#xC774; &amp;#xC788;&amp;#xC744; &amp;#xAC70;&amp;#xB2E4;&amp;#xB77C;&amp;#xB294; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xC5D0; &amp;#xC9C4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC9C4;&amp;#xD654; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xC73C;&amp;#xB85C; FCS&amp;#xB97C; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC120; &amp;#xC544;&amp;#xB798; &amp;#xC9C8;&amp;#xBB38;&amp;#xB4E4;&amp;#xC744; &amp;#xB2F5;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;configuration&amp;#xC774; fit &amp;#xD55C; &amp;#xAE30;&amp;#xC900;&amp;#xC774; &amp;#xBB54;&amp;#xAC00;&lt;/li&gt;
&lt;li&gt;configuration&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xB098;&lt;/li&gt;
&lt;li&gt;&amp;#xC120;&amp;#xD0DD;&amp;#xD55C; configuration&amp;#xC73C;&amp;#xB85C; &amp;#xBB34;&amp;#xC5BC; &amp;#xD558;&amp;#xB098;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;high-level&amp;#xC5D0;&amp;#xC11C; &amp;#xC608;&amp;#xC0C1;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xC791;&amp;#xC740; input&amp;#xC744; fit &amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. AFL&amp;#xC740; configuration&amp;#xB4E4;&amp;#xC744; &amp;#xC6D0;&amp;#xD615; queue&amp;#xB85C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70; &amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; fit &amp;#xD55C; configuration&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xC11C; &amp;#xACE0;&amp;#xC815;&amp;#xB41C; &amp;#xD69F;&amp;#xC218;&amp;#xB9CC;&amp;#xD07C; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBE60;&amp;#xB978; configuration&amp;#xC744; &amp;#xC120;&amp;#xD638;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC740; black-box FCS&amp;#xC640; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;AFLFast&amp;#xB294; &amp;#xC544;&amp;#xB798; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC120;&amp;#xD638;&amp;#xD558;&amp;#xB294; input (Favroite input)&lt;ul&gt;
&lt;li&gt;&amp;#xD2B9;&amp;#xC815; control flow edge&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; configuration &amp;#xC911; AFLFast&amp;#xB294; &amp;#xC120;&amp;#xD0DD;&amp;#xC744; &amp;#xAC00;&amp;#xC7A5; &amp;#xC801;&amp;#xAC8C; &amp;#xBC1B;&amp;#xC740; configuration&amp;#xC744; &amp;#xC120;&amp;#xD638;&amp;#xD574; exploration &amp;#xC99D;&amp;#xAC00;&lt;/li&gt;
&lt;li&gt;&amp;#xC120;&amp;#xD0DD;&amp;#xBC1B;&amp;#xC740; &amp;#xD69F;&amp;#xC218;&amp;#xAC00; &amp;#xAC19;&amp;#xC740; configuration&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xAC00;&amp;#xC7A5; &amp;#xC801;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; path&amp;#xB97C; &amp;#xAC16;&amp;#xB294; configuration &amp;#xC120;&amp;#xD638;&amp;#xD574; &amp;#xD76C;&amp;#xADC0; path&amp;#xC758; &amp;#xD0D0;&amp;#xC0C9;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; exploration &amp;#xC99D;&amp;#xAC00;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;round-robin &amp;#xC120;&amp;#xD0DD; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xBC84;&amp;#xB9AC;&amp;#xACE0; fit configuration&amp;#xC758; &amp;#xC6B0;&amp;#xC120;&amp;#xC21C;&amp;#xC704;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xB2E4;&amp;#xC74C; configuration&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&lt;/li&gt;
&lt;li&gt;power schedule&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC815;&amp;#xD574;&amp;#xC9C4; &amp;#xD69F;&amp;#xC218;&amp;#xB9CC;&amp;#xD07C; &amp;#xC120;&amp;#xD0DD;&amp;#xB41C; configuration&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&lt;ul&gt;
&lt;li&gt;&amp;#xCC98;&amp;#xC74C;&amp;#xC5D4; &amp;#xC791;&amp;#xC740; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xC11C; &amp;#xC810;&amp;#xC810; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xD070; &amp;#xD3ED;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xD558;&amp;#xB294; &lt;code&gt;energy&lt;/code&gt;&amp;#xAC12;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&lt;/li&gt;
&lt;li&gt;path&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xB294; input&amp;#xC758; &amp;#xC218;&amp;#xB97C; &lt;code&gt;energy&lt;/code&gt; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xADDC;&amp;#xD654;&amp;#xD574;&amp;#xC11C; &amp;#xC801;&amp;#xAC8C; &amp;#xD37C;&amp;#xC9D5; &amp;#xB41C; configuration&amp;#xC774; &amp;#xC120;&amp;#xD0DD;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC7A5;&amp;#xB824;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;24&amp;#xC2DC;&amp;#xAC04; &amp;#xD37C;&amp;#xC9D5; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD574;&amp;#xBCF8; &amp;#xACB0;&amp;#xACFC; AFLFast&amp;#xB294; AFL&amp;#xC774; &amp;#xCC3E;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C; &amp;#xBC84;&amp;#xADF8; 3&amp;#xAC1C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC558;&amp;#xC73C;&amp;#xBA70;, AFL&amp;#xACFC; AFLFast &amp;#xB458;&amp;#xB2E4; &amp;#xCC3E;&amp;#xC740; &amp;#xBC84;&amp;#xADF8;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; AFLFast&amp;#xAC00; &amp;#xC57D; 7&amp;#xBC30;&amp;#xC815;&amp;#xB3C4; &amp;#xB354; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB2E4;&amp;#xC74C;-&amp;#xD30C;&amp;#xD2B8;-&amp;#xC608;&amp;#xACE0;&#34;&gt;&lt;a href=&#34;#&amp;#xB2E4;&amp;#xC74C;-&amp;#xD30C;&amp;#xD2B8;-&amp;#xC608;&amp;#xACE0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8; &amp;#xC608;&amp;#xACE0;&#34;&gt;&lt;/a&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8; &amp;#xC608;&amp;#xACE0;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/03/fabu1ous/fuzz-2/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC120; &amp;#xD37C;&amp;#xC9D5; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC758; &amp;#xC5EC;&amp;#xC12F; &amp;#xB2E8;&amp;#xACC4; &amp;#xC911; &amp;#xCCAB; &amp;#xB450; &amp;#xB2E8;&amp;#xACC4;&amp;#xC778; Preprocess&amp;#xC640; Scheduling&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xC9C1; &amp;#xAC08; &amp;#xAE38;&amp;#xC774; &amp;#xD55C;&amp;#xCC38; &amp;#xB0A8;&amp;#xC558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC7A0;&amp;#xC2DC; &amp;#xC26C;&amp;#xC5C8;&amp;#xB2E4;&amp;#xAC00; &amp;#xAC11;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D4; Input Generation&amp;#xACFC; Input Evaluation&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/10/03/fabu1ous/fuzz-2/1.gif">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/10/03/fabu1ous/fuzz-2/">

  <title>[Research]    fuzz 101 - part2 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-10-03 14:00" pubdate>
      2021 10 3 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      79
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research]    fuzz 101 - part2</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="&#xBA38;&#xB9BF;&#xB9D0;"><a href="#&#xBA38;&#xB9BF;&#xB9D0;" class="headerlink" title="&#xBA38;&#xB9BF;&#xB9D0;"></a>&#xBA38;&#xB9BF;&#xB9D0;</h1><p><img src="/2021/10/03/fabu1ous/fuzz-2/1.gif" srcset="/img/loading.gif" alt></p>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;. Fabu1ous&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC815;&#xB9D0; &#xC624;&#xB79C;&#xB9CC;&#xC5D0; Part 2&#xB97C; &#xB4E4;&#xACE0; &#xB3CC;&#xC544;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xBC88; Part 1&#xC5D0;&#xC11C; &#xD37C;&#xC9D5; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC758; &#xAC00;&#xC7A5; &#xBCF4;&#xD3B8;&#xC801;&#xC778; &#xBAA8;&#xB378;&#xC5D0; &#xB300;&#xD55C; &#xC124;&#xBA85;&#xC744; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD37C;&#xC9D5; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC740; Preprocess&#xC640; Iteration&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5B4;&#xC788;&#xC73C;&#xBA70; Iteration&#xC740; Schedule, InputGen, InputEval, ConfUpdate, Continue &#xCD1D; 5&#xAC1C; &#xB2E8;&#xACC4;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xC911;&#xC5D0;&#xC11C; Preprocess&#xC640; Schedule &#xB2E8;&#xACC4;&#xB97C; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p>Part 1&#xC744; &#xC548; &#xBCF4;&#xC168;&#xAC70;&#xB098; &#xB108;&#xBB34; &#xC624;&#xB798;&#xC804;&#xC5D0; &#xC77D;&#xC5B4;&#xC11C; &#xB0B4;&#xC6A9;&#xC774; &#xAC00;&#xBB3C;&#xAC00;&#xBB3C;&#xD558;&#xC2E0; &#xBD84;&#xB4E4;&#xC740; Part 1&#xC744; &#xC4F1; &#xD6D1;&#xC5B4;&#xBCF4;&#xACE0; &#xC624;&#xC2DC;&#xAE38; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;. Part 1&#xC5D0;&#xC11C; &#xB2E4;&#xC591;&#xD55C; &#xC6A9;&#xC5B4;&#xB97C; &#xC815;&#xC758;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC704; GIF &#xC774;&#xBBF8;&#xC9C0; &#xAC19;&#xC740; &#xC0C1;&#xD669;&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="3-Preprocess"><a href="#3-Preprocess" class="headerlink" title="3. Preprocess"></a>3. Preprocess</h1><pre><code class="hljs livescript">Preprocess<span class="hljs-function"><span class="hljs-params">(C)</span> -&gt;</span> C</code></pre>
<p>&#xD37C;&#xC800;&#xC758; &#xCCAB; iteration &#xC218;&#xD589; &#xC804;&#xC5D0; &#xCD08;&#xAE30; fuzz configuration &#xC9D1;&#xD569;&#xC744; &#xC218;&#xC815;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; Preprocess, &#xC804;&#xCC98;&#xB9AC; &#xB2E8;&#xACC4;&#xB77C;&#xACE0; &#xBD80;&#xB974;&#xBA70; &#xC8FC;&#xB85C; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>PUT&#xC5D0; &#xB300;&#xD55C; instrumentation &#xC801;&#xC6A9;</li>
<li>&#xC4F8;&#xBAA8;&#xC5C6;&#xB294; configuration &#xC81C;&#xAC70;</li>
<li>seed trimming</li>
<li>driver app &#xC0DD;&#xC131;</li>
</ol>
<p>Preprocess&#xB294; InputGen&#xC5D0; &#xB300;&#xD55C; &#xC900;&#xBE44; &#xB2E8;&#xACC4;&#xC758; &#xC758;&#xBBF8;&#xB3C4; &#xC9C0;&#xB2C8;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="3-1-Instrumentation"><a href="#3-1-Instrumentation" class="headerlink" title="3.1 Instrumentation"></a>3.1 Instrumentation</h2><p><img src="/2021/10/03/fabu1ous/fuzz-2/2.png" srcset="/img/loading.gif" alt></p>
<p>PUT &#xCF54;&#xB4DC; &#xC0AC;&#xC774;&#xC0AC;&#xC774;&#xC5D0; instrumentation &#xCF54;&#xB4DC;&#xB97C; &#xC0BD;&#xC785;&#xD574; &#xAC01; input&#xC5D0; &#xB300;&#xD55C; PUT&#xC758; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC774; &#xC5B4;&#xB514;&#xAE4C;&#xC9C0; &#xB3C4;&#xB2EC;(code coverage)&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xB294; &#xAC83;&#xC744; Instrumenation&#xC774;&#xB77C; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;.</p>
<p>black-box, gray-box, white-box &#xB4F1; &#xD37C;&#xC9D5; &#xD14C;&#xC2A4;&#xD2B8;&#xC758; &#xC0C9;&#xC740; PUT&#xC758; &#xB0B4;&#xBD80; &#xC815;&#xBCF4;&#xB97C; &#xC5BC;&#xB9C8;&#xB098; &#xB9CE;&#xC774; &#xC218;&#xC9D1;&#xD558;&#xB294;&#xAC00;&#xC5D0; &#xB530;&#xB77C; &#xB2EC;&#xB77C;&#xC9C0;&#xB294;&#xB370;, gray-box&#xC640; white-box&#xB294; PUT&#xC5D0; instrumentaion&#xC744; &#xC801;&#xC6A9;&#xD574; execution feedback&#xC744; &#xC218;&#xC9D1;&#xD558;&#xACE0; &#xADF8;&#xC5D0; &#xB9DE;&#xCDB0; &#xB354; &#xC815;&#xAD50;&#xD55C; &#xD37C;&#xC9D5;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>PUT &#xB0B4;&#xBD80;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC5BB;&#xB294; &#xBC29;&#xBC95;&#xC740; processor trace, system call usage &#xB4F1; &#xB2E4;&#xC591;&#xD558;&#xC9C0;&#xB9CC; &#xADF8;&#xC911; instrumentation&#xC774; &#xAC00;&#xC7A5; &#xC4F8;&#xBAA8; &#xC788;&#xB294; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC218;&#xC9D1;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Program instrumentation&#xC740; static(&#xC815;&#xC801;)&#xACFC; dynamic(&#xB3D9;&#xC801;) &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xB098;&#xB269;&#xB2C8;&#xB2E4;. Static &#xBC29;&#xC2DD;&#xC740; PUT &#xC2E4;&#xD589; &#xC804; Preprocess &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xC801;&#xC6A9;&#xB418;&#xACE0;, dynamic &#xBC29;&#xC2DD;&#xC740; &#xC2E4;&#xC81C;&#xB85C; PUT&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xB294; InputEval &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xC801;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p>Static Instrumentaion</p>
<p>&#xC8FC;&#xB85C; &#xCEF4;&#xD30C;&#xC77C; &#xB3C4;&#xC911; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB098; intermediate code&#xC5D0; &#xC801;&#xC6A9;&#xD568;</p>
<p>&#xB7F0;&#xD0C0;&#xC784; &#xC804;&#xC5D0; &#xC218;&#xD589;&#xB418;&#xB2C8; &#xB2F9;&#xC5F0;&#xD788; &#xB7F0;&#xD0C0;&#xC784; &#xC624;&#xBC84;&#xD574;&#xB4DC;&#xAC00; &#xD06C;&#xC9C0; &#xC54A;&#xC74C;</p>
<p>PUT&#xC774; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xBA74; &#xAC01;&#xAC01; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC5D0; &#xAC19;&#xC740; instrumentaion &#xC801;&#xC6A9; &#xD544;&#xC694;(&#xADC0;&#xCC2E;&#xB2E4;!)</p>
<p>&#xC18C;&#xC2A4; &#xB808;&#xBCA8; &#xB9D0;&#xACE0; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB808;&#xBCA8;&#xC5D0;&#xC11C; static instrumentation&#xB3C4; &#xAC00;&#xB2A5;&#xD568;</p>
</li>
<li><p>Dynamic instrumentaion</p>
<p>&#xC624;&#xBC84;&#xD574;&#xB4DC;&#xAC00; &#xD06C;&#xC9C0;&#xB9CC; instrumentation&#xC744; PUT&#xAC00; &#xC0AC;&#xC6A9;&#xD558;&#xB294; DLL&#xC5D0; &#xADF8;&#xB54C;&#xADF8;&#xB54C; &#xC801;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC774; &#xC7A5;&#xC810;</p>
<p>DynInst, DynamoRIO, Valgrid, QEMU &#xB4F1; &#xB3D9;&#xC801; instrumentation tool&#xC744; &#xC0AC;&#xC6A9;</p>
</li>
</ul>
<p><img src="/2021/10/03/fabu1ous/fuzz-2/3.png" srcset="/img/loading.gif" alt></p>
<p>&#xAF2D; static&#xACFC; dynamic &#xBC29;&#xC2DD; &#xC911; &#xD55C; &#xAC00;&#xC9C0; instrumentaion&#xB9CC; &#xC0AC;&#xC6A9;&#xD574;&#xC57C; &#xD558;&#xB294; &#xAC83;&#xC740; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; AFL&#xC740; &#xC804;&#xC6A9; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB85C; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xC5D0; static instrumentation&#xC744; &#xC801;&#xC6A9;&#xD558;&#xACE0; QEMU&#xB85C; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB808;&#xBCA8; dynamic instrumentation&#xB3C4; &#xC801;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xC9C1;&#xC811; &#xCEF4;&#xD30C;&#xC77C;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB294; external library&#xC5D0;&#xB3C4; instrumentation&#xC744; &#xC801;&#xC6A9;&#xD574; &#xC880; &#xB354; &#xC644;&#xBCBD;&#xD55C; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB97C; &#xCE21;&#xC815;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<h3 id="3-1-1-Execution-Feedback"><a href="#3-1-1-Execution-Feedback" class="headerlink" title="3.1.1 Execution Feedback"></a>3.1.1 Execution Feedback</h3><p><img src="/2021/10/03/fabu1ous/fuzz-2/4.png" srcset="/img/loading.gif" alt></p>
<p>gray-box &#xD37C;&#xC800;&#xB294; &#xC8FC;&#xB85C; execution feedback&#xC744; input&#xC73C;&#xB85C; &#xBC1B;&#xC544; test case&#xB97C; &#xBC1C;&#xC804;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;. &#xADF8; &#xC608;&#xB85C; AFL&#xACFC; AFL&#xB85C;&#xBD80;&#xD130; &#xD30C;&#xC0DD;&#xB41C; &#xD37C;&#xC800;&#xB4E4;&#xC740; PUT&#xC758; branch instruction&#xC5D0; intstrumentation&#xC744; &#xAC78;&#xC5B4; branch coverage &#xACC4;&#xC0B0;&#xD569;&#xB2C8;&#xB2E4;. Branch coverage&#xB294; bit vector&#xC758; &#xD615;&#xD0DC;&#xB85C; &#xC218;&#xC9D1;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; path collision&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xC5B4; &#xC774;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xB178;&#xB825;&#xB4E4;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>CollAFL : path-sensitive hash function&#xC73C;&#xB85C; &#xC774;&#xB97C; &#xD574;&#xACB0;</li>
<li>LibFuzzer, Syzkaller : node coverage&#xB97C; execution feedback&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;</li>
<li>Honggfuzz : execution feedback&#xC744; &#xC720;&#xC800;&#xAC00; &#xACE0;&#xB97C; &#xC218; &#xC788;&#xAC8C; &#xD568;</li>
</ul>
<h3 id="3-1-2-In-Memory-Fuzzing"><a href="#3-1-2-In-Memory-Fuzzing" class="headerlink" title="3.1.2 In-Memory Fuzzing"></a>3.1.2 In-Memory Fuzzing</h3><p>&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD06C;&#xAE30;&#xAC00; &#xD06C;&#xBA74; &#xC624;&#xBC84;&#xD574;&#xB4DC;&#xB3C4; &#xD06C;&#xACA0;&#xC8E0;? &#xB9E4;&#xBC88; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; re-spawning&#xD558;&#xC9C0; &#xC54A;&#xACE0; PUT&#xC758; &#xC77C;&#xBD80;&#xB9CC; &#xD37C;&#xC9D5; &#xD574; &#xC624;&#xBC84;&#xD574;&#xB4DC; &#xCD5C;&#xC18C;&#xD654;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD2B9;&#xD788; GUI &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB4E4; &#xAC19;&#xC740; &#xACBD;&#xC6B0; initializing&#xC774; &#xC815;&#xB9D0; &#xC624;&#xB798; &#xAC78;&#xB9AC;&#xB294;&#xB370;, &#xADF8;&#xB798;&#xC11C; initialization &#xC791;&#xC5C5;&#xC774; &#xB05D;&#xB09C; &#xC2DC;&#xC810;&#xC758; &#xBA54;&#xBAA8;&#xB9AC; &#xC2A4;&#xB0C5;&#xC0F7;&#xC744; &#xCC0D;&#xC5B4;&#xB193;&#xACE0; &#xBCF5;&#xAD6C;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xAE30;&#xC220;&#xC744; in-memory fuzzing&#xC774;&#xB77C; &#xBD80;&#xB974;&#xACE0; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84; &#xAC04;&#xC758; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xC774; &#xB9CE;&#xC740; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC744; &#xD37C;&#xC9D5; &#xD560; &#xB54C; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>GRR&#xC740; input byte&#xB97C; &#xB85C;&#xB4DC;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xC2A4;&#xB0C5;&#xC0F7;&#xC744; &#xCC0D;&#xC5B4; &#xB9E4; iteration&#xB9C8;&#xB2E4; &#xBD88;&#xD544;&#xC694;&#xD55C; &#xCD08;&#xAE30; &#xC2E4;&#xD589; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xAC74;&#xB108;&#xB701;&#xB2C8;&#xB2E4;.</p>
<p>AFL&#xC740; fork server&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xBA87; &#xAC00;&#xC9C0; &#xC2A4;&#xD0C0;&#xD2B8;&#xC5C5; &#xCF54;&#xB4DC;&#xB97C; &#xAC74;&#xB108;&#xB6F0;&#xB294; &#xBC29;&#xC2DD;&#xC744; &#xC120;&#xD0DD;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. In-memory fuzzing&#xACFC; &#xBE44;&#xC2B7; &#xD558;&#xC9C0;&#xB9CC; &#xC2A4;&#xB0C5;&#xC0F7;&#xC744; &#xCC0D;&#xB294; &#xB300;&#xC2E0; iteration &#xB9C8;&#xB2E4; &#xC0C8;&#xB85C;&#xC6B4; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; fork &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>PUT&#xC758; &#xC0C1;&#xD0DC;&#xB97C; &#xC6D0;&#xC0C1;&#xBCF5;&#xAD6C; &#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA74;&#xC11C; &#xD2B9;&#xC815; &#xD568;&#xC218;&#xC5D0; &#xB300;&#xD55C; in-memory fuzzing&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. In-memory API fuzzing&#xC774;&#xB77C;&#xACE0; &#xD558;&#xB294;&#xB370; AFL&#xC758; persistence mode&#xAC00; &#xC774;&#xC5D0; &#xD574;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;. PUT&#xC758; &#xC0C1;&#xD0DC;&#xB97C; &#xC6D0;&#xC0C1; &#xBCF5;&#xAD6C;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xD2B9;&#xC815; &#xD568;&#xC218;&#xB97C; &#xB8E8;&#xD504;&#xB97C; &#xD1B5;&#xD574; &#xBC18;&#xBCF5; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. Winnie &#xC5F0;&#xAD6C;&#xAE00;&#xC5D0;&#xC11C; &#xC9E7;&#xAC8C; &#xC5B8;&#xAE09;&#xD588;&#xB4EF;&#xC774; &#xC774;&#xB7F0; persistence mode&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; global state&#xB97C; &#xC11C;&#xC11C;&#xD788; &#xC624;&#xC5FC;&#xC2DC;&#xCF1C; false positive &#xACB0;&#xACFC;&#xAC00; &#xB098;&#xC62C; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xBB38;&#xC81C;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; in-memory API fuzzing&#xC744; &#xD560; &#xB550; entry-point&#xAC00; &#xB420; &#xD568;&#xC218;&#xB97C; &#xC9C0;&#xC815;&#xD558;&#xB294;&#xB370; &#xB4DC;&#xB294; &#xB178;&#xB825;&#xC774; &#xC0C1;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="3-1-3-Thread-Scheduling"><a href="#3-1-3-Thread-Scheduling" class="headerlink" title="3.1.3 Thread Scheduling"></a>3.1.3 Thread Scheduling</h3><p>Race condition &#xBC84;&#xADF8;&#xB4E4;&#xC740; non-deterministic behavior(&#xBE44;&#xACB0;&#xC815;&#xB860;&#xC801; &#xD589;&#xB3D9;: &#xAC19;&#xC740; &#xC778;&#xD48B;&#xC744; &#xBC1B;&#xACE0;&#xB3C4; &#xB2E4;&#xB978; &#xD589;&#xB3D9;&#xC744; &#xBCF4;&#xC784;)&#xC5D0; &#xC758;&#xC874;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xC544; &#xD2B8;&#xB9AC;&#xAC70; &#xD558;&#xAE30; &#xAE4C;&#xB2E4;&#xB86D;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; instrumentation&#xC744; &#xC774;&#xC6A9;&#xD574; &#xC4F0;&#xB798;&#xB4DC; &#xCC98;&#xB9AC; &#xC21C;&#xC11C;&#xB97C; &#xC815;&#xD558;&#xBA74;(Thread scheduling) &#xD2B9;&#xC815; &#xBE44;&#xACB0;&#xC815;&#xB860;&#xC801; &#xD589;&#xB3D9;&#xC744; &#xD2B8;&#xB9AC;&#xAC70;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="3-2-Seed-selection"><a href="#3-2-Seed-selection" class="headerlink" title="3.2 Seed selection"></a>3.2 Seed selection</h2><p><img src="/2021/10/03/fabu1ous/fuzz-2/5.png" srcset="/img/loading.gif" alt></p>
<p>&#xD37C;&#xC800;&#xB294; fuzz configuration &#xC9D1;&#xD569;&#xC744; &#xBC1B;&#xC544; fuzzing algorithm&#xC758; &#xD589;&#xB3D9;&#xC744; &#xC81C;&#xC5B4;&#xD569;&#xB2C8;&#xB2E4;. &#xBB38;&#xC81C;&#xB294; fuzz configuration&#xC758; &#xBA87;&#xBA87; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB4E4; value domain(&#xC815;&#xC758;&#xC5ED;)&#xC774; &#xB108;&#xBB34; &#xBC29;&#xB300;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; mutation-based fuzzer&#xC758; seed&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. mp3&#xD30C;&#xC77C;&#xC744; &#xC2DC;&#xB4DC;&#xB85C; &#xD37C;&#xC9D5; &#xD55C;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD574;&#xBCF4;&#xBA74; &#x201C;&#xC815;&#xC0C1;&#xC801;&#xC778; mp3&#xD30C;&#xC77C;&#x201D;&#xC758; &#xBC94;&#xC704;&#xB294; &#xBB34;&#xD55C;&#xD569;&#xB2C8;&#xB2E4;. &#xC138;&#xC0C1;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xB178;&#xB798;&#xC640; &#xC55E;&#xC73C;&#xB85C; &#xB098;&#xC62C; &#xB178;&#xB798; &#xBAA8;&#xB450; &#xC815;&#xC0C1;&#xC801;&#xC778; mp3&#xD30C;&#xC77C;&#xC758; &#xBC94;&#xC8FC;&#xC548;&#xC5D0; &#xB4E4;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774; &#xC911;&#xC5D0;&#xC11C; &#xC5B4;&#xB5A4; &#xC2DC;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC57C; &#xD558;&#xB294; &#xAC78;&#xAE4C;&#xC694;?</p>
<p>&#xCD08;&#xAE30; seed pool&#xC758; &#xD06C;&#xAE30; &#xCD95;&#xC18C; &#xBB38;&#xC81C;&#xB97C; seed selection problem&#xC774;&#xB77C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xC811;&#xADFC;&#xBC95;&#xC774; &#xC788;&#xC9C0;&#xB9CC; &#xAC00;&#xC7A5; &#xD754;&#xD788; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBC29;&#xBC95;&#xC740; minset(&#xCD5C;&#xB300; coverage metric&#xC744; &#xAC16;&#xB294; &#xCD5C;&#xC18C; seed &#xC9D1;&#xD569;)&#xC744; &#xACC4;&#xC0B0;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC801;&#xC740; &#xC2E4;&#xD589; &#xC2DC;&#xAC04; &#xBE44;&#xC6A9;&#xC73C;&#xB85C; &#xB9CE;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xB85C;&#xC9C1;&#xC744; &#xD14C;&#xC2A4;&#xD2B8;&#xD574;&#xC57C; &#xBC84;&#xADF8; &#xBC1C;&#xACAC;&#xC728;&#xC744; &#xC99D;&#xAC00;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xACA0;&#xC8E0;?</p>
<p>seed selection&#xC740; Preprocess &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; ConfUPDATE &#xB2E8;&#xACC4;&#xC5D0;&#xC11C;&#xB3C4; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC591;&#xD55C; coverage metic&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xB370;, &#xBA3C;&#xC800; AFL&#xC740; &#xAC01; branch&#xC758; logarithmic counter(&#xC9C0;&#xC218; &#xCE74;&#xC6B4;&#xD130;)&#xB97C; &#xC774;&#xC6A9;&#xD55C; branch coverage &#xAE30;&#xBC18; &#xD37C;&#xC800;&#xC785;&#xB2C8;&#xB2E4;. branch counter&#xC758; &#xD06C;&#xAE30; &#xC815;&#xB3C4;(&#xC0C1;&#xC6A9;&#xB85C;&#xADF8;&#xC758; &#xCC99;&#xB3C4;: &#xADFC;&#xC0AC;&#xAC12;&#xC758; &#xD06C;&#xAE30; &#xB4F1;&#xAE09;)&#xAC00; &#xB2EC;&#xB77C;&#xC57C; &#xB2E4;&#xB978; branch count&#xB85C; &#xCDE8;&#xAE09;&#xD558;&#xB3C4;&#xB85D; &#xAD6C;&#xD604;&#xB418;&#xC5B4;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>HonggFuzz&#xB294; &#xC2E4;&#xD589;&#xB41C; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC758; &#xAC1C;&#xC218;, &#xC2E4;&#xD589;&#xB41C; branch &#xAC1C;&#xC218;, &#xC2E4;&#xD589;&#xB41C; unique basic block &#xAC1C;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; coverage&#xB97C; &#xACC4;&#xC0B0;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="3-3-Seed-Trimming"><a href="#3-3-Seed-Trimming" class="headerlink" title="3.3 Seed Trimming"></a>3.3 Seed Trimming</h2><p>&#xD06C;&#xAE30;&#xAC00; &#xC791;&#xC740; seed&#xC77C;&#xC218;&#xB85D; &#xBA54;&#xBAA8;&#xB9AC; &#xC18C;&#xBAA8;&#xB7C9;&#xC774; &#xC801;&#xACE0;, &#xB192;&#xC740; &#xCC98;&#xB9AC;&#xB7C9;(throughput)&#xC744; &#xAC16;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xBA87;&#xBA87; &#xD37C;&#xC800;&#xB4E4;&#xC740; &#xD37C;&#xC9D5; &#xC804;&#xC5D0; seed&#xC758; &#xD06C;&#xAE30;&#xB97C; &#xC904;&#xC774;&#xB294; seed trimming &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. Seed trimming&#xC740; Preprocess&#xB098; ConfUPDATE &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC218;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>AFL&#xC758; &#xACBD;&#xC6B0; seed&#xAC00; &#xB3D9;&#xC77C;&#xD55C; coverage&#xB97C; &#xAC16;&#xB294; &#xBC94;&#xC704;&#xC5D0;&#xC11C; &#xC11C;&#xC11C;&#xD788; seed&#xC758; &#xC77C;&#xBD80;&#xB97C; &#xC0AD;&#xC81C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Linux system call handler&#xB97C; &#xD37C;&#xC9D5; &#xD560; &#xB54C;&#xB294; static &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xC54C;&#xC544;&#xB0B8; call dependency&#xAC00; &#xB2EC;&#xB77C;&#xC9C0;&#xC9C0; &#xC54A;&#xB294; &#xC120;&#xC5D0;&#xC11C; seed&#xC758; &#xD06C;&#xAE30;&#xB97C; &#xC904;&#xC774;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="3-4-Preparing-a-Driver-Application"><a href="#3-4-Preparing-a-Driver-Application" class="headerlink" title="3.4 Preparing a Driver Application"></a>3.4 Preparing a Driver Application</h2><p>PUT&#xC744; &#xC9C1;&#xC811; &#xD37C;&#xC9D5; &#xD558;&#xB294; &#xAC83;&#xC774; &#xC5B4;&#xB824;&#xC6B4; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; PUT&#xC774; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC77C; &#xB54C;, &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xC18D; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD574;&#xC8FC;&#xB294; &#xC911;&#xAC04;&#xB2E4;&#xB9AC; &#xC5ED;&#xD560;&#xC758; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; driver &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774;&#xB77C; &#xBD80;&#xB974;&#xB294;&#xB370;, &#xD754;&#xD788; driver&#xB77C;&#xACE0; &#xB9D0;&#xD560; &#xB54C; &#xB5A0;&#xC62C;&#xB9AC;&#xB294; device driver&#xC640;&#xB294; &#xB2E4;&#xB978; &#xAC1C;&#xB150;&#xC785;&#xB2C8;&#xB2E4;. fuzz campaign &#xC2DC;&#xC791; &#xC804;&#xC5D0; &#xD55C; &#xBC88;&#xB9CC; &#xB9CC;&#xB4E4;&#xBA74; &#xB418;&#xAE34; &#xD558;&#xC9C0;&#xB9CC; &#xC0C1;&#xB2F9;&#xD788; &#xBC88;&#xAC70;&#xB85C;&#xC6B4; &#xC791;&#xC5C5;&#xC785;&#xB2C8;&#xB2E4;. &#xC81C;&#xAC00; &#xC791;&#xC131;&#xD55C; WinAFL &#xC5F0;&#xAD6C;&#xAE00;&#xC5D0;&#xC11C; &#xC5BC;&#xB9C8;&#xB098; &#xADC0;&#xCC2E;&#xC740; &#xC791;&#xC5C5;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xD558; &#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBE44;&#xC2B7;&#xD558;&#xAC8C; &#xCEE4;&#xB110;&#xC744; &#xD37C;&#xC9D5; &#xD558;&#xAE30; &#xC704;&#xD574; &#xC720;&#xC800; &#xB79C;&#xB4DC; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC744; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xAC70;&#xB098; IoT &#xC7A5;&#xBE44;&#xB97C; &#xD37C;&#xC9D5; &#xD558;&#xAE30; &#xC704;&#xD574; &#xC2A4;&#xB9C8;&#xD2B8;&#xD3F0; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xB4F1;&#xC774; driver application&#xC758; &#xC608;&#xC2DC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Harness &#xB610;&#xD55C; Driver&#xC758; &#xAC1C;&#xB150; &#xC548;&#xC5D0; &#xC18D;&#xD574;&#xC788;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xC2DC;&#xBA74; &#xB418;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="4-Scheduling"><a href="#4-Scheduling" class="headerlink" title="4. Scheduling"></a>4. Scheduling</h1><pre><code class="hljs livescript">Schedule<span class="hljs-function"><span class="hljs-params">(C, t_elapsed, t_limit)</span> -&gt;</span> conf</code></pre>
<p>&#xC2A4;&#xCF00;&#xC974;&#xB9C1;&#xC740; &#xB2E4;&#xC74C; iteration&#xC5D0; &#xC801;&#xC6A9;&#xD560; fuzz configuration&#xC744; &#xC815;&#xD558;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;. &#xB2F9;&#xC5F0;&#xD788; &#xD37C;&#xC800;&#xC758; &#xC885;&#xB958;&#xC5D0; &#xB530;&#xB77C; configuration&#xC758; &#xB0B4;&#xC6A9;&#xC774; &#xB2EC;&#xB77C;&#xC9D1;&#xB2C8;&#xB2E4;. &#xD558;&#xB098;&#xC758; configuration&#xB9CC;&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xC2A4;&#xCF00;&#xC974;&#xB9C1; &#xB2E8;&#xACC4;&#xAC00; &#xC5C6;&#xB294; &#xD37C;&#xC800;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC; BFF&#xB098; AFLFast&#xCC98;&#xB7FC; &#xC798; &#xC9DC;&#xC5EC;&#xC9C4; &#xC2A4;&#xCF00;&#xC974;&#xB9C1;&#xC73C;&#xB85C; &#xC131;&#xACF5;&#xD55C; &#xC0AC;&#xB840;&#xB3C4; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC8FC;&#xBAA9;&#xD574; &#xBCFC; &#xD544;&#xC694;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>white-box&#xC758; &#xACBD;&#xC6B0; symbolic executor &#xB4F1; &#xBCF5;&#xC7A1;&#xD55C; &#xB0B4;&#xC6A9;&#xC774; &#xB9CE;&#xC544; &#xC0DD;&#xB7B5;&#xD558;&#xACE0; black-box&#xC640; grey-box &#xD37C;&#xC800;&#xC758; Scheduling &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xB9CC;&#xC744; &#xB2E4;&#xB8F9;&#xB2C8;&#xB2E4;.</p>
<h2 id="4-1-Fuzz-Configuration-Scheduling-FCS-Problem"><a href="#4-1-Fuzz-Configuration-Scheduling-FCS-Problem" class="headerlink" title="4.1 Fuzz Configuration Scheduling (FCS) Problem"></a>4.1 Fuzz Configuration Scheduling (FCS) Problem</h2><p><img src="/2021/10/03/fabu1ous/fuzz-2/6.png" srcset="/img/loading.gif" alt></p>
<p>&#xC2A4;&#xCF00;&#xC974;&#xB9C1;&#xC758; &#xBAA9;&#xC801;&#xC740; &#xD604;&#xC7AC; &#xC774;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xC815;&#xBCF4;&#xB4E4;&#xC744; &#xD1B5;&#xD574; &#xCD5C;&#xC120;&#xC758; &#xACB0;&#xACFC;&#xB97C; &#xB0BC; &#xC218; &#xC788;&#xB294; configuration&#xC744; &#xC815;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; unique &#xBC84;&#xADF8;&#xB97C; &#xAC00;&#xC7A5; &#xB9CE;&#xC774; &#xCC3E;&#xAC70;&#xB098;, &#xAC00;&#xC7A5; &#xB113;&#xC740; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB97C; &#xAC00;&#xC9C8; &#xAC83;&#xC73C;&#xB85C; &#xC608;&#xC0C1;&#xB418;&#xB294; configuration&#xC744; &#xC120;&#xD0DD;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; &#xBAA8;&#xB4E0; &#xC2A4;&#xCF00;&#xC974;&#xB9C1; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC740; Exploration(&#xD0D0;&#xC0C9;)&#xACFC; Exploitation(&#xD65C;&#xC6A9;) &#xC0AC;&#xC774;&#xC5D0;&#xC11C; &#xAC08;&#xB4F1;&#xD569;&#xB2C8;&#xB2E4;.(Exploration vs Exploitation trade off)</p>
<ul>
<li>exploration : &#xBBF8;&#xB798;&#xB97C; &#xC704;&#xD574; &#xCD5C;&#xB300;&#xD55C; &#xB9CE;&#xC740; &#xC815;&#xBCF4;&#xB97C; &#xC218;&#xC9D1;&#xD558;&#xB294; &#xBC29;&#xD5A5;&#xC73C;&#xB85C; &#xAC08; &#xAC83;&#xC774;&#xB0D0;</li>
<li>exploitation : &#xC2E4;&#xC9C1;&#xC801;&#xC778; &#xC131;&#xACFC;&#xB97C; &#xB0B4;&#xB294; &#xBC29;&#xD5A5;&#xC73C;&#xB85C; &#xAC08; &#xAC83;&#xC774;&#xB0D0;</li>
</ul>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xD37C;&#xC9D5;&#xC5D0;&#xC120; &#xC774;&#xB7F0; &#xBB38;&#xC81C;&#xB97C; Fuzz configuration Scheduling(FCS) &#xBB38;&#xC81C;&#xB77C;&#xACE0; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;.</p>
<h2 id="4-2-Black-box-FCS-Algorithms"><a href="#4-2-Black-box-FCS-Algorithms" class="headerlink" title="4.2 Black-box FCS Algorithms"></a>4.2 Black-box FCS Algorithms</h2><p>&#xBE14;&#xB799;&#xBC15;&#xC2A4;&#xC758; &#xACBD;&#xC6B0; FCS &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC774; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xC815;&#xBCF4;&#xB294; &#xC774;&#xC804; configuration&#xC758; &#xD37C;&#xC9D5; &#xACB0;&#xACFC;&#xBC16;&#xC5D0; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; &#xD06C;&#xB798;&#xC26C;&#xC640; &#xBC84;&#xADF8;&#xC758; &#xC218;, &#xC18C;&#xBAA8;&#xB41C; &#xC2DC;&#xAC04; &#xB4F1;&#xC774; &#xC788;&#xACA0;&#xC8E0;. &#xC774;&#xB7F0; &#xC815;&#xBCF4;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xCC98;&#xC74C; &#xC5F0;&#xAD6C;&#xB418;&#xACE0; &#xC801;&#xC6A9;&#xB41C; &#xAC8C; BFF&#xC785;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xC5F0;&#xAD6C;&#xAC00; &#xC801;&#xC6A9;&#xB418;&#xACE0; BFF&#xC758; &#xC131;&#xB2A5;&#xC740; (&#xC2E4;&#xD589;&#xB2F9; &#xBC84;&#xADF8;&#xC218;)&#xAC00; 85% &#xC99D;&#xAC00;&#xD588;&#xACE0; &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xC798; &#xC9DC;&#xC5EC;&#xC9C4; FCS &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC758; &#xC911;&#xC694;&#xC131;&#xC774; &#xC8FC;&#xBAA9;&#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xACE7;&#xBC14;&#xB85C; &#xD6C4;&#xC18D; &#xC5F0;&#xAD6C;&#xB4E4;&#xC774; &#xB098;&#xC654;&#xB294;&#xB370;, &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xC544;&#xC774;&#xC774;&#xC5B4;&#xB85C; FCS &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xAC1C;&#xC120;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li><p>&#xBE14;&#xB799;&#xBC15;&#xC2A4; &#xBBA4;&#xD14C;&#xC774;&#xC158; &#xD37C;&#xC9D5;&#xC758; &#xC218;&#xD559;&#xC801; &#xBAA8;&#xB378;&#xC744; &#xAE30;&#xC874;&#xC5D0; &#xC0AC;&#xC6A9;&#xD558;&#xB358; Bernoulli trial(&#xBCA0;&#xB974;&#xB204;&#xC774; &#xC2E4;&#xD589;)&#xC5D0;&#xC11C; WCCP/UW(Weighted Coupon Collector&#x2019;s Problem with Unknown Weights)&#xC73C;&#xB85C; &#xBC14;&#xAFC8;</p>
<p><img src="/2021/10/03/fabu1ous/fuzz-2/7.png" srcset="/img/loading.gif" alt></p>
<ul>
<li><p>&#xBCA0;&#xB974;&#xB204;&#xC774; &#xC2DC;&#xD589;</p>
<ul>
<li>&#xB3D9;&#xC804; &#xB358;&#xC9C0;&#xAE30;&#xB97C; &#xC0DD;&#xAC01;&#xD558;&#xBA74; &#xB428;</li>
<li>&#xC131;&#xACF5;, &#xC2E4;&#xD328; &#xB458; &#xC911; &#xD558;&#xB098;&#xC758; &#xACB0;&#xACFC;&#xB9CC; &#xC874;&#xC7AC;</li>
<li>&#xAC01; configuration&#xC740; &#xACE0;&#xC815;&#xB41C; &#xC131;&#xACF5;&#xB960;&#xC774; &#xC788;&#xB2E4;&#xACE0; &#xAC00;&#xC815;</li>
</ul>
</li>
<li><p>&#xCFE0;&#xD3F0; &#xC218;&#xC9D1; &#xBB38;&#xC81C;</p>
<ul>
<li>&#xD3EC;&#xCF13;&#xBAAC; &#xBE75;&#xC744; &#xC0AC;&#xBA74; 255&#xB9C8;&#xB9AC;&#xC758; &#xD3EC;&#xCF13;&#xBAAC;&#xC911; &#xD558;&#xB098;&#xC758; &#xC2A4;&#xD2F0;&#xCEE4;&#xB97C; &#xC5BB;&#xC74C;.</li>
<li>255&#xB9C8;&#xB9AC; &#xD3EC;&#xCF13;&#xBAAC; &#xC2A4;&#xD2F0;&#xCEE4;&#xB97C; &#xBAA8;&#xB450; &#xC218;&#xC9D1;&#xD558;&#xAE30; &#xC704;&#xD574; &#xBA87; &#xAC1C;&#xC758; &#xBE75;&#xC744; &#xBA39;&#xC5B4;&#xC57C; &#xD558;&#xB294;&#xAC00;? &#xC640; &#xAC19;&#xC740; &#xC9C8;&#xBB38;&#xC5D0;&#xC11C; &#xC2DC;&#xC791;&#xB41C; &#xBB38;&#xC81C;</li>
<li>&#xD37C;&#xC9D5; &#xD558;&#xBA74;&#xC11C; &#xC9C0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xC131;&#xACF5;&#xB960;&#xC758; &#xCD5C;&#xB300; &#xBC94;&#xC704;(upper-bound)&#xAC00; &#xBCC0;&#xD568;</li>
</ul>
</li>
</ul>
</li>
</ol>
<ol>
<li><p>&#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC774; Multi-Armed Banbit(MAB) &#xBB38;&#xC81C;&#xB97C; &#xC870;&#xC0AC;(investigate)&#xD568;</p>
<p><img src="/2021/10/03/fabu1ous/fuzz-2/8.png" srcset="/img/loading.gif" alt></p>
<p>&#xD314;&#xC774; &#xC5EC;&#xB7EC; &#xAC1C; &#xB2EC;&#xB9B0; &#xAC15;&#xB3C4; &#xBB38;&#xC81C;(MAB)&#xB294; decison science&#xC5D0;&#xC11C; exploration vs exploitation &#xBB38;&#xC81C;&#xB97C; &#xC124;&#xBA85;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;. &#xC5EC;&#xB7EC; &#xAC1C;&#xC758; &#xC2AC;&#xB86F;&#xBA38;&#xC2E0;&#xC744; &#xC81C;&#xD55C;&#xB41C; &#xC2DC;&#xAC04; &#xB3D9;&#xC548;&#xB9CC; &#xD50C;&#xB808;&#xC774;&#xD560; &#xC218; &#xC788;&#xACE0;, &#xD55C; &#xBC88;&#xC5D0; &#xD55C;&#xAC1C;&#xC758; &#xC2AC;&#xB86F;&#xBA38;&#xC2E0;&#xB9CC;&#xC744; &#xC791;&#xB3D9;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC73C;&#xBA70;(&#xADF8;&#xB7FC; &#xAD73;&#xC774; &#xD314;&#xC774; &#xC5EC;&#xB7EC; &#xAC1C; &#xB2EC;&#xB824;&#xC788;&#xC744; &#xD544;&#xC694;&#xAC00; &#xC788;&#xB098;?) &#xAC01; &#xC2AC;&#xB86F;&#xBA38;&#xC2E0;&#xB9C8;&#xB2E4; &#xBCF4;&#xC0C1;&#xC774; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB54C; &#xAC15;&#xB3C4;&#xAC00; &#xCDE8;&#xD560; &#xC218; &#xC788;&#xB294; &#xC120;&#xD0DD;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xBCF4;&#xC0C1;&#xC744; &#xC54C;&#xACE0; &#xC788;&#xB294; &#xC2AC;&#xB86F;&#xBA38;&#xC2E0;&#xC744; &#xB2F9;&#xAE34;&#xB2E4;.</li>
<li>&#xB2E4;&#xB978; &#xC2AC;&#xB86F;&#xBA38;&#xC2E0;&#xC758; &#xBCF4;&#xC0C1;&#xC744; &#xD655;&#xC778;&#xD55C;&#xB2E4;.</li>
</ul>
<p>&#xAC15;&#xB3C4;&#xAC00; &#xC81C;&#xD55C;&#xB41C; &#xC2DC;&#xAC04; &#xB3D9;&#xC548; &#xCD5C;&#xB300; &#xC218;&#xC775;&#xC744; &#xB0B4;&#xAE30; &#xC704;&#xD574; &#xC5B4;&#xB5A4; &#xC21C;&#xC11C;&#xB85C; &#xC5B4;&#xB5A4; &#xADDC;&#xCE59;&#xC73C;&#xB85C; &#xC2AC;&#xB86F;&#xBA38;&#xC2E0;&#xC758; &#xB808;&#xBC84;&#xB97C; &#xB2F9;&#xACA8;&#xC57C; &#xD558;&#xB294;&#xAC00;?</p>
</li>
</ol>
<ol>
<li>&#xB2E4;&#xB978; &#xC870;&#xAC74;&#xC774; &#xBAA8;&#xB450; &#xB3D9;&#xC77C;&#xD560; &#xB54C; &#xD37C;&#xC9D5; &#xC18D;&#xB3C4;&#xAC00; &#xBE60;&#xB978; configuration&#xC774; unique bug&#xB97C; &#xB354; &#xB9CE;&#xC774; &#xC218;&#xC9D1;&#xD558;&#xACE0;, &#xBBF8;&#xB798;&#xC758; &#xC131;&#xACF5;&#xB960;&#xC5D0; &#xB300;&#xD55C; upper-bound&#xB97C; &#xC904;&#xC774;&#xB294;&#xB370; &#xC88B;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC744; &#xC81C;&#xC2DC;&#xD568;</li>
</ol>
<ol>
<li>&#xD55C; &#xBC88;&#xC758; configuration selection &#xB9C8;&#xB2E4; &#xACE0;&#xC815;&#xB41C; iteration &#xD69F;&#xC218;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xB300;&#xC2E0; &#xC81C;&#xD55C;&#xB41C; &#xC2DC;&#xAC04; &#xB3D9;&#xC548; &#xAC00;&#xB2A5;&#xD55C; &#xB9CC;&#xD07C; iteration&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB3C4;&#xB85D; BFF&#xB97C; &#xBC14;&#xAFD4; &#xB290;&#xB9B0; configuration&#xC5D0; &#xC2DC;&#xAC04; &#xB0AD;&#xBE44;&#xB97C; &#xBC29;&#xC9C0;&#xD568;</li>
</ol>
<p>&#xC704; &#xC5F0;&#xAD6C;&#xB97C; &#xD1B5;&#xD574; &#xAE30;&#xC874; BFF&#xC5D0; &#xBE44;&#xD574; &#xB3D9;&#xC77C;&#xD55C; &#xC2DC;&#xAC04; &#xB3D9;&#xC548; &#xC57D; 1.5&#xBC30; &#xB9CE;&#xC740; unique bug&#xB97C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xAC8C; &#xB428;</p>
<h2 id="4-3-Grey-box-FCS-Algorithms"><a href="#4-3-Grey-box-FCS-Algorithms" class="headerlink" title="4.3 Grey-box FCS Algorithms"></a>4.3 Grey-box FCS Algorithms</h2><p>Code coverage &#xB4F1; Grey-box&#xC758; FCS &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC740; black-box&#xC5D0; &#xBE44;&#xD574; &#xC0AC;&#xC6A9;&#xD560; &#xC815;&#xBCF4;&#xC758; &#xC120;&#xD0DD; &#xD3ED;&#xC774; &#xB113;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC9C4;&#xD654; &#xC54C;&#xACE0;&#xB9AC;&#xC998;(Evolution Algorithm)&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; AFL&#xC774; grey-box FCS &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC758; &#xC120;&#xB450;&#xC8FC;&#xC790;&#xC785;&#xB2C8;&#xB2E4;. &#xAC01; configuration&#xB9C8;&#xB2E4; <code>fitness</code>&#xB77C;&#xB294; &#xAC12;&#xC744; &#xAC16;&#xACE0;, &#xC9C4;&#xD654; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC774; &#xC801;&#xC808;&#xD55C; configuartion&#xC744; generic transformation(mutation, recombination)&#xD574;&#xC11C; &#xC790;&#xC2DD;&#xC744; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB807;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; &#xC790;&#xC2DD;&#xB4E4; &#xC911; &#xBD80;&#xBAA8;&#xBCF4;&#xB2E4; fit &#xD55C; &#xB188;&#xC774; &#xC788;&#xC744; &#xAC70;&#xB2E4;&#xB77C;&#xB294; &#xAC00;&#xC815;&#xD558;&#xC5D0; &#xC9C4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC9C4;&#xD654; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC758; &#xAC1C;&#xB150;&#xC73C;&#xB85C; FCS&#xB97C; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC120; &#xC544;&#xB798; &#xC9C8;&#xBB38;&#xB4E4;&#xC744; &#xB2F5;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>configuration&#xC774; fit &#xD55C; &#xAE30;&#xC900;&#xC774; &#xBB54;&#xAC00;</li>
<li>configuration&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xC120;&#xD0DD;&#xD558;&#xB098;</li>
<li>&#xC120;&#xD0DD;&#xD55C; configuration&#xC73C;&#xB85C; &#xBB34;&#xC5BC; &#xD558;&#xB098;</li>
</ol>
<p>high-level&#xC5D0;&#xC11C; &#xC608;&#xC0C1;&#xD574;&#xBCF4;&#xBA74; &#xBE60;&#xB974;&#xACE0; &#xC791;&#xC740; input&#xC744; fit &#xD558;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. AFL&#xC740; configuration&#xB4E4;&#xC744; &#xC6D0;&#xD615; queue&#xB85C; &#xAD00;&#xB9AC;&#xD558;&#xBA70; &#xB2E4;&#xC74C;&#xC73C;&#xB85C; fit &#xD55C; configuration&#xC744; &#xAC00;&#xC838;&#xC640;&#xC11C; &#xACE0;&#xC815;&#xB41C; &#xD69F;&#xC218;&#xB9CC;&#xD07C; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xBE60;&#xB978; configuration&#xC744; &#xC120;&#xD638;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC740; black-box FCS&#xC640; &#xB3D9;&#xC77C;&#xD55C; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>AFLFast&#xB294; &#xC544;&#xB798; &#xC138; &#xAC00;&#xC9C0; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB97C; &#xD1B5;&#xD574; &#xB9CC;&#xB4E4;&#xC5B4;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xC120;&#xD638;&#xD558;&#xB294; input (Favroite input)<ul>
<li>&#xD2B9;&#xC815; control flow edge&#xB97C; &#xC218;&#xD589;&#xD558;&#xB294; configuration &#xC911; AFLFast&#xB294; &#xC120;&#xD0DD;&#xC744; &#xAC00;&#xC7A5; &#xC801;&#xAC8C; &#xBC1B;&#xC740; configuration&#xC744; &#xC120;&#xD638;&#xD574; exploration &#xC99D;&#xAC00;</li>
<li>&#xC120;&#xD0DD;&#xBC1B;&#xC740; &#xD69F;&#xC218;&#xAC00; &#xAC19;&#xC740; configuration&#xB4E4;&#xC774; &#xC788;&#xB2E4;&#xBA74; &#xAC00;&#xC7A5; &#xC801;&#xAC8C; &#xC2E4;&#xD589;&#xB41C; path&#xB97C; &#xAC16;&#xB294; configuration &#xC120;&#xD638;&#xD574; &#xD76C;&#xADC0; path&#xC758; &#xD0D0;&#xC0C9;&#xC5D0; &#xB300;&#xD55C; exploration &#xC99D;&#xAC00;</li>
</ul>
</li>
<li>round-robin &#xC120;&#xD0DD; &#xBC29;&#xC2DD;&#xC744; &#xBC84;&#xB9AC;&#xACE0; fit configuration&#xC758; &#xC6B0;&#xC120;&#xC21C;&#xC704;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xB2E4;&#xC74C; configuration&#xC744; &#xC120;&#xD0DD;</li>
<li>power schedule&#xC5D0; &#xC758;&#xD574; &#xC815;&#xD574;&#xC9C4; &#xD69F;&#xC218;&#xB9CC;&#xD07C; &#xC120;&#xD0DD;&#xB41C; configuration&#xC744; &#xC2E4;&#xD589;<ul>
<li>&#xCC98;&#xC74C;&#xC5D4; &#xC791;&#xC740; &#xAC12;&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD574;&#xC11C; &#xC810;&#xC810; &#xBE60;&#xB974;&#xACE0; &#xD070; &#xD3ED;&#xC73C;&#xB85C; &#xC0C1;&#xC2B9;&#xD558;&#xB294; <code>energy</code>&#xAC12;&#xC744; &#xC0AC;&#xC6A9;</li>
<li>path&#xB97C; &#xD0D0;&#xC0C9;&#xD558;&#xB294; input&#xC758; &#xC218;&#xB97C; <code>energy</code> &#xAC12;&#xC73C;&#xB85C; &#xC815;&#xADDC;&#xD654;&#xD574;&#xC11C; &#xC801;&#xAC8C; &#xD37C;&#xC9D5; &#xB41C; configuration&#xC774; &#xC120;&#xD0DD;&#xB418;&#xB3C4;&#xB85D; &#xC7A5;&#xB824;</li>
</ul>
</li>
</ol>
<p>24&#xC2DC;&#xAC04; &#xD37C;&#xC9D5; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xD574;&#xBCF8; &#xACB0;&#xACFC; AFLFast&#xB294; AFL&#xC774; &#xCC3E;&#xC9C0; &#xBABB;&#xD55C; &#xBC84;&#xADF8; 3&#xAC1C;&#xB97C; &#xCC3E;&#xC558;&#xC73C;&#xBA70;, AFL&#xACFC; AFLFast &#xB458;&#xB2E4; &#xCC3E;&#xC740; &#xBC84;&#xADF8;&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; AFLFast&#xAC00; &#xC57D; 7&#xBC30;&#xC815;&#xB3C4; &#xB354; &#xBE60;&#xB974;&#xAC8C; &#xCC3E;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xB2E4;&#xC74C;-&#xD30C;&#xD2B8;-&#xC608;&#xACE0;"><a href="#&#xB2E4;&#xC74C;-&#xD30C;&#xD2B8;-&#xC608;&#xACE0;" class="headerlink" title="&#xB2E4;&#xC74C; &#xD30C;&#xD2B8; &#xC608;&#xACE0;"></a>&#xB2E4;&#xC74C; &#xD30C;&#xD2B8; &#xC608;&#xACE0;</h1><p><img src="/2021/10/03/fabu1ous/fuzz-2/9.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xBC88; &#xD30C;&#xD2B8;&#xC5D0;&#xC120; &#xD37C;&#xC9D5; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC758; &#xC5EC;&#xC12F; &#xB2E8;&#xACC4; &#xC911; &#xCCAB; &#xB450; &#xB2E8;&#xACC4;&#xC778; Preprocess&#xC640; Scheduling&#xB97C; &#xC54C;&#xC544;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xC9C1; &#xAC08; &#xAE38;&#xC774; &#xD55C;&#xCC38; &#xB0A8;&#xC558;&#xC9C0;&#xB9CC; &#xC5EC;&#xAE30;&#xC11C; &#xC7A0;&#xC2DC; &#xC26C;&#xC5C8;&#xB2E4;&#xAC00; &#xAC11;&#xC2DC;&#xB2E4;. &#xB2E4;&#xC74C;&#xC5D4; Input Generation&#xACFC; Input Evaluation&#xC744; &#xC54C;&#xC544;&#xC624;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/fuzzing/">fuzzing</a>
                  
                  <a class="hover-with-bg" href="/tags/Fabu1ous/">Fabu1ous</a>
                  
                  <a class="hover-with-bg" href="/tags/fuzzer/">fuzzer</a>
                  
                  <a class="hover-with-bg" href="/tags/servey/">servey</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_Fabu1ous.jpg" srcset="/img/loading.gif" alt="Fabu1ous">
                  </div>

                  <div class="link-text">
                    <div class="link-title">Fabu1ous</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/Fabu1ous">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/10/05/fabu1ous/2021-10-05/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2021-1810: Gatekeeper bypass</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/10/02/j0ker/2021-10-02/">
                    <span class="hidden-mobile">[] Cisco Hyperflex: How We Got RCE Through Login Form and Other Findings</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/10/03/fabu1ous/fuzz-2/';
        this.page.identifier = '/2021/10/03/fabu1ous/fuzz-2/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research]    fuzz 101 - part2&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
