

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image1.jpg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. &amp;#xC624;&amp;#xB298;&amp;#xB3C4; &amp;#xC5B4;&amp;#xB514;&amp;#xC11C;&amp;#xC778;&amp;#xAC00; &amp;#xB3CC;&amp;#xC544;&amp;#xC628; banda&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCF54;&amp;#xB4DC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC911;&amp;#xC5D0; VMProtect, Themida&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774; &amp;#xC911; VMProtect&amp;#xB294; &amp;#xD2B9;&amp;#xD788; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;(VM) &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;, &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C;&amp;#xB824;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. VMProtect&amp;#xB294; non-standard &amp;#xAC00;&amp;#xC0C1; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC6D0;&amp;#xBCF8; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB3C5;&amp;#xC790;&amp;#xC801;&amp;#xC778; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;, &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xD639;&amp;#xC2DC; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xC791;&amp;#xC131;&amp;#xB41C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC774; &amp;#xAD81;&amp;#xAE08;&amp;#xD558;&amp;#xB2E4;&amp;#xBA74; &lt;a href=&#34;https://hackyboiz.github.io/2025/04/28/OUYA77/Anti_part3/kr/&#34;&gt;(&amp;#x1F449;&amp;#xC5EC;&amp;#xAE30;&amp;#xB85C; &amp;#x314E;&amp;#x314E;)&lt;/a&gt;)&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xAC04; VMProtect &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xD574;&amp;#xC81C;&amp;#xB97C; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xB17C;&amp;#xBB38;&amp;#xACFC; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAC00; &amp;#xAFB8;&amp;#xC900;&amp;#xD788; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xC5B4; &amp;#xC654;&amp;#xB294;&amp;#xB370;, &amp;#xC624;&amp;#xB298; &amp;#xD544;&amp;#xC790;&amp;#xB294; &amp;#xC774;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC5F0;&amp;#xAD6C; &amp;#xC911; &amp;#xD2B9;&amp;#xD788; LLVM&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xD574;&amp;#xC81C; &amp;#xBC29;&amp;#xBC95;&amp;#xB860;&amp;#xC744; &amp;#xC911;&amp;#xC2EC;&amp;#xC73C;&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACE0;, &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xD574;&amp;#xC81C;&amp;#xAC00; &amp;#xC5B4;&amp;#xB290; &amp;#xC2E4;&amp;#xD604; &amp;#xAC00;&amp;#xB2A5;&amp;#xD560;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xB2E4;&amp;#xB9CC; &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; VMP &amp;#xBCF4;&amp;#xD638; &amp;#xC635;&amp;#xC158; &amp;#xC911; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xC635;&amp;#xC158;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xC9D1;&amp;#xC911;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB8F9;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;h1 id=&#34;VMProtect&#34;&gt;&lt;a href=&#34;#VMProtect&#34; class=&#34;headerlink&#34; title=&#34;VMProtect&#34;&gt;&lt;/a&gt;VMProtect&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;VMProtect&amp;#xB294; Anti-Reversing &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD574; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xC2DD; &amp;#xBB38;&amp;#xC11C;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xCF54;&amp;#xB4DC; &amp;#xBCF4;&amp;#xD638;&amp;#xC640; &amp;#xD06C;&amp;#xB799; &amp;#xBC29;&amp;#xC9C0;&amp;#xB97C; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xBA70;, &amp;#xC790;&amp;#xCCB4; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC640; &amp;#xB0B4;&amp;#xC7A5; &amp;#xB514;&amp;#xC2A4;&amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB7EC;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD574; &amp;#xBCF4;&amp;#xD638;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC; &amp;#xC601;&amp;#xC5ED;&amp;#xACFC; &amp;#xBE4C;&amp;#xB4DC; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC138;&amp;#xBC00;&amp;#xD558;&amp;#xAC8C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xC8FC;&amp;#xB85C; Windows &amp;#xAE30;&amp;#xBC18; &amp;#xB124;&amp;#xC774;&amp;#xD2F0;&amp;#xBE0C; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;(C/C++, Delphi, Visual Basic)&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;VMProtect 3.9.6 &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xC635;&amp;#xC158;&amp;#xC740; &amp;#x2460;Memory Protection, &amp;#x2461;Import Protection, &amp;#x2462;Resource Protection, &amp;#x2463;Pack the Output File, &amp;#x2464;Debugger Detection, &amp;#x2465;Virtualization Tools Dectection, &amp;#x2466;Virtualization&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC774; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &lt;strong&gt;Virtualization(&amp;#xAC00;&amp;#xC0C1;&amp;#xD654;)&lt;/strong&gt;&amp;#xC740; &amp;#xAC15;&amp;#xB825;&amp;#xD55C; &amp;#xBCF4;&amp;#xD638; &amp;#xAE30;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C;, &amp;#xC6D0;&amp;#xB798;&amp;#xC758; x86/x64 &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; VMProtect&amp;#xAC00; &lt;strong&gt;&amp;#xC815;&amp;#xC758;&amp;#xD55C; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&lt;/strong&gt;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD55C; &amp;#xB4A4;, &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC; &amp;#xB0B4;&amp;#xC7A5;&amp;#xB41C; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC774; &amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xC11D;&amp;#xD574; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC885;&amp;#xB958;&amp;#xC758; VM&amp;#xC774; &amp;#xD63C;&amp;#xD569;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC5D4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD574; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;VMProtect-with-LLVM&#34;&gt;&lt;a href=&#34;#VMProtect-with-LLVM&#34; class=&#34;headerlink&#34; title=&#34;VMProtect with LLVM&#34;&gt;&lt;/a&gt;VMProtect with LLVM&lt;/h1&gt;&lt;p&gt;LLVM&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; VMProtect &amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xADF8;&amp;#xB3D9;&amp;#xC548; VM&amp;#xC758; &amp;#xB0B4;&amp;#xBD80; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xC815;&amp;#xC801; &amp;#xB9AC;&amp;#xD504;&amp;#xD305;(Static Lifting)&amp;#xACFC;, &amp;#xB0B4;&amp;#xBD80; &amp;#xAD6C;&amp;#xC870; &amp;#xB300;&amp;#xC2E0; &amp;#xB3D9;&amp;#xC791; &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0; &amp;#xC9D1;&amp;#xC911;&amp;#xD558;&amp;#xB294; &amp;#xB3D9;&amp;#xC801; &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1;(Dynamic Tracing) &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB85C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAC00; &amp;#xC9C4;&amp;#xD589;&amp;#xB41C; &amp;#xBC14; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC815;&amp;#xC801; &amp;#xB9AC;&amp;#xD504;&amp;#xD305; (Static Lifting)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; VM &amp;#xB0B4;&amp;#xBD80;&amp;#xB97C; White-Box&amp;#xB85C; &amp;#xAC04;&amp;#xC8FC;&amp;#xD574; &amp;#xC815;&amp;#xC801; &amp;#xB9AC;&amp;#xD504;&amp;#xD305;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;  &lt;code&gt;VmHandler&lt;/code&gt;(VMProtect&amp;#xC5D0;&amp;#xC11C; VM&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAC01; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC;)&amp;#xB97C; &amp;#xC77C;&amp;#xC77C;&amp;#xC774; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xD558;&amp;#xC5EC; &amp;#xADF8; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; C++&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;Helper Function&lt;/code&gt;&amp;#xB85C; &amp;#xC7AC;&amp;#xAD6C;&amp;#xD604;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; &amp;#xBCF4;&amp;#xD638;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; VM &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC774; &lt;code&gt;Helper Function&lt;/code&gt; &amp;#xD638;&amp;#xCD9C;&amp;#xC758; &amp;#xC5F0;&amp;#xC18D;&amp;#xC73C;&amp;#xB85C; &amp;#xBC88;&amp;#xC5ED;&amp;#xD574; &amp;#xC804;&amp;#xCCB4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; LLVM-IR&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB9CC; &amp;#xC704; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; VM &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAE4A;&amp;#xC740; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;a href=&#34;https://secret.club/2021/09/08/vmprotect-llvm-lifting-1.html&#34;&gt;(reference)&lt;/a&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB3D9;&amp;#xC801; &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1; (Dynamic Tracing)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC740; &amp;#xB3D9;&amp;#xC801; &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; VM&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xCF1C; &lt;strong&gt;&amp;#xC785;&amp;#xB825;&amp;#xACFC; &amp;#xCD9C;&amp;#xB825; &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xAD00;&amp;#xACC4;&amp;#xB9CC; &amp;#xCD94;&amp;#xC801;&amp;#xD574; &amp;#xD568;&amp;#xC218; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB97C; &amp;#xD574;&amp;#xC81C;&lt;/strong&gt;&amp;#xD558;&amp;#xB294; Black-Box &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xC815; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xC8FC;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD574; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#x2018;trace&amp;#x2019;&amp;#xB85C; &amp;#xAE30;&amp;#xB85D;&amp;#xD558;&amp;#xACE0;, &amp;#xC774; &amp;#xD754;&amp;#xC801;&amp;#xC744; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xC2E4;&amp;#xD589;&amp;#xC73C;&amp;#xB85C; &amp;#xC7AC;&amp;#xAD6C;&amp;#xC131;&amp;#xD574; &amp;#xC785;&amp;#xCD9C;&amp;#xB825; &amp;#xAD00;&amp;#xACC4;&amp;#xC2DD;&amp;#xC744; &amp;#xB3C4;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;a href=&#34;https://github.com/JonathanSalwan/VMProtect-devirtualization&#34;&gt;(reference)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;LLVM IR&amp;#xACFC; SSA (Single Static Assignment)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;LLVM IR&amp;#xC740; &lt;strong&gt;SSA(Static Single Assignment)&lt;/strong&gt; &amp;#xD615;&amp;#xC2DD;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xC911;&amp;#xAC04; &amp;#xD45C;&amp;#xD604;(Intermediate Representation, IR)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. SSA(Static Single Assignment)&amp;#xB780;, &amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xD55C; &amp;#xBC88;&amp;#xB9CC; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC6D0;&amp;#xCE59;&amp;#xC744; &amp;#xB530;&amp;#xB974;&amp;#xBA70;, &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAC12;&amp;#xC774; &amp;#xACC4;&amp;#xC0B0;&amp;#xB420; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAC00;&amp;#xC0C1; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;(SSA &amp;#xBCC0;&amp;#xC218;)&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB9AC; &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; LLVM IR &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE44;&amp;#xAD50;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;add rax, rcx
sub rdx, rbx
sub rax, rdx&lt;/code&gt;&lt;/pre&gt;
&lt;pre&gt;&lt;code class=&#34;hljs llvm&#34;&gt;&lt;span class=&#34;hljs-symbol&#34;&gt;%rax2&lt;/span&gt; = &lt;span class=&#34;hljs-keyword&#34;&gt;add&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;i64&lt;/span&gt; &lt;span class=&#34;hljs-symbol&#34;&gt;%rax&lt;/span&gt;, &lt;span class=&#34;hljs-symbol&#34;&gt;%rcx&lt;/span&gt;
&lt;span class=&#34;hljs-symbol&#34;&gt;%rdx2&lt;/span&gt; = &lt;span class=&#34;hljs-keyword&#34;&gt;sub&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;i64&lt;/span&gt; &lt;span class=&#34;hljs-symbol&#34;&gt;%rdx&lt;/span&gt;, &lt;span class=&#34;hljs-symbol&#34;&gt;%rbx&lt;/span&gt;
&lt;span class=&#34;hljs-symbol&#34;&gt;%rax3&lt;/span&gt; = &lt;span class=&#34;hljs-keyword&#34;&gt;sub&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;i64&lt;/span&gt; &lt;span class=&#34;hljs-symbol&#34;&gt;%rax2&lt;/span&gt;, &lt;span class=&#34;hljs-symbol&#34;&gt;%rdx2&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;LLVM IR &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;%rax1&lt;/code&gt;, &lt;code&gt;%rax2&lt;/code&gt;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCC0;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xACC4;&amp;#xC18D; &amp;#xBC14;&amp;#xB00C;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xD55C; &amp;#xBC88; &amp;#xC815;&amp;#xC758;&amp;#xB41C; SSA &amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB36E;&amp;#xC5B4;&amp;#xC4F0;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xC6D0;&amp;#xCE59; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xACA0;&amp;#xC8E0;?! &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD750;&amp;#xB984;&amp;#xACFC; &amp;#xC5F0;&amp;#xC0B0; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBA85;&amp;#xD655;&amp;#xD788; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC774;&amp;#xB7F0; SSA &amp;#xD615;&amp;#xC2DD;&amp;#xC758; LLVM-IR&amp;#xC774; &amp;#xC65C; VMProtect &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xD574;&amp;#xC81C;&amp;#xC5D0; &amp;#xC911;&amp;#xC694;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;VMProtect&amp;#xC758; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC;&amp;#xB294; &amp;#xC218;&amp;#xCC9C; &amp;#xAC1C;, &amp;#xADF8; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xBE44;&amp;#xD2B8; &amp;#xC5F0;&amp;#xC0B0;, &amp;#xC2DC;&amp;#xD504;&amp;#xD2B8;, &amp;#xC0B0;&amp;#xC220; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xB4A4;&amp;#xC11E;&amp;#xC5B4; &amp;#xB178;&amp;#xC774;&amp;#xC988;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xBA70;, &amp;#xC6D0;&amp;#xB798; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xAC10;&amp;#xCD94;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &lt;strong&gt;MBA(Mixed Boolen-Arithmetic)&lt;/strong&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xC218;&amp;#xC2DD;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. VMProtect &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xC758; MBA &amp;#xD45C;&amp;#xD604;&amp;#xC2DD;&amp;#xC758; &amp;#xC608;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs llvm&#34;&gt;(bvor
    (bvnot (bvor (bvnot (bvnot &lt;span class=&#34;hljs-keyword&#34;&gt;x&lt;/span&gt;)) (bvnot y)))
    (bvnot (bvor (bvnot &lt;span class=&#34;hljs-keyword&#34;&gt;x&lt;/span&gt;) (bvnot (bvand (bvnot y) (bvnot y)))))
)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC2DD;&amp;#xC740; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &lt;code&gt;x^y&lt;/code&gt; &amp;#xC5F0;&amp;#xC0B0;&amp;#xACFC; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC9C1;&amp;#xAD00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xAE30;&amp;#xB294; &amp;#xC5B4;&amp;#xB835;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAC8C; &amp;#xD615;&amp;#xC131;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xD45C;&amp;#xD604;&amp;#xC2DD;&amp;#xC744; SSA &amp;#xAE30;&amp;#xBC18;&amp;#xC758; LLVM IR&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xBA74; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xBA85;&amp;#xD655;&amp;#xD574;&amp;#xC9C0;&amp;#xACE0;, LLVM &amp;#xCD5C;&amp;#xC801;&amp;#xD654;(Constant Propagation, Dead Code Elimination, Pattern Recognition &amp;#xB4F1;)&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC5F0;&amp;#xC0B0;&amp;#xACFC; &amp;#xB178;&amp;#xC774;&amp;#xC988;&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xB9CC; &amp;#xAC1C;&amp;#xC758; VMP &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xAC00; &amp;#xC218;&amp;#xC2ED; &amp;#xAC1C;&amp;#xC758; SSA IR&amp;#xB85C; &amp;#xCD95;&amp;#xC57D;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xC6D0;&amp;#xBCF8; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC5D0; &amp;#xAC00;&amp;#xAE4C;&amp;#xC6B4; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;Devirtualization&#34;&gt;&lt;a href=&#34;#Devirtualization&#34; class=&#34;headerlink&#34; title=&#34;Devirtualization&#34;&gt;&lt;/a&gt;Devirtualization&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC815;&amp;#xC801; &amp;#xB9AC;&amp;#xD504;&amp;#xD305;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; VM &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC774;&amp;#xD574;&amp;#xD55C; &amp;#xACBD;&amp;#xD5D8;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C;, &amp;#xB3D9;&amp;#xC801; &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1; &amp;#xAE30;&amp;#xBC18; &amp;#xD574;&amp;#xC81C; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; Jonathan Salwan&amp;#xC758; &lt;a href=&#34;https://github.com/JonathanSalwan/VMProtect-devirtualization&#34;&gt;&lt;strong&gt;VMProtect-devirtualization Project&lt;/strong&gt;&lt;/a&gt;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB3D9;&amp;#xC801; &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1; &amp;#xAE30;&amp;#xBC18; &amp;#xD574;&amp;#xC81C;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;pure function&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdint.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;f&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; x)&lt;/span&gt; &lt;/span&gt;{
  x ^= &lt;span class=&#34;hljs-number&#34;&gt;0xA3C59AC3&lt;/span&gt;u;
  x = (x &amp;lt;&amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;) | (x &amp;gt;&amp;gt; &lt;span class=&#34;hljs-number&#34;&gt;25&lt;/span&gt;);
  x += &lt;span class=&#34;hljs-number&#34;&gt;0x9E3779B9&lt;/span&gt;u;
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; x;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC2B5; &amp;#xB300;&amp;#xC0C1;&amp;#xC740; &amp;#xC21C;&amp;#xC218; &amp;#xD568;&amp;#xC218;(pure function)&amp;#xB97C; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xC21C;&amp;#xC218; &amp;#xD568;&amp;#xC218;&amp;#xB780; &amp;#xAC19;&amp;#xC740; &amp;#xC785;&amp;#xB825;&amp;#xC774;&amp;#xBA74; &amp;#xD56D;&amp;#xC0C1; &amp;#xAC19;&amp;#xC740; &amp;#xCD9C;&amp;#xB825;&amp;#xC744; &amp;#xB0B4;&amp;#xACE0;, random, global, &amp;#xBCC0;&amp;#xC218;, I/O &amp;#xB4F1;&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD2B9;&amp;#xC131; &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; devirtualization&amp;#xC5D0; &amp;#xC801;&amp;#xD569;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;How-It-Works&#34;&gt;&lt;a href=&#34;#How-It-Works&#34; class=&#34;headerlink&#34; title=&#34;How It Works?&#34;&gt;&lt;/a&gt;&lt;strong&gt;How It Works?&lt;/strong&gt;&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs llvm&#34;&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xAE30;&amp;#xB85D; (T&amp;#x2019;) =
&amp;#xC6D0;&amp;#xBCF8; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xAE30;&amp;#xB85D; (T) + &amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0;(VM) &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xAE30;&amp;#xB85D; (VM(T))&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC2E4;&amp;#xD589;&amp;#xAE30;&amp;#xB85D;(Trace)&lt;/strong&gt;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xB54C; CPU&amp;#xAC00; &amp;#xCC98;&amp;#xB9AC;&amp;#xD55C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC758; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xC2DC;&amp;#xAC04; &amp;#xC21C;&amp;#xC11C;&amp;#xB300;&amp;#xB85C; &amp;#xBC1B;&amp;#xC544; &amp;#xC801;&amp;#xC740; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBCF4;&amp;#xBA74; &amp;#xC27D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xBAA9;&amp;#xD45C;&amp;#xB294; T&amp;#x2019;&amp;#xC5D0;&amp;#xC11C; VM(T)&amp;#xB77C;&amp;#xB294; &amp;#xB178;&amp;#xC774;&amp;#xC988;&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xACE0; &amp;#xC21C;&amp;#xC218;&amp;#xD55C; T&amp;#xB97C; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xACE0;, &amp;#xB3D9;&amp;#xC791; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC758; 5&amp;#xB2E8;&amp;#xACC4; &amp;#xC808;&amp;#xCC28;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Identify the virtualized function and its arguments&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt; &amp;#xC804;&amp;#xCCB4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC911; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; VMProtect&amp;#xB85C; &amp;#xBCF4;&amp;#xD638;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBCF4;&amp;#xD638;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBC1B;&amp;#xC544;&amp;#xC11C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xCC3E;&amp;#xC544;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Generate a VMProtect Trace of the target&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt; (&amp;#xB2E8;&amp;#xACC4; 1)&amp;#xC5D0;&amp;#xC11C; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B8; &amp;#xBCF4;&amp;#xD638;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xCF1C;, &amp;#xC5B4;&amp;#xB5A4; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294;&amp;#xC9C0;(CPU&amp;#xAC00; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xBAA9;&amp;#xB85D;) &amp;#xC804;&amp;#xCCB4; &amp;#xAE30;&amp;#xB85D;(trace)&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Construct symbolic expressions to obtain the relation between inputs and output&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt; (&amp;#xB2E8;&amp;#xACC4; 2)&amp;#xC5D0;&amp;#xC11C; &amp;#xC5BB;&amp;#xC740; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xAE30;&amp;#xB85D;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E4;&amp;#xC81C; &amp;#xAC12; &amp;#xB300;&amp;#xC2E0; &amp;#xBCC0;&amp;#xC218;(symbolic variable)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C;, &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xACC4;&amp;#xC0B0;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC218;&amp;#xD559; &amp;#xD45C;&amp;#xD604;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Apply optimizations on symbolic expressions to avoid as much as possible instructions from the VM&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt; (&amp;#xB2E8;&amp;#xACC4; 3)&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xC218;&amp;#xD559; &amp;#xD45C;&amp;#xD604;&amp;#xC2DD;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xACE0;, &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; VM&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xB418;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC81C;&amp;#xAC70;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Lift our symbolic representation to the LLVM-IR&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt; (&amp;#xB2E8;&amp;#xACC4; 4)&amp;#xC5D0;&amp;#xC11C; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B8; &amp;#xD575;&amp;#xC2EC; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; LLVM-IR(&amp;#xD2B9;&amp;#xC815; CPU&amp;#xC5D0; &amp;#xC885;&amp;#xC18D;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBC94;&amp;#xC6A9;&amp;#xC801;&amp;#xC778; &amp;#xCF54;&amp;#xB4DC; &amp;#xD615;&amp;#xD0DC;) &amp;#xC911;&amp;#xAC04; &amp;#xB2E8;&amp;#xACC4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xC774; LLVM-IR&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xD558;&amp;#xBA74;, VMProtect &amp;#xBCF4;&amp;#xD638;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xAE68;&amp;#xB057;&amp;#xD55C; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xC6D0;&amp;#xBCF8; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; VMProtect &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xAC00; &amp;#xC81C;&amp;#xAC70;&amp;#xB41C; LLVM-IR&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Example-Bitwise-Function&#34;&gt;&lt;a href=&#34;#Example-Bitwise-Function&#34; class=&#34;headerlink&#34; title=&#34;Example: Bitwise Function&#34;&gt;&lt;/a&gt;Example: Bitwise Function&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;bitwise_func&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; a, &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; b, &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; flag)&lt;/span&gt; &lt;/span&gt;{
    VMProtectBegin(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;bitwise_func&amp;quot;&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; r;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (flag == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
        r = a &amp;amp; b;
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (flag == &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;)
        r = a | b;
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
        r = a ^ b;
    VMProtectEnd();
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; r;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xACF5;&amp;#xB41C; &amp;#xC608;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB2E8;&amp;#xC21C; &amp;#xC0B0;&amp;#xC220; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xC120;&amp;#xC815;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC800;&amp;#xB294; control flow&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC38;&amp;#xACE0;&amp;#xB85C; &amp;#xB2E8;&amp;#xC21C; &amp;#xC5F0;&amp;#xC0B0; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; trace&amp;#xB97C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC57C;&amp;#xB9CC; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. LLCM-IR &amp;#xBAA8;&amp;#xB4C8;&amp;#xC740; CFG(Control Flow Graph)&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xAC01; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC5BB;&amp;#xC740; trace&amp;#xB4E4;&amp;#xC744; CFG&amp;#xB85C; &amp;#xBCD1;&amp;#xD569;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC778; &amp;#xACFC;&amp;#xC815;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;VMProtect&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xD6C4; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xBE44;&amp;#xAD50;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xD30C;&amp;#xC77C; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xC5B4;&amp;#xB9C8;&amp;#xC5B4;&amp;#xB9C8;&amp;#xD558;&amp;#xAC8C; &amp;#xCEE4;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6D0;&amp;#xBCF8; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; VMProtect&amp;#xC758; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xB418;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;(Interpreter)&amp;#xC774; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC5EC;&amp;#xB2F4;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD06C;&amp;#xAE30; &amp;#xC99D;&amp;#xAC00;&amp;#xC758; &amp;#xBD80;&amp;#xB2F4;&amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xD560; &amp;#xB54C; &amp;#xD574;&amp;#xB2F9; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xB4DC;&amp;#xBB3C;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;.. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB300;&amp;#xC2E0; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xD6A8;&amp;#xACFC;&amp;#xB294; &amp;#xAC15;&amp;#xB825;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xC635;&amp;#xC158;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; bitwise.vmp.bin &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xD2B9;&amp;#xC774;&amp;#xD55C; &amp;#xC810;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC800;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; VMProtect &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xC635;&amp;#xC158; &amp;#xC801;&amp;#xC6A9;&amp;#xB9CC;&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xC758; RVA&amp;#xAC00; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#xB9CC;, option&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBCC0;&amp;#xACBD;&amp;#xB420; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &lt;code&gt;ret&lt;/code&gt; &amp;#xC5C6;&amp;#xC774; &lt;code&gt;jmp&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;loc_407675&lt;/code&gt;&amp;#xB85C; &amp;#xC810;&amp;#xD504;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xC6D0;&amp;#xB798; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC;, VMProtect &amp;#xC2DC;&amp;#xC791; &amp;#xC9C0;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xBAA8;&amp;#xC2B5;&amp;#xC774; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xC758; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC73C;&amp;#xB85C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;loc_407675&lt;/code&gt;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xCD08;&amp;#xAE30;&amp;#xC5D0; &lt;code&gt;push 3987A4B2h&lt;/code&gt;, &lt;code&gt;call sub_4A4BBB&lt;/code&gt;, &lt;code&gt;int 3&lt;/code&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &lt;code&gt;3987A4B2h&lt;/code&gt; context &amp;#xAC12;&amp;#xC744; &amp;#xB123;&amp;#xACE0;, &lt;code&gt;sub_4A4BBB&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&amp;#xC5D0; &amp;#xC9C4;&amp;#xC785;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &lt;code&gt;VmHandler&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &lt;code&gt;call&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C; &amp;#xC9C4;&amp;#xC785;&amp;#xD55C; &amp;#xB8E8;&amp;#xD504; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; VIP&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC624;&amp;#xACE0; HANDLER &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4; &amp;#xD2B9;&amp;#xC815; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xCC98;&amp;#xB9AC; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xBC18;&amp;#xBCF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Trace-&amp;#xC218;&amp;#xC9D1;-Intel-Pin&#34;&gt;&lt;a href=&#34;#Trace-&amp;#xC218;&amp;#xC9D1;-Intel-Pin&#34; class=&#34;headerlink&#34; title=&#34;Trace &amp;#xC218;&amp;#xC9D1; (Intel Pin)&#34;&gt;&lt;/a&gt;&lt;strong&gt;Trace &amp;#xC218;&amp;#xC9D1; (Intel Pin)&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;&amp;#x1F4CC;Pin&amp;#xC774;&amp;#xB780;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Pin&amp;#xC740; Intel&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xB3D9;&amp;#xC801; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xACC4;&amp;#xCE21;(DBI) &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xB85C;, Windows&amp;#xC640; Linux &amp;#xD658;&amp;#xACBD;&amp;#xC758; x86 &amp;#xBC0F; x64 &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Pin&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; JIT(Just-In-Time) &amp;#xAE30;&amp;#xBC18; &amp;#xCF54;&amp;#xB4DC; &amp;#xBCC0;&amp;#xD658;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC5D0; &amp;#xAC1C;&amp;#xC785;&amp;#xD558;&amp;#xBA70;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC791;&amp;#xC131;&amp;#xD55C; pintool&amp;#xC744; &amp;#xC0BD;&amp;#xC785;&amp;#xD574; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC2E4;&amp;#xD589;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC811;&amp;#xADFC;, &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xB4F1; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xAD00;&amp;#xCC30;&amp;#xD558;&amp;#xACE0; &amp;#xAE30;&amp;#xB85D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; Pin&amp;#xC758; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74;, JIT &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758; pintool&amp;#xC744; &amp;#xC8FC;&amp;#xC785;&amp;#xD558;&amp;#xACE0;, &amp;#xC9C0;&amp;#xC815;&amp;#xD55C; &amp;#xAD6C;&amp;#xAC04;&amp;#xC758; trace&amp;#xB97C; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xC9D1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;TRACE_AddInstrumentFunction(OnTrace, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);

&lt;span class=&#34;hljs-function&#34;&gt;VOID &lt;span class=&#34;hljs-title&#34;&gt;OnTrace&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(TRACE t, VOID*)&lt;/span&gt; &lt;/span&gt;{
&amp;#xA0;&amp;#xA0;&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; (BBL b = TRACE_BblHead(t); BBL_Valid(b); b = BBL_Next(b)) {
&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; (INS i = BBL_InsHead(b); INS_Valid(i); i = INS_Next(i)) {
&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xC2E4;&amp;#xC81C; &amp;#xD6C5; &amp;#xC0BD;&amp;#xC785;&lt;/span&gt;
&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;}
&amp;#xA0;&amp;#xA0;}
}
&lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xB4F1;&amp;#xB85D;&lt;/span&gt;
TRACE_AddInstrumentFunction(OnTrace, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Pin&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC21C;&amp;#xC11C;&amp;#xB97C; &amp;#xB530;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xB54C; Pin&amp;#xC774; &lt;strong&gt;&amp;#xCF54;&amp;#xB4DC; &amp;#xBE14;&amp;#xB85D;(Trace)&lt;/strong&gt; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xAC00;&amp;#xB85C;&amp;#xCC55;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Pin&amp;#xC740; &amp;#xD574;&amp;#xB2F9; Trace&amp;#xB97C; &amp;#xC989;&amp;#xC2DC; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xB4F1;&amp;#xB85D;&amp;#xD55C; &lt;code&gt;&amp;#xCF5C;&amp;#xBC31; &amp;#xD568;&amp;#xC218;(OnTrace)&lt;/code&gt;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;OnTrace &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; hook&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC77C;&amp;#xBA85; &amp;#xCF54;&amp;#xB4DC; &amp;#xB07C;&amp;#xC6CC;&amp;#xB123;&amp;#xAE30;)&lt;/li&gt;
&lt;li&gt;&amp;#xC6D0;&amp;#xBCF8; &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xC0BD;&amp;#xC785;&amp;#xB41C; &amp;#xBD84;&amp;#xC11D; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xD569;&amp;#xCCD0;&amp;#xC838; JIT &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB418;&amp;#xBA70;, &amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#x201C;&amp;#xC6D0;&amp;#xBCF8; &amp;#xB3D9;&amp;#xC791; + &amp;#xAE30;&amp;#xB85D; &amp;#xAE30;&amp;#xB2A5;&amp;#x201D;&amp;#xC744; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC704; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Pin&amp;#xC740; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAE30;&amp;#xACC4;&amp;#xC5B4; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC65C;&amp;#xACE1; &amp;#xC5C6;&amp;#xC774; &amp;#xAE30;&amp;#xB85D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;./pin -t ./source/tools/VMP_Trace/obj-intel64/VMP_Trace.so \
  -start &lt;span class=&#34;hljs-number&#34;&gt;0x401156&lt;/span&gt; -end &lt;span class=&#34;hljs-number&#34;&gt;0x4011AA&lt;/span&gt; \
  -- ./bitwise.vmp.bin &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt; &amp;amp;&amp;gt; ./bitwise.vmp.trace&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Trace&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB358; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC758; start address(&lt;code&gt;0x401156&lt;/code&gt;), end address(&lt;code&gt;0x4011AA&lt;/code&gt;), &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC778;&amp;#xC790;&amp;#xAC00; &amp;#xBA87; &amp;#xAC1C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294;&amp;#xC9C0; &amp;#xC815;&amp;#xB3C4; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC8FC;&amp;#xC18C; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C;, Intel Pin &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; trace&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0DD;&amp;#xC131;&amp;#xB41C; trace &amp;#xD30C;&amp;#xC77C; &amp;#xB0B4;&amp;#xBD80;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74;, pin&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; bitwise.vmp.bin&amp;#xC744; &lt;code&gt;flag=0&lt;/code&gt; &amp;#xC778;&amp;#xC790;&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC744; &amp;#xB54C;, &amp;#xC9C0;&amp;#xC815;&amp;#xD55C; &amp;#xBC94;&amp;#xC704; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; CPU&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAE30;&amp;#xACC4;&amp;#xC5B4; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xAE30;&amp;#xB85D;&amp;#xC744; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &lt;code&gt;r:&lt;/code&gt;, &lt;code&gt;i:&lt;/code&gt;&amp;#xB97C; &amp;#xD55C; &amp;#xC30D;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xB85D;&amp;#xD558;&amp;#xB294; &amp;#xD615;&amp;#xC2DD;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;r:&lt;/code&gt; (Registers): &lt;code&gt;i:&lt;/code&gt; &amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAE30; &amp;#xC774;&amp;#xC804;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; CPU &amp;#xBC94;&amp;#xC6A9; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; 16&amp;#xC9C4;&amp;#xC218; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xB85D;&amp;#xD55C; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;i:&lt;/code&gt; (Instruction): &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC790;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xC774;&amp;#xBA70;, &lt;code&gt;i:&amp;lt;&amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC8FC;&amp;#xC18C;&amp;gt;:&amp;lt;&amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xD06C;&amp;#xAE30;(byte)&amp;gt;:&amp;lt;&amp;#xAE30;&amp;#xACC4;&amp;#xC5B4; &amp;#xCF54;&amp;#xB4DC;(Opcode)&amp;gt;&lt;/code&gt; &amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C;&amp;#xB4E4;&amp;#xBA74; &lt;code&gt;i:0x401156:1:55&lt;/code&gt;&amp;#xB294; &lt;code&gt;0x401156&lt;/code&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC2DC;&amp;#xC791; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xAC8C; &amp;#xB2F4;&amp;#xACE0;&amp;#xC788;&amp;#xACE0;, &amp;#x2018;&lt;code&gt;0x55&lt;/code&gt;(&lt;code&gt;push rbp&lt;/code&gt;) &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xB2E4;&amp;#x2019;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; trace &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xC778;&amp;#xAC04;&amp;#xC774; &amp;#xC804;&amp;#xBD80; &amp;#xC77D;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xBC29;&amp;#xB300;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xC5D0; &amp;#xAC00;&amp;#xAE5D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. attack_vmp.py &amp;#xAC19;&amp;#xC740; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC6D0;&amp;#xBCF8; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xB2F4;&amp;#xC740; LLVM-IR&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;vbraddr(Virtual Branch Address) &amp;#xAD6C;&amp;#xD558;&amp;#xAE30;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xC758; &lt;strong&gt;&amp;#xC804;&amp;#xCCB4; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294;&lt;/strong&gt;, &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; Trace &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; VMProtect&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &lt;code&gt;jmp&lt;/code&gt;, &lt;code&gt;jz&lt;/code&gt;, &lt;code&gt;jnz&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC778; &amp;#xBD84;&amp;#xAE30; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB41C; &amp;#xBD84;&amp;#xB9AC; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xC6B0; attack &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB294; &amp;#xC774; &amp;#xACBD;&amp;#xB85C;&amp;#xB4E4;&amp;#xC774; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xC5B4;&amp;#xB290; &amp;#xC9C0;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC08;&amp;#xB77C;&amp;#xC84C;&amp;#xB294;&amp;#xC9C0; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; vbraddr &amp;#xC8FC;&amp;#xC18C; &amp;#xAC12;&amp;#xC744; &amp;#xC778;&amp;#xAC04;&amp;#xC774; IDA&amp;#xB85C; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xB123;&amp;#xC5B4;&amp;#xC8FC;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;. trace &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C; cmp&amp;#xB098; test &amp;#xAC19;&amp;#xC740; &amp;#xBE44;&amp;#xAD50; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xAC00; &amp;#xC704;&amp;#xCE58;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84; &amp;#xC911; &amp;#xAC00;&amp;#xC0C1; &amp;#xBD84;&amp;#xAE30;&amp;#xB97C; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xCC3E;&amp;#xC544;&amp;#xC8FC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD544;&amp;#xC790;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;0x4831A5&lt;/code&gt;&amp;#xAC00; &amp;#xAC00;&amp;#xC0C1; &amp;#xBD84;&amp;#xAE30; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774; vbraddr&amp;#xC774; &amp;#xD6C4;&amp;#xC5D0; CFG&amp;#xAC00; &amp;#xAC08;&amp;#xB77C;&amp;#xC9C0;&amp;#xB294; &amp;#xAE30;&amp;#xC900;&amp;#xC810;&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;attack_vmp.py &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xC758; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB294; &lt;a href=&#34;https://github.com/jonathansalwan/Triton&#34;&gt;Triton &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&lt;/a&gt;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Triton&amp;#xC740; Trace &amp;#xB0B4;&amp;#xC758; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xD574;&amp;#xC11D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC640; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xBCC0;&amp;#xC218;(symbolic variable)&amp;#xB85C; &amp;#xCD94;&amp;#xC801;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC640; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; AST(Abstract Syntax Tree) &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xAD00;&amp;#xB9AC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Triton&amp;#xC758; symbolic execution &amp;#xC5D4;&amp;#xC9C4;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; path predicate&amp;#xB97C; &amp;#xAD6C;&amp;#xCD95;&amp;#xD558;&amp;#xC5EC; &amp;#xC870;&amp;#xAC74; &amp;#xBD84;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC218;&amp;#xD559;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBAA8;&amp;#xB378;&amp;#xB9C1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; VMProtect &amp;#xB178;&amp;#xC774;&amp;#xC988;&amp;#xAC00; &amp;#xAD6C;&amp;#xCCB4;&amp;#xD654;(concretization) &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C1;&amp;#xC218; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xC5B4; &amp;#xC81C;&amp;#xAC70;&amp;#xB418;&amp;#xACE0;, simplification pass&amp;#xC640; formula slicing &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xC2DD;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xACFC; &amp;#xCD9C;&amp;#xB825; &amp;#xAD00;&amp;#xACC4;&amp;#xB9CC; &amp;#xB2F4;&amp;#xC740; &amp;#xC218;&amp;#xD559; &amp;#xD45C;&amp;#xD604;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E8;&amp;#xC21C;&amp;#xD654; &amp;#xD558;&amp;#xB294; &amp;#xC6D0;&amp;#xB9AC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;./attack_vmp.py \
  --trace1 ./bitwise.vmp.trace0 \
  --trace2 ./bitwise.vmp.trace1 \
  --trace3 ./bitwise.vmp.trace2 \
  --symsize &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt; \
  --vbraddr &lt;span class=&#34;hljs-number&#34;&gt;0x4831a5&lt;/span&gt; \
  --vbrflag af&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C; &amp;#xAC01;&amp;#xAC01; &amp;#xB2E4;&amp;#xB978; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC744; &amp;#xD0C0;&amp;#xB294; trace &amp;#xC138; &amp;#xAC1C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB123;&amp;#xC5B4;&amp;#xC8FC;&amp;#xACE0;, &lt;code&gt;&amp;#x2014;vbraddr&lt;/code&gt;&amp;#xACFC; &lt;code&gt;&amp;#x2014;vbrflag&lt;/code&gt; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xD568;&amp;#xAED8; &amp;#xC804;&amp;#xB2EC;&amp;#xD574;&amp;#xC90D;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xCC38;&amp;#xACE0;&amp;#xB85C; &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; attack_vmp &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB294; trace&amp;#xB97C; &amp;#xB450; &amp;#xAC1C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBC16;&amp;#xC5D0; &amp;#xBABB; &amp;#xC918;&amp;#xC11C; trace &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB354; &amp;#xB9CE;&amp;#xC774; &amp;#xC92C;&amp;#xC744; &amp;#xB54C; &amp;#xC774;&amp;#xB97C; &amp;#xC5F0;&amp;#xACB0;&amp;#xC9C0;&amp;#xC5B4; LLVM-IR&amp;#xB85C; &amp;#xACB0;&amp;#xD569;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &amp;#xAE30;&amp;#xB2A5;&amp;#xC73C;&amp;#xB85C; &amp;#xC870;&amp;#xAE08; &amp;#xD655;&amp;#xC7A5;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACFC;&amp;#xC5F0; &amp;#xC138; &amp;#xAC1C;&amp;#xC758; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC744; &amp;#xBCD1;&amp;#xD569;&amp;#xD574; CFG &amp;#xD615;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0DD;&amp;#xC131;&amp;#xB41C; LLVM-IR&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC6D0;&amp;#xBCF8; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &lt;code&gt;if-else&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xBE44;&amp;#xD2B8; &amp;#xC5F0;&amp;#xC0B0;(XOR, AND, OR) &amp;#xC870;&amp;#xD569;&amp;#xC744; &amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xAC8C; &amp;#xAD6C;&amp;#xD604;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (&lt;a href=&#34;https://llvm.org/docs/LangRef.html&#34;&gt;LLVM-IR Language&lt;/a&gt;&amp;#xAC00; &amp;#xAD81;&amp;#xAE08;&amp;#xD558;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774; &amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;p&gt;LLCM IR &amp;#xB9AC;&amp;#xD504;&amp;#xD305; &amp;#xACB0;&amp;#xACFC;, &lt;code&gt;%SymVar_0&lt;/code&gt;, &lt;code&gt;%SymVar_1&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; AND&amp;#xC640; OR &amp;#xC5F0;&amp;#xC0B0;&amp;#xC774;, &amp;#xADF8; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; XOR &amp;#xC5F0;&amp;#xC0B0;&amp;#xC774; &amp;#xAC01;&amp;#xAC01; &amp;#xC870;&amp;#xAC74; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xAC70;&amp;#xCCD0; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;-88&lt;/code&gt;, &lt;code&gt;==16&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xBE44;&amp;#xAD50;&amp;#xB294; VMProtect &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0BD;&amp;#xC785;&amp;#xB41C; &amp;#xB178;&amp;#xC774;&amp;#xC988;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xD575;&amp;#xC2EC; &amp;#xB85C;&amp;#xC9C1;&amp;#xACFC; &amp;#xBB34;&amp;#xAD00;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&amp;#xB294; VMProtect&amp;#xB85C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; devirtualization &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB85C;, &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xBC18;&amp;#xD658; &amp;#xAC12;&amp;#xC774; select &amp;#xC5F0;&amp;#xC0B0;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xACB0;&amp;#xC815;&amp;#xB418;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; select &amp;#xB178;&amp;#xB4DC;&amp;#xB294; cond q&amp;#xB77C;&amp;#xB294; &amp;#xC870;&amp;#xAC74;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC67C;&amp;#xCABD;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &lt;code&gt;SymVar_0&lt;/code&gt;&amp;#xACFC; &lt;code&gt;SymVar_1&lt;/code&gt;&amp;#xC744; XOR&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C;, &amp;#xC624;&amp;#xB978;&amp;#xCABD;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xB610; &amp;#xB2E4;&amp;#xB978; select &amp;#xB178;&amp;#xB4DC;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB978;&amp;#xCABD;&amp;#xC758; select &amp;#xB178;&amp;#xB4DC;&amp;#xB294; cond p &amp;#xC870;&amp;#xAC74;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xCC38;&amp;#xC77C; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;SymVar_0&lt;/code&gt;&amp;#xACFC; &lt;code&gt;SymVar_1&lt;/code&gt;&amp;#xC744; OR&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C;, &amp;#xAC70;&amp;#xC9D3;&amp;#xC77C; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;SymVar_0&lt;/code&gt;&amp;#xACFC; &lt;code&gt;SymVar_1&lt;/code&gt;&amp;#xC744; AND&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Conclusion&#34;&gt;&lt;a href=&#34;#Conclusion&#34; class=&#34;headerlink&#34; title=&#34;Conclusion&#34;&gt;&lt;/a&gt;Conclusion&lt;/h1&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8EC; LLVM &amp;#xAE30;&amp;#xBC18;&amp;#xC758; devirtualization &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC740; &amp;#xB2E8;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB098; &amp;#xC18C;&amp;#xC218;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C4; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xACBD;&amp;#xB85C; &amp;#xC218;&amp;#xAC00; &amp;#xB9CE;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC77C;&amp;#xBD80; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xB204;&amp;#xB77D;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD604;&amp;#xC2E4;&amp;#xC801;&amp;#xC778; &amp;#xADDC;&amp;#xBAA8;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xC9C1; &amp;#xBB34;&amp;#xB9AC;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC774;&amp;#xBC88; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC740; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; part 1&amp;#xC744; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; part&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAD00;&amp;#xB828; &amp;#xB17C;&amp;#xBB38;&amp;#xB4E4;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC911;&amp;#xC810;&amp;#xC5D0; &amp;#xB450;&amp;#xC5B4; devirtualization &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC744; &amp;#xB2F4;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0;, virtualization &amp;#xBFD0;&amp;#xB9CC;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; options&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xD574;&amp;#xC81C; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://koreascience.kr/article/JAKO202106153172639.pub?&amp;amp;lang=ko&#34;&gt;https://koreascience.kr/article/JAKO202106153172639.pub?&amp;amp;lang=ko&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/JonathanSalwan/VMProtect-devirtualization/tree/main&#34;&gt;https://github.com/JonathanSalwan/VMProtect-devirtualization/tree/main&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://scienceon.kisti.re.kr/commons/util/originalView.do?cn=JAKO202025356104834&amp;amp;oCn=JAKO202025356104834&amp;amp;dbt=JAKO&amp;amp;journal=NJOU00291865&#34;&gt;https://scienceon.kisti.re.kr/commons/util/originalView.do?cn=JAKO202025356104834&amp;amp;oCn=JAKO202025356104834&amp;amp;dbt=JAKO&amp;amp;journal=NJOU00291865&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.kc-ml2.com/posts/blog_LLVM&#34;&gt;https://www.kc-ml2.com/posts/blog_LLVM&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] LLVM based VMProtect Devirtualization: Part 1 (KR) - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image1.jpg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. &amp;#xC624;&amp;#xB298;&amp;#xB3C4; &amp;#xC5B4;&amp;#xB514;&amp;#xC11C;&amp;#xC778;&amp;#xAC00; &amp;#xB3CC;&amp;#xC544;&amp;#xC628; banda&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCF54;&amp;#xB4DC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC911;&amp;#xC5D0; VMProtect, Themida&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774; &amp;#xC911; VMProtect&amp;#xB294; &amp;#xD2B9;&amp;#xD788; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;(VM) &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;, &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C;&amp;#xB824;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. VMProtect&amp;#xB294; non-standard &amp;#xAC00;&amp;#xC0C1; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC6D0;&amp;#xBCF8; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB3C5;&amp;#xC790;&amp;#xC801;&amp;#xC778; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;, &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xD639;&amp;#xC2DC; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xC791;&amp;#xC131;&amp;#xB41C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC774; &amp;#xAD81;&amp;#xAE08;&amp;#xD558;&amp;#xB2E4;&amp;#xBA74; &lt;a href=&#34;https://hackyboiz.github.io/2025/04/28/OUYA77/Anti_part3/kr/&#34;&gt;(&amp;#x1F449;&amp;#xC5EC;&amp;#xAE30;&amp;#xB85C; &amp;#x314E;&amp;#x314E;)&lt;/a&gt;)&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xAC04; VMProtect &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xD574;&amp;#xC81C;&amp;#xB97C; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xB17C;&amp;#xBB38;&amp;#xACFC; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAC00; &amp;#xAFB8;&amp;#xC900;&amp;#xD788; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xC5B4; &amp;#xC654;&amp;#xB294;&amp;#xB370;, &amp;#xC624;&amp;#xB298; &amp;#xD544;&amp;#xC790;&amp;#xB294; &amp;#xC774;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC5F0;&amp;#xAD6C; &amp;#xC911; &amp;#xD2B9;&amp;#xD788; LLVM&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xD574;&amp;#xC81C; &amp;#xBC29;&amp;#xBC95;&amp;#xB860;&amp;#xC744; &amp;#xC911;&amp;#xC2EC;&amp;#xC73C;&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACE0;, &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xD574;&amp;#xC81C;&amp;#xAC00; &amp;#xC5B4;&amp;#xB290; &amp;#xC2E4;&amp;#xD604; &amp;#xAC00;&amp;#xB2A5;&amp;#xD560;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xB2E4;&amp;#xB9CC; &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; VMP &amp;#xBCF4;&amp;#xD638; &amp;#xC635;&amp;#xC158; &amp;#xC911; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xC635;&amp;#xC158;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xC9D1;&amp;#xC911;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB8F9;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;h1 id=&#34;VMProtect&#34;&gt;&lt;a href=&#34;#VMProtect&#34; class=&#34;headerlink&#34; title=&#34;VMProtect&#34;&gt;&lt;/a&gt;VMProtect&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;VMProtect&amp;#xB294; Anti-Reversing &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD574; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xC2DD; &amp;#xBB38;&amp;#xC11C;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xCF54;&amp;#xB4DC; &amp;#xBCF4;&amp;#xD638;&amp;#xC640; &amp;#xD06C;&amp;#xB799; &amp;#xBC29;&amp;#xC9C0;&amp;#xB97C; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xBA70;, &amp;#xC790;&amp;#xCCB4; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC640; &amp;#xB0B4;&amp;#xC7A5; &amp;#xB514;&amp;#xC2A4;&amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB7EC;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD574; &amp;#xBCF4;&amp;#xD638;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC; &amp;#xC601;&amp;#xC5ED;&amp;#xACFC; &amp;#xBE4C;&amp;#xB4DC; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC138;&amp;#xBC00;&amp;#xD558;&amp;#xAC8C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xC8FC;&amp;#xB85C; Windows &amp;#xAE30;&amp;#xBC18; &amp;#xB124;&amp;#xC774;&amp;#xD2F0;&amp;#xBE0C; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;(C/C++, Delphi, Visual Basic)&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;VMProtect 3.9.6 &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xC635;&amp;#xC158;&amp;#xC740; &amp;#x2460;Memory Protection, &amp;#x2461;Import Protection, &amp;#x2462;Resource Protection, &amp;#x2463;Pack the Output File, &amp;#x2464;Debugger Detection, &amp;#x2465;Virtualization Tools Dectection, &amp;#x2466;Virtualization&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC774; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &lt;strong&gt;Virtualization(&amp;#xAC00;&amp;#xC0C1;&amp;#xD654;)&lt;/strong&gt;&amp;#xC740; &amp;#xAC15;&amp;#xB825;&amp;#xD55C; &amp;#xBCF4;&amp;#xD638; &amp;#xAE30;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C;, &amp;#xC6D0;&amp;#xB798;&amp;#xC758; x86/x64 &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; VMProtect&amp;#xAC00; &lt;strong&gt;&amp;#xC815;&amp;#xC758;&amp;#xD55C; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&lt;/strong&gt;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD55C; &amp;#xB4A4;, &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC; &amp;#xB0B4;&amp;#xC7A5;&amp;#xB41C; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC774; &amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xC11D;&amp;#xD574; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC885;&amp;#xB958;&amp;#xC758; VM&amp;#xC774; &amp;#xD63C;&amp;#xD569;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC5D4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD574; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;VMProtect-with-LLVM&#34;&gt;&lt;a href=&#34;#VMProtect-with-LLVM&#34; class=&#34;headerlink&#34; title=&#34;VMProtect with LLVM&#34;&gt;&lt;/a&gt;VMProtect with LLVM&lt;/h1&gt;&lt;p&gt;LLVM&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; VMProtect &amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xADF8;&amp;#xB3D9;&amp;#xC548; VM&amp;#xC758; &amp;#xB0B4;&amp;#xBD80; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xC815;&amp;#xC801; &amp;#xB9AC;&amp;#xD504;&amp;#xD305;(Static Lifting)&amp;#xACFC;, &amp;#xB0B4;&amp;#xBD80; &amp;#xAD6C;&amp;#xC870; &amp;#xB300;&amp;#xC2E0; &amp;#xB3D9;&amp;#xC791; &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0; &amp;#xC9D1;&amp;#xC911;&amp;#xD558;&amp;#xB294; &amp;#xB3D9;&amp;#xC801; &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1;(Dynamic Tracing) &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB85C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAC00; &amp;#xC9C4;&amp;#xD589;&amp;#xB41C; &amp;#xBC14; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC815;&amp;#xC801; &amp;#xB9AC;&amp;#xD504;&amp;#xD305; (Static Lifting)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; VM &amp;#xB0B4;&amp;#xBD80;&amp;#xB97C; White-Box&amp;#xB85C; &amp;#xAC04;&amp;#xC8FC;&amp;#xD574; &amp;#xC815;&amp;#xC801; &amp;#xB9AC;&amp;#xD504;&amp;#xD305;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;  &lt;code&gt;VmHandler&lt;/code&gt;(VMProtect&amp;#xC5D0;&amp;#xC11C; VM&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAC01; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC;)&amp;#xB97C; &amp;#xC77C;&amp;#xC77C;&amp;#xC774; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xD558;&amp;#xC5EC; &amp;#xADF8; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; C++&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;Helper Function&lt;/code&gt;&amp;#xB85C; &amp;#xC7AC;&amp;#xAD6C;&amp;#xD604;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; &amp;#xBCF4;&amp;#xD638;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; VM &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC774; &lt;code&gt;Helper Function&lt;/code&gt; &amp;#xD638;&amp;#xCD9C;&amp;#xC758; &amp;#xC5F0;&amp;#xC18D;&amp;#xC73C;&amp;#xB85C; &amp;#xBC88;&amp;#xC5ED;&amp;#xD574; &amp;#xC804;&amp;#xCCB4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; LLVM-IR&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB9CC; &amp;#xC704; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; VM &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAE4A;&amp;#xC740; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;a href=&#34;https://secret.club/2021/09/08/vmprotect-llvm-lifting-1.html&#34;&gt;(reference)&lt;/a&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB3D9;&amp;#xC801; &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1; (Dynamic Tracing)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC740; &amp;#xB3D9;&amp;#xC801; &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; VM&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xCF1C; &lt;strong&gt;&amp;#xC785;&amp;#xB825;&amp;#xACFC; &amp;#xCD9C;&amp;#xB825; &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xAD00;&amp;#xACC4;&amp;#xB9CC; &amp;#xCD94;&amp;#xC801;&amp;#xD574; &amp;#xD568;&amp;#xC218; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB97C; &amp;#xD574;&amp;#xC81C;&lt;/strong&gt;&amp;#xD558;&amp;#xB294; Black-Box &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xC815; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xC8FC;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD574; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#x2018;trace&amp;#x2019;&amp;#xB85C; &amp;#xAE30;&amp;#xB85D;&amp;#xD558;&amp;#xACE0;, &amp;#xC774; &amp;#xD754;&amp;#xC801;&amp;#xC744; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xC2E4;&amp;#xD589;&amp;#xC73C;&amp;#xB85C; &amp;#xC7AC;&amp;#xAD6C;&amp;#xC131;&amp;#xD574; &amp;#xC785;&amp;#xCD9C;&amp;#xB825; &amp;#xAD00;&amp;#xACC4;&amp;#xC2DD;&amp;#xC744; &amp;#xB3C4;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;a href=&#34;https://github.com/JonathanSalwan/VMProtect-devirtualization&#34;&gt;(reference)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;LLVM IR&amp;#xACFC; SSA (Single Static Assignment)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;LLVM IR&amp;#xC740; &lt;strong&gt;SSA(Static Single Assignment)&lt;/strong&gt; &amp;#xD615;&amp;#xC2DD;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xC911;&amp;#xAC04; &amp;#xD45C;&amp;#xD604;(Intermediate Representation, IR)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. SSA(Static Single Assignment)&amp;#xB780;, &amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xD55C; &amp;#xBC88;&amp;#xB9CC; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC6D0;&amp;#xCE59;&amp;#xC744; &amp;#xB530;&amp;#xB974;&amp;#xBA70;, &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAC12;&amp;#xC774; &amp;#xACC4;&amp;#xC0B0;&amp;#xB420; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAC00;&amp;#xC0C1; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;(SSA &amp;#xBCC0;&amp;#xC218;)&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB9AC; &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; LLVM IR &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE44;&amp;#xAD50;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;add rax, rcx
sub rdx, rbx
sub rax, rdx&lt;/code&gt;&lt;/pre&gt;
&lt;pre&gt;&lt;code class=&#34;hljs llvm&#34;&gt;&lt;span class=&#34;hljs-symbol&#34;&gt;%rax2&lt;/span&gt; = &lt;span class=&#34;hljs-keyword&#34;&gt;add&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;i64&lt;/span&gt; &lt;span class=&#34;hljs-symbol&#34;&gt;%rax&lt;/span&gt;, &lt;span class=&#34;hljs-symbol&#34;&gt;%rcx&lt;/span&gt;
&lt;span class=&#34;hljs-symbol&#34;&gt;%rdx2&lt;/span&gt; = &lt;span class=&#34;hljs-keyword&#34;&gt;sub&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;i64&lt;/span&gt; &lt;span class=&#34;hljs-symbol&#34;&gt;%rdx&lt;/span&gt;, &lt;span class=&#34;hljs-symbol&#34;&gt;%rbx&lt;/span&gt;
&lt;span class=&#34;hljs-symbol&#34;&gt;%rax3&lt;/span&gt; = &lt;span class=&#34;hljs-keyword&#34;&gt;sub&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;i64&lt;/span&gt; &lt;span class=&#34;hljs-symbol&#34;&gt;%rax2&lt;/span&gt;, &lt;span class=&#34;hljs-symbol&#34;&gt;%rdx2&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;LLVM IR &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;%rax1&lt;/code&gt;, &lt;code&gt;%rax2&lt;/code&gt;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCC0;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xACC4;&amp;#xC18D; &amp;#xBC14;&amp;#xB00C;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xD55C; &amp;#xBC88; &amp;#xC815;&amp;#xC758;&amp;#xB41C; SSA &amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB36E;&amp;#xC5B4;&amp;#xC4F0;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xC6D0;&amp;#xCE59; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xACA0;&amp;#xC8E0;?! &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD750;&amp;#xB984;&amp;#xACFC; &amp;#xC5F0;&amp;#xC0B0; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBA85;&amp;#xD655;&amp;#xD788; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC774;&amp;#xB7F0; SSA &amp;#xD615;&amp;#xC2DD;&amp;#xC758; LLVM-IR&amp;#xC774; &amp;#xC65C; VMProtect &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xD574;&amp;#xC81C;&amp;#xC5D0; &amp;#xC911;&amp;#xC694;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;VMProtect&amp;#xC758; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC;&amp;#xB294; &amp;#xC218;&amp;#xCC9C; &amp;#xAC1C;, &amp;#xADF8; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xBE44;&amp;#xD2B8; &amp;#xC5F0;&amp;#xC0B0;, &amp;#xC2DC;&amp;#xD504;&amp;#xD2B8;, &amp;#xC0B0;&amp;#xC220; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xB4A4;&amp;#xC11E;&amp;#xC5B4; &amp;#xB178;&amp;#xC774;&amp;#xC988;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xBA70;, &amp;#xC6D0;&amp;#xB798; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xAC10;&amp;#xCD94;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &lt;strong&gt;MBA(Mixed Boolen-Arithmetic)&lt;/strong&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xC218;&amp;#xC2DD;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. VMProtect &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xC758; MBA &amp;#xD45C;&amp;#xD604;&amp;#xC2DD;&amp;#xC758; &amp;#xC608;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs llvm&#34;&gt;(bvor
    (bvnot (bvor (bvnot (bvnot &lt;span class=&#34;hljs-keyword&#34;&gt;x&lt;/span&gt;)) (bvnot y)))
    (bvnot (bvor (bvnot &lt;span class=&#34;hljs-keyword&#34;&gt;x&lt;/span&gt;) (bvnot (bvand (bvnot y) (bvnot y)))))
)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC2DD;&amp;#xC740; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &lt;code&gt;x^y&lt;/code&gt; &amp;#xC5F0;&amp;#xC0B0;&amp;#xACFC; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC9C1;&amp;#xAD00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xAE30;&amp;#xB294; &amp;#xC5B4;&amp;#xB835;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAC8C; &amp;#xD615;&amp;#xC131;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xD45C;&amp;#xD604;&amp;#xC2DD;&amp;#xC744; SSA &amp;#xAE30;&amp;#xBC18;&amp;#xC758; LLVM IR&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xBA74; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xBA85;&amp;#xD655;&amp;#xD574;&amp;#xC9C0;&amp;#xACE0;, LLVM &amp;#xCD5C;&amp;#xC801;&amp;#xD654;(Constant Propagation, Dead Code Elimination, Pattern Recognition &amp;#xB4F1;)&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC5F0;&amp;#xC0B0;&amp;#xACFC; &amp;#xB178;&amp;#xC774;&amp;#xC988;&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xB9CC; &amp;#xAC1C;&amp;#xC758; VMP &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xAC00; &amp;#xC218;&amp;#xC2ED; &amp;#xAC1C;&amp;#xC758; SSA IR&amp;#xB85C; &amp;#xCD95;&amp;#xC57D;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xC6D0;&amp;#xBCF8; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC5D0; &amp;#xAC00;&amp;#xAE4C;&amp;#xC6B4; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;Devirtualization&#34;&gt;&lt;a href=&#34;#Devirtualization&#34; class=&#34;headerlink&#34; title=&#34;Devirtualization&#34;&gt;&lt;/a&gt;Devirtualization&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC815;&amp;#xC801; &amp;#xB9AC;&amp;#xD504;&amp;#xD305;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; VM &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC774;&amp;#xD574;&amp;#xD55C; &amp;#xACBD;&amp;#xD5D8;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C;, &amp;#xB3D9;&amp;#xC801; &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1; &amp;#xAE30;&amp;#xBC18; &amp;#xD574;&amp;#xC81C; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; Jonathan Salwan&amp;#xC758; &lt;a href=&#34;https://github.com/JonathanSalwan/VMProtect-devirtualization&#34;&gt;&lt;strong&gt;VMProtect-devirtualization Project&lt;/strong&gt;&lt;/a&gt;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB3D9;&amp;#xC801; &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1; &amp;#xAE30;&amp;#xBC18; &amp;#xD574;&amp;#xC81C;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;pure function&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdint.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;f&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; x)&lt;/span&gt; &lt;/span&gt;{
  x ^= &lt;span class=&#34;hljs-number&#34;&gt;0xA3C59AC3&lt;/span&gt;u;
  x = (x &amp;lt;&amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;) | (x &amp;gt;&amp;gt; &lt;span class=&#34;hljs-number&#34;&gt;25&lt;/span&gt;);
  x += &lt;span class=&#34;hljs-number&#34;&gt;0x9E3779B9&lt;/span&gt;u;
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; x;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC2B5; &amp;#xB300;&amp;#xC0C1;&amp;#xC740; &amp;#xC21C;&amp;#xC218; &amp;#xD568;&amp;#xC218;(pure function)&amp;#xB97C; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xC21C;&amp;#xC218; &amp;#xD568;&amp;#xC218;&amp;#xB780; &amp;#xAC19;&amp;#xC740; &amp;#xC785;&amp;#xB825;&amp;#xC774;&amp;#xBA74; &amp;#xD56D;&amp;#xC0C1; &amp;#xAC19;&amp;#xC740; &amp;#xCD9C;&amp;#xB825;&amp;#xC744; &amp;#xB0B4;&amp;#xACE0;, random, global, &amp;#xBCC0;&amp;#xC218;, I/O &amp;#xB4F1;&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD2B9;&amp;#xC131; &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; devirtualization&amp;#xC5D0; &amp;#xC801;&amp;#xD569;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;How-It-Works&#34;&gt;&lt;a href=&#34;#How-It-Works&#34; class=&#34;headerlink&#34; title=&#34;How It Works?&#34;&gt;&lt;/a&gt;&lt;strong&gt;How It Works?&lt;/strong&gt;&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs llvm&#34;&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xAE30;&amp;#xB85D; (T&amp;#x2019;) =
&amp;#xC6D0;&amp;#xBCF8; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xAE30;&amp;#xB85D; (T) + &amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0;(VM) &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xAE30;&amp;#xB85D; (VM(T))&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC2E4;&amp;#xD589;&amp;#xAE30;&amp;#xB85D;(Trace)&lt;/strong&gt;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xB54C; CPU&amp;#xAC00; &amp;#xCC98;&amp;#xB9AC;&amp;#xD55C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC758; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xC2DC;&amp;#xAC04; &amp;#xC21C;&amp;#xC11C;&amp;#xB300;&amp;#xB85C; &amp;#xBC1B;&amp;#xC544; &amp;#xC801;&amp;#xC740; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBCF4;&amp;#xBA74; &amp;#xC27D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xBAA9;&amp;#xD45C;&amp;#xB294; T&amp;#x2019;&amp;#xC5D0;&amp;#xC11C; VM(T)&amp;#xB77C;&amp;#xB294; &amp;#xB178;&amp;#xC774;&amp;#xC988;&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xACE0; &amp;#xC21C;&amp;#xC218;&amp;#xD55C; T&amp;#xB97C; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xACE0;, &amp;#xB3D9;&amp;#xC791; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC758; 5&amp;#xB2E8;&amp;#xACC4; &amp;#xC808;&amp;#xCC28;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Identify the virtualized function and its arguments&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt; &amp;#xC804;&amp;#xCCB4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC911; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; VMProtect&amp;#xB85C; &amp;#xBCF4;&amp;#xD638;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBCF4;&amp;#xD638;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBC1B;&amp;#xC544;&amp;#xC11C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xCC3E;&amp;#xC544;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Generate a VMProtect Trace of the target&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt; (&amp;#xB2E8;&amp;#xACC4; 1)&amp;#xC5D0;&amp;#xC11C; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B8; &amp;#xBCF4;&amp;#xD638;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xCF1C;, &amp;#xC5B4;&amp;#xB5A4; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294;&amp;#xC9C0;(CPU&amp;#xAC00; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xBAA9;&amp;#xB85D;) &amp;#xC804;&amp;#xCCB4; &amp;#xAE30;&amp;#xB85D;(trace)&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Construct symbolic expressions to obtain the relation between inputs and output&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt; (&amp;#xB2E8;&amp;#xACC4; 2)&amp;#xC5D0;&amp;#xC11C; &amp;#xC5BB;&amp;#xC740; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xAE30;&amp;#xB85D;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E4;&amp;#xC81C; &amp;#xAC12; &amp;#xB300;&amp;#xC2E0; &amp;#xBCC0;&amp;#xC218;(symbolic variable)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C;, &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xACC4;&amp;#xC0B0;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC218;&amp;#xD559; &amp;#xD45C;&amp;#xD604;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Apply optimizations on symbolic expressions to avoid as much as possible instructions from the VM&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt; (&amp;#xB2E8;&amp;#xACC4; 3)&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xC218;&amp;#xD559; &amp;#xD45C;&amp;#xD604;&amp;#xC2DD;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xACE0;, &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; VM&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xB418;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC81C;&amp;#xAC70;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Lift our symbolic representation to the LLVM-IR&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt; (&amp;#xB2E8;&amp;#xACC4; 4)&amp;#xC5D0;&amp;#xC11C; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B8; &amp;#xD575;&amp;#xC2EC; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; LLVM-IR(&amp;#xD2B9;&amp;#xC815; CPU&amp;#xC5D0; &amp;#xC885;&amp;#xC18D;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBC94;&amp;#xC6A9;&amp;#xC801;&amp;#xC778; &amp;#xCF54;&amp;#xB4DC; &amp;#xD615;&amp;#xD0DC;) &amp;#xC911;&amp;#xAC04; &amp;#xB2E8;&amp;#xACC4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xC774; LLVM-IR&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xD558;&amp;#xBA74;, VMProtect &amp;#xBCF4;&amp;#xD638;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xAE68;&amp;#xB057;&amp;#xD55C; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xC6D0;&amp;#xBCF8; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; VMProtect &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xAC00; &amp;#xC81C;&amp;#xAC70;&amp;#xB41C; LLVM-IR&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Example-Bitwise-Function&#34;&gt;&lt;a href=&#34;#Example-Bitwise-Function&#34; class=&#34;headerlink&#34; title=&#34;Example: Bitwise Function&#34;&gt;&lt;/a&gt;Example: Bitwise Function&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;bitwise_func&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; a, &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; b, &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; flag)&lt;/span&gt; &lt;/span&gt;{
    VMProtectBegin(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;bitwise_func&amp;quot;&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; r;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (flag == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
        r = a &amp;amp; b;
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (flag == &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;)
        r = a | b;
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
        r = a ^ b;
    VMProtectEnd();
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; r;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xACF5;&amp;#xB41C; &amp;#xC608;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB2E8;&amp;#xC21C; &amp;#xC0B0;&amp;#xC220; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xC120;&amp;#xC815;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC800;&amp;#xB294; control flow&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC38;&amp;#xACE0;&amp;#xB85C; &amp;#xB2E8;&amp;#xC21C; &amp;#xC5F0;&amp;#xC0B0; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; trace&amp;#xB97C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC57C;&amp;#xB9CC; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. LLCM-IR &amp;#xBAA8;&amp;#xB4C8;&amp;#xC740; CFG(Control Flow Graph)&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xAC01; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC5BB;&amp;#xC740; trace&amp;#xB4E4;&amp;#xC744; CFG&amp;#xB85C; &amp;#xBCD1;&amp;#xD569;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC778; &amp;#xACFC;&amp;#xC815;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;VMProtect&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xD6C4; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xBE44;&amp;#xAD50;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xD30C;&amp;#xC77C; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xC5B4;&amp;#xB9C8;&amp;#xC5B4;&amp;#xB9C8;&amp;#xD558;&amp;#xAC8C; &amp;#xCEE4;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6D0;&amp;#xBCF8; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; VMProtect&amp;#xC758; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xB418;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;(Interpreter)&amp;#xC774; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC5EC;&amp;#xB2F4;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD06C;&amp;#xAE30; &amp;#xC99D;&amp;#xAC00;&amp;#xC758; &amp;#xBD80;&amp;#xB2F4;&amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xD560; &amp;#xB54C; &amp;#xD574;&amp;#xB2F9; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xB4DC;&amp;#xBB3C;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;.. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB300;&amp;#xC2E0; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xD6A8;&amp;#xACFC;&amp;#xB294; &amp;#xAC15;&amp;#xB825;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xC635;&amp;#xC158;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; bitwise.vmp.bin &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xD2B9;&amp;#xC774;&amp;#xD55C; &amp;#xC810;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC800;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; VMProtect &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xC635;&amp;#xC158; &amp;#xC801;&amp;#xC6A9;&amp;#xB9CC;&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xC758; RVA&amp;#xAC00; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#xB9CC;, option&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBCC0;&amp;#xACBD;&amp;#xB420; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &lt;code&gt;ret&lt;/code&gt; &amp;#xC5C6;&amp;#xC774; &lt;code&gt;jmp&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;loc_407675&lt;/code&gt;&amp;#xB85C; &amp;#xC810;&amp;#xD504;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xC6D0;&amp;#xB798; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC;, VMProtect &amp;#xC2DC;&amp;#xC791; &amp;#xC9C0;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xBAA8;&amp;#xC2B5;&amp;#xC774; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xC758; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC73C;&amp;#xB85C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;loc_407675&lt;/code&gt;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xCD08;&amp;#xAE30;&amp;#xC5D0; &lt;code&gt;push 3987A4B2h&lt;/code&gt;, &lt;code&gt;call sub_4A4BBB&lt;/code&gt;, &lt;code&gt;int 3&lt;/code&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &lt;code&gt;3987A4B2h&lt;/code&gt; context &amp;#xAC12;&amp;#xC744; &amp;#xB123;&amp;#xACE0;, &lt;code&gt;sub_4A4BBB&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&amp;#xC5D0; &amp;#xC9C4;&amp;#xC785;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &lt;code&gt;VmHandler&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &lt;code&gt;call&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C; &amp;#xC9C4;&amp;#xC785;&amp;#xD55C; &amp;#xB8E8;&amp;#xD504; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; VIP&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC624;&amp;#xACE0; HANDLER &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4; &amp;#xD2B9;&amp;#xC815; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xCC98;&amp;#xB9AC; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xBC18;&amp;#xBCF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Trace-&amp;#xC218;&amp;#xC9D1;-Intel-Pin&#34;&gt;&lt;a href=&#34;#Trace-&amp;#xC218;&amp;#xC9D1;-Intel-Pin&#34; class=&#34;headerlink&#34; title=&#34;Trace &amp;#xC218;&amp;#xC9D1; (Intel Pin)&#34;&gt;&lt;/a&gt;&lt;strong&gt;Trace &amp;#xC218;&amp;#xC9D1; (Intel Pin)&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;&amp;#x1F4CC;Pin&amp;#xC774;&amp;#xB780;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Pin&amp;#xC740; Intel&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xB3D9;&amp;#xC801; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xACC4;&amp;#xCE21;(DBI) &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xB85C;, Windows&amp;#xC640; Linux &amp;#xD658;&amp;#xACBD;&amp;#xC758; x86 &amp;#xBC0F; x64 &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Pin&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; JIT(Just-In-Time) &amp;#xAE30;&amp;#xBC18; &amp;#xCF54;&amp;#xB4DC; &amp;#xBCC0;&amp;#xD658;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC5D0; &amp;#xAC1C;&amp;#xC785;&amp;#xD558;&amp;#xBA70;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC791;&amp;#xC131;&amp;#xD55C; pintool&amp;#xC744; &amp;#xC0BD;&amp;#xC785;&amp;#xD574; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC2E4;&amp;#xD589;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC811;&amp;#xADFC;, &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xB4F1; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xAD00;&amp;#xCC30;&amp;#xD558;&amp;#xACE0; &amp;#xAE30;&amp;#xB85D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; Pin&amp;#xC758; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74;, JIT &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758; pintool&amp;#xC744; &amp;#xC8FC;&amp;#xC785;&amp;#xD558;&amp;#xACE0;, &amp;#xC9C0;&amp;#xC815;&amp;#xD55C; &amp;#xAD6C;&amp;#xAC04;&amp;#xC758; trace&amp;#xB97C; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xC9D1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;TRACE_AddInstrumentFunction(OnTrace, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);

&lt;span class=&#34;hljs-function&#34;&gt;VOID &lt;span class=&#34;hljs-title&#34;&gt;OnTrace&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(TRACE t, VOID*)&lt;/span&gt; &lt;/span&gt;{
&amp;#xA0;&amp;#xA0;&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; (BBL b = TRACE_BblHead(t); BBL_Valid(b); b = BBL_Next(b)) {
&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; (INS i = BBL_InsHead(b); INS_Valid(i); i = INS_Next(i)) {
&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xC2E4;&amp;#xC81C; &amp;#xD6C5; &amp;#xC0BD;&amp;#xC785;&lt;/span&gt;
&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;}
&amp;#xA0;&amp;#xA0;}
}
&lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xB4F1;&amp;#xB85D;&lt;/span&gt;
TRACE_AddInstrumentFunction(OnTrace, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Pin&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC21C;&amp;#xC11C;&amp;#xB97C; &amp;#xB530;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xB54C; Pin&amp;#xC774; &lt;strong&gt;&amp;#xCF54;&amp;#xB4DC; &amp;#xBE14;&amp;#xB85D;(Trace)&lt;/strong&gt; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xAC00;&amp;#xB85C;&amp;#xCC55;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Pin&amp;#xC740; &amp;#xD574;&amp;#xB2F9; Trace&amp;#xB97C; &amp;#xC989;&amp;#xC2DC; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xB4F1;&amp;#xB85D;&amp;#xD55C; &lt;code&gt;&amp;#xCF5C;&amp;#xBC31; &amp;#xD568;&amp;#xC218;(OnTrace)&lt;/code&gt;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;OnTrace &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; hook&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC77C;&amp;#xBA85; &amp;#xCF54;&amp;#xB4DC; &amp;#xB07C;&amp;#xC6CC;&amp;#xB123;&amp;#xAE30;)&lt;/li&gt;
&lt;li&gt;&amp;#xC6D0;&amp;#xBCF8; &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xC0BD;&amp;#xC785;&amp;#xB41C; &amp;#xBD84;&amp;#xC11D; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xD569;&amp;#xCCD0;&amp;#xC838; JIT &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB418;&amp;#xBA70;, &amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#x201C;&amp;#xC6D0;&amp;#xBCF8; &amp;#xB3D9;&amp;#xC791; + &amp;#xAE30;&amp;#xB85D; &amp;#xAE30;&amp;#xB2A5;&amp;#x201D;&amp;#xC744; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC704; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Pin&amp;#xC740; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAE30;&amp;#xACC4;&amp;#xC5B4; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC65C;&amp;#xACE1; &amp;#xC5C6;&amp;#xC774; &amp;#xAE30;&amp;#xB85D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;./pin -t ./source/tools/VMP_Trace/obj-intel64/VMP_Trace.so \
  -start &lt;span class=&#34;hljs-number&#34;&gt;0x401156&lt;/span&gt; -end &lt;span class=&#34;hljs-number&#34;&gt;0x4011AA&lt;/span&gt; \
  -- ./bitwise.vmp.bin &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt; &amp;amp;&amp;gt; ./bitwise.vmp.trace&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Trace&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB358; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC758; start address(&lt;code&gt;0x401156&lt;/code&gt;), end address(&lt;code&gt;0x4011AA&lt;/code&gt;), &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC778;&amp;#xC790;&amp;#xAC00; &amp;#xBA87; &amp;#xAC1C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294;&amp;#xC9C0; &amp;#xC815;&amp;#xB3C4; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC8FC;&amp;#xC18C; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C;, Intel Pin &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; trace&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0DD;&amp;#xC131;&amp;#xB41C; trace &amp;#xD30C;&amp;#xC77C; &amp;#xB0B4;&amp;#xBD80;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74;, pin&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; bitwise.vmp.bin&amp;#xC744; &lt;code&gt;flag=0&lt;/code&gt; &amp;#xC778;&amp;#xC790;&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC744; &amp;#xB54C;, &amp;#xC9C0;&amp;#xC815;&amp;#xD55C; &amp;#xBC94;&amp;#xC704; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; CPU&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAE30;&amp;#xACC4;&amp;#xC5B4; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xAE30;&amp;#xB85D;&amp;#xC744; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &lt;code&gt;r:&lt;/code&gt;, &lt;code&gt;i:&lt;/code&gt;&amp;#xB97C; &amp;#xD55C; &amp;#xC30D;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xB85D;&amp;#xD558;&amp;#xB294; &amp;#xD615;&amp;#xC2DD;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;r:&lt;/code&gt; (Registers): &lt;code&gt;i:&lt;/code&gt; &amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAE30; &amp;#xC774;&amp;#xC804;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; CPU &amp;#xBC94;&amp;#xC6A9; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; 16&amp;#xC9C4;&amp;#xC218; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xB85D;&amp;#xD55C; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;i:&lt;/code&gt; (Instruction): &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC790;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xC774;&amp;#xBA70;, &lt;code&gt;i:&amp;lt;&amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC8FC;&amp;#xC18C;&amp;gt;:&amp;lt;&amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xD06C;&amp;#xAE30;(byte)&amp;gt;:&amp;lt;&amp;#xAE30;&amp;#xACC4;&amp;#xC5B4; &amp;#xCF54;&amp;#xB4DC;(Opcode)&amp;gt;&lt;/code&gt; &amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C;&amp;#xB4E4;&amp;#xBA74; &lt;code&gt;i:0x401156:1:55&lt;/code&gt;&amp;#xB294; &lt;code&gt;0x401156&lt;/code&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC2DC;&amp;#xC791; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xAC8C; &amp;#xB2F4;&amp;#xACE0;&amp;#xC788;&amp;#xACE0;, &amp;#x2018;&lt;code&gt;0x55&lt;/code&gt;(&lt;code&gt;push rbp&lt;/code&gt;) &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xB2E4;&amp;#x2019;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; trace &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xC778;&amp;#xAC04;&amp;#xC774; &amp;#xC804;&amp;#xBD80; &amp;#xC77D;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xBC29;&amp;#xB300;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xC5D0; &amp;#xAC00;&amp;#xAE5D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. attack_vmp.py &amp;#xAC19;&amp;#xC740; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC6D0;&amp;#xBCF8; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xB2F4;&amp;#xC740; LLVM-IR&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;vbraddr(Virtual Branch Address) &amp;#xAD6C;&amp;#xD558;&amp;#xAE30;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xC758; &lt;strong&gt;&amp;#xC804;&amp;#xCCB4; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294;&lt;/strong&gt;, &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; Trace &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; VMProtect&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &lt;code&gt;jmp&lt;/code&gt;, &lt;code&gt;jz&lt;/code&gt;, &lt;code&gt;jnz&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC778; &amp;#xBD84;&amp;#xAE30; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB41C; &amp;#xBD84;&amp;#xB9AC; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xC6B0; attack &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB294; &amp;#xC774; &amp;#xACBD;&amp;#xB85C;&amp;#xB4E4;&amp;#xC774; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xC5B4;&amp;#xB290; &amp;#xC9C0;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC08;&amp;#xB77C;&amp;#xC84C;&amp;#xB294;&amp;#xC9C0; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; vbraddr &amp;#xC8FC;&amp;#xC18C; &amp;#xAC12;&amp;#xC744; &amp;#xC778;&amp;#xAC04;&amp;#xC774; IDA&amp;#xB85C; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xB123;&amp;#xC5B4;&amp;#xC8FC;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;. trace &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C; cmp&amp;#xB098; test &amp;#xAC19;&amp;#xC740; &amp;#xBE44;&amp;#xAD50; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xAC00; &amp;#xC704;&amp;#xCE58;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84; &amp;#xC911; &amp;#xAC00;&amp;#xC0C1; &amp;#xBD84;&amp;#xAE30;&amp;#xB97C; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xCC3E;&amp;#xC544;&amp;#xC8FC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD544;&amp;#xC790;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;0x4831A5&lt;/code&gt;&amp;#xAC00; &amp;#xAC00;&amp;#xC0C1; &amp;#xBD84;&amp;#xAE30; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774; vbraddr&amp;#xC774; &amp;#xD6C4;&amp;#xC5D0; CFG&amp;#xAC00; &amp;#xAC08;&amp;#xB77C;&amp;#xC9C0;&amp;#xB294; &amp;#xAE30;&amp;#xC900;&amp;#xC810;&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;attack_vmp.py &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xC758; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB294; &lt;a href=&#34;https://github.com/jonathansalwan/Triton&#34;&gt;Triton &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&lt;/a&gt;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Triton&amp;#xC740; Trace &amp;#xB0B4;&amp;#xC758; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xD574;&amp;#xC11D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC640; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xBCC0;&amp;#xC218;(symbolic variable)&amp;#xB85C; &amp;#xCD94;&amp;#xC801;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC640; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; AST(Abstract Syntax Tree) &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xAD00;&amp;#xB9AC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Triton&amp;#xC758; symbolic execution &amp;#xC5D4;&amp;#xC9C4;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; path predicate&amp;#xB97C; &amp;#xAD6C;&amp;#xCD95;&amp;#xD558;&amp;#xC5EC; &amp;#xC870;&amp;#xAC74; &amp;#xBD84;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC218;&amp;#xD559;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBAA8;&amp;#xB378;&amp;#xB9C1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; VMProtect &amp;#xB178;&amp;#xC774;&amp;#xC988;&amp;#xAC00; &amp;#xAD6C;&amp;#xCCB4;&amp;#xD654;(concretization) &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C1;&amp;#xC218; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xC5B4; &amp;#xC81C;&amp;#xAC70;&amp;#xB418;&amp;#xACE0;, simplification pass&amp;#xC640; formula slicing &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xC2DD;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xACFC; &amp;#xCD9C;&amp;#xB825; &amp;#xAD00;&amp;#xACC4;&amp;#xB9CC; &amp;#xB2F4;&amp;#xC740; &amp;#xC218;&amp;#xD559; &amp;#xD45C;&amp;#xD604;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E8;&amp;#xC21C;&amp;#xD654; &amp;#xD558;&amp;#xB294; &amp;#xC6D0;&amp;#xB9AC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;./attack_vmp.py \
  --trace1 ./bitwise.vmp.trace0 \
  --trace2 ./bitwise.vmp.trace1 \
  --trace3 ./bitwise.vmp.trace2 \
  --symsize &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt; \
  --vbraddr &lt;span class=&#34;hljs-number&#34;&gt;0x4831a5&lt;/span&gt; \
  --vbrflag af&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C; &amp;#xAC01;&amp;#xAC01; &amp;#xB2E4;&amp;#xB978; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC744; &amp;#xD0C0;&amp;#xB294; trace &amp;#xC138; &amp;#xAC1C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB123;&amp;#xC5B4;&amp;#xC8FC;&amp;#xACE0;, &lt;code&gt;&amp;#x2014;vbraddr&lt;/code&gt;&amp;#xACFC; &lt;code&gt;&amp;#x2014;vbrflag&lt;/code&gt; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xD568;&amp;#xAED8; &amp;#xC804;&amp;#xB2EC;&amp;#xD574;&amp;#xC90D;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xCC38;&amp;#xACE0;&amp;#xB85C; &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; attack_vmp &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB294; trace&amp;#xB97C; &amp;#xB450; &amp;#xAC1C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBC16;&amp;#xC5D0; &amp;#xBABB; &amp;#xC918;&amp;#xC11C; trace &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB354; &amp;#xB9CE;&amp;#xC774; &amp;#xC92C;&amp;#xC744; &amp;#xB54C; &amp;#xC774;&amp;#xB97C; &amp;#xC5F0;&amp;#xACB0;&amp;#xC9C0;&amp;#xC5B4; LLVM-IR&amp;#xB85C; &amp;#xACB0;&amp;#xD569;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &amp;#xAE30;&amp;#xB2A5;&amp;#xC73C;&amp;#xB85C; &amp;#xC870;&amp;#xAE08; &amp;#xD655;&amp;#xC7A5;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACFC;&amp;#xC5F0; &amp;#xC138; &amp;#xAC1C;&amp;#xC758; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC744; &amp;#xBCD1;&amp;#xD569;&amp;#xD574; CFG &amp;#xD615;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0DD;&amp;#xC131;&amp;#xB41C; LLVM-IR&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC6D0;&amp;#xBCF8; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &lt;code&gt;if-else&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xBE44;&amp;#xD2B8; &amp;#xC5F0;&amp;#xC0B0;(XOR, AND, OR) &amp;#xC870;&amp;#xD569;&amp;#xC744; &amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xAC8C; &amp;#xAD6C;&amp;#xD604;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (&lt;a href=&#34;https://llvm.org/docs/LangRef.html&#34;&gt;LLVM-IR Language&lt;/a&gt;&amp;#xAC00; &amp;#xAD81;&amp;#xAE08;&amp;#xD558;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774; &amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;p&gt;LLCM IR &amp;#xB9AC;&amp;#xD504;&amp;#xD305; &amp;#xACB0;&amp;#xACFC;, &lt;code&gt;%SymVar_0&lt;/code&gt;, &lt;code&gt;%SymVar_1&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; AND&amp;#xC640; OR &amp;#xC5F0;&amp;#xC0B0;&amp;#xC774;, &amp;#xADF8; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; XOR &amp;#xC5F0;&amp;#xC0B0;&amp;#xC774; &amp;#xAC01;&amp;#xAC01; &amp;#xC870;&amp;#xAC74; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xAC70;&amp;#xCCD0; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;-88&lt;/code&gt;, &lt;code&gt;==16&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xBE44;&amp;#xAD50;&amp;#xB294; VMProtect &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0BD;&amp;#xC785;&amp;#xB41C; &amp;#xB178;&amp;#xC774;&amp;#xC988;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xD575;&amp;#xC2EC; &amp;#xB85C;&amp;#xC9C1;&amp;#xACFC; &amp;#xBB34;&amp;#xAD00;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/11/banda/LLVM_based_VMP/ko/image12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&amp;#xB294; VMProtect&amp;#xB85C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; devirtualization &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB85C;, &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xBC18;&amp;#xD658; &amp;#xAC12;&amp;#xC774; select &amp;#xC5F0;&amp;#xC0B0;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xACB0;&amp;#xC815;&amp;#xB418;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; select &amp;#xB178;&amp;#xB4DC;&amp;#xB294; cond q&amp;#xB77C;&amp;#xB294; &amp;#xC870;&amp;#xAC74;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC67C;&amp;#xCABD;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &lt;code&gt;SymVar_0&lt;/code&gt;&amp;#xACFC; &lt;code&gt;SymVar_1&lt;/code&gt;&amp;#xC744; XOR&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C;, &amp;#xC624;&amp;#xB978;&amp;#xCABD;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xB610; &amp;#xB2E4;&amp;#xB978; select &amp;#xB178;&amp;#xB4DC;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB978;&amp;#xCABD;&amp;#xC758; select &amp;#xB178;&amp;#xB4DC;&amp;#xB294; cond p &amp;#xC870;&amp;#xAC74;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xCC38;&amp;#xC77C; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;SymVar_0&lt;/code&gt;&amp;#xACFC; &lt;code&gt;SymVar_1&lt;/code&gt;&amp;#xC744; OR&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C;, &amp;#xAC70;&amp;#xC9D3;&amp;#xC77C; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;SymVar_0&lt;/code&gt;&amp;#xACFC; &lt;code&gt;SymVar_1&lt;/code&gt;&amp;#xC744; AND&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Conclusion&#34;&gt;&lt;a href=&#34;#Conclusion&#34; class=&#34;headerlink&#34; title=&#34;Conclusion&#34;&gt;&lt;/a&gt;Conclusion&lt;/h1&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8EC; LLVM &amp;#xAE30;&amp;#xBC18;&amp;#xC758; devirtualization &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC740; &amp;#xB2E8;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB098; &amp;#xC18C;&amp;#xC218;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C4; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xACBD;&amp;#xB85C; &amp;#xC218;&amp;#xAC00; &amp;#xB9CE;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC77C;&amp;#xBD80; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xB204;&amp;#xB77D;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD604;&amp;#xC2E4;&amp;#xC801;&amp;#xC778; &amp;#xADDC;&amp;#xBAA8;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xC9C1; &amp;#xBB34;&amp;#xB9AC;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC774;&amp;#xBC88; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC740; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; part 1&amp;#xC744; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; part&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAD00;&amp;#xB828; &amp;#xB17C;&amp;#xBB38;&amp;#xB4E4;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC911;&amp;#xC810;&amp;#xC5D0; &amp;#xB450;&amp;#xC5B4; devirtualization &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC744; &amp;#xB2F4;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0;, virtualization &amp;#xBFD0;&amp;#xB9CC;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; options&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xD574;&amp;#xC81C; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://koreascience.kr/article/JAKO202106153172639.pub?&amp;amp;lang=ko&#34;&gt;https://koreascience.kr/article/JAKO202106153172639.pub?&amp;amp;lang=ko&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/JonathanSalwan/VMProtect-devirtualization/tree/main&#34;&gt;https://github.com/JonathanSalwan/VMProtect-devirtualization/tree/main&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://scienceon.kisti.re.kr/commons/util/originalView.do?cn=JAKO202025356104834&amp;amp;oCn=JAKO202025356104834&amp;amp;dbt=JAKO&amp;amp;journal=NJOU00291865&#34;&gt;https://scienceon.kisti.re.kr/commons/util/originalView.do?cn=JAKO202025356104834&amp;amp;oCn=JAKO202025356104834&amp;amp;dbt=JAKO&amp;amp;journal=NJOU00291865&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.kc-ml2.com/posts/blog_LLVM&#34;&gt;https://www.kc-ml2.com/posts/blog_LLVM&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/09/11/banda/LLVM_based_VMP/ko/main.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/09/11/banda/llvm_based_vmp/ko/">

  <title>[Research] LLVM based VMProtect Devirtualization: Part 1 (KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-09-11 17:00" pubdate>
      2025 9 11 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.9k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      97
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] LLVM based VMProtect Devirtualization: Part 1 (KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h1><p><img src="/2025/09/11/banda/LLVM_based_VMP/ko/image1.jpg" srcset="/img/loading.gif" alt></p>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;. &#xC624;&#xB298;&#xB3C4; &#xC5B4;&#xB514;&#xC11C;&#xC778;&#xAC00; &#xB3CC;&#xC544;&#xC628; banda&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xCF54;&#xB4DC; &#xB09C;&#xB3C5;&#xD654;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB294; &#xB300;&#xD45C;&#xC801;&#xC778; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC911;&#xC5D0; VMProtect, Themida&#xAC00; &#xC788;&#xB294;&#xB370;&#xC694;. &#xC774; &#xC911; VMProtect&#xB294; &#xD2B9;&#xD788; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;(VM) &#xAE30;&#xBC18;&#xC758; &#xAC00;&#xC0C1;&#xD654;, &#xB09C;&#xB3C5;&#xD654;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC73C;&#xB85C; &#xC54C;&#xB824;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. VMProtect&#xB294; non-standard &#xAC00;&#xC0C1; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xD1B5;&#xD574; &#xC6D0;&#xBCF8; &#xCF54;&#xB4DC;&#xB97C; &#xB3C5;&#xC790;&#xC801;&#xC778; &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;&#xB85C; &#xBCC0;&#xD658;&#xD558;&#xBA74;&#xC11C; &#xC815;&#xC801; &#xBD84;&#xC11D;, &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xB9E4;&#xC6B0; &#xC5B4;&#xB835;&#xAC8C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;. (&#xD639;&#xC2DC; &#xC774;&#xC804;&#xC5D0; &#xC791;&#xC131;&#xB41C; &#xB09C;&#xB3C5;&#xD654; &#xC5F0;&#xAD6C;&#xAE00;&#xC774; &#xAD81;&#xAE08;&#xD558;&#xB2E4;&#xBA74; <a href="https://hackyboiz.github.io/2025/04/28/OUYA77/Anti_part3/kr/">(&#x1F449;&#xC5EC;&#xAE30;&#xB85C; &#x314E;&#x314E;)</a>)</p>
<p>&#xADF8;&#xAC04; VMProtect &#xB09C;&#xB3C5;&#xD654; &#xD574;&#xC81C;&#xB97C; &#xC2DC;&#xB3C4;&#xD558;&#xB824;&#xB294; &#xB17C;&#xBB38;&#xACFC; &#xC5F0;&#xAD6C;&#xAC00; &#xAFB8;&#xC900;&#xD788; &#xC81C;&#xACF5;&#xB418;&#xC5B4; &#xC654;&#xB294;&#xB370;, &#xC624;&#xB298; &#xD544;&#xC790;&#xB294; &#xC774;&#xC640; &#xAC19;&#xC740; &#xC5F0;&#xAD6C; &#xC911; &#xD2B9;&#xD788; LLVM&#xC744; &#xD65C;&#xC6A9;&#xD55C; &#xB09C;&#xB3C5;&#xD654; &#xD574;&#xC81C; &#xBC29;&#xBC95;&#xB860;&#xC744; &#xC911;&#xC2EC;&#xC73C;&#xB85C; &#xC0B4;&#xD3B4;&#xBCF4;&#xACE0;, &#xB09C;&#xB3C5;&#xD654; &#xD574;&#xC81C;&#xAC00; &#xC5B4;&#xB290; &#xC2E4;&#xD604; &#xAC00;&#xB2A5;&#xD560;&#xC9C0; &#xC0B4;&#xD3B4;&#xBCF4;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. (&#xB2E4;&#xB9CC; &#xC774;&#xBC88; &#xAE00;&#xC5D0;&#xC11C;&#xB294; VMP &#xBCF4;&#xD638; &#xC635;&#xC158; &#xC911; &#xAC00;&#xC0C1;&#xD654; &#xC635;&#xC158;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB9CC; &#xC9D1;&#xC911;&#xC801;&#xC73C;&#xB85C; &#xB2E4;&#xB8F9;&#xB2C8;&#xB2E4;.)</p>
<h1 id="VMProtect"><a href="#VMProtect" class="headerlink" title="VMProtect"></a>VMProtect</h1><p><img src="/2025/09/11/banda/LLVM_based_VMP/ko/image2.png" srcset="/img/loading.gif" alt></p>
<p>VMProtect&#xB294; Anti-Reversing &#xAE30;&#xBC95;&#xC744; &#xC801;&#xC6A9;&#xD574; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xBCF4;&#xD638;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC785;&#xB2C8;&#xB2E4;. &#xACF5;&#xC2DD; &#xBB38;&#xC11C;&#xC5D0; &#xB530;&#xB974;&#xBA74; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xCF54;&#xB4DC; &#xBCF4;&#xD638;&#xC640; &#xD06C;&#xB799; &#xBC29;&#xC9C0;&#xB97C; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xB418;&#xBA70;, &#xC790;&#xCCB4; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; &#xC5B8;&#xC5B4;&#xC640; &#xB0B4;&#xC7A5; &#xB514;&#xC2A4;&#xC5B4;&#xC148;&#xBE14;&#xB7EC;&#xB97C; &#xC81C;&#xACF5;&#xD574; &#xBCF4;&#xD638;&#xD560; &#xCF54;&#xB4DC; &#xC601;&#xC5ED;&#xACFC; &#xBE4C;&#xB4DC; &#xB3D9;&#xC791;&#xC744; &#xC138;&#xBC00;&#xD558;&#xAC8C; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xACE0;, &#xC8FC;&#xB85C; Windows &#xAE30;&#xBC18; &#xB124;&#xC774;&#xD2F0;&#xBE0C; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;(C/C++, Delphi, Visual Basic)&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB09C;&#xB3C5;&#xD654;&#xB97C; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>VMProtect 3.9.6 &#xAE30;&#xC900;&#xC73C;&#xB85C; &#xB09C;&#xB3C5;&#xD654; &#xC635;&#xC158;&#xC740; &#x2460;Memory Protection, &#x2461;Import Protection, &#x2462;Resource Protection, &#x2463;Pack the Output File, &#x2464;Debugger Detection, &#x2465;Virtualization Tools Dectection, &#x2466;Virtualization&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.<br>&#xC774; &#xC911;&#xC5D0;&#xC11C;&#xB3C4; <strong>Virtualization(&#xAC00;&#xC0C1;&#xD654;)</strong>&#xC740; &#xAC15;&#xB825;&#xD55C; &#xBCF4;&#xD638; &#xAE30;&#xBC95;&#xC73C;&#xB85C;, &#xC6D0;&#xB798;&#xC758; x86/x64 &#xCF54;&#xB4DC;&#xB97C; VMProtect&#xAC00; <strong>&#xC815;&#xC758;&#xD55C; &#xCEE4;&#xC2A4;&#xD140; &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;</strong>&#xB85C; &#xBCC0;&#xD658;&#xD55C; &#xB4A4;, &#xC2E4;&#xD589; &#xC2DC; &#xB0B4;&#xC7A5;&#xB41C; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC774; &#xC774;&#xB97C; &#xD574;&#xC11D;&#xD574; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xD558;&#xB098;&#xC758; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xC548;&#xC5D0;&#xC11C;&#xB3C4; &#xC5EC;&#xB7EC; &#xC885;&#xB958;&#xC758; VM&#xC774; &#xD63C;&#xD569;&#xB420; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xC5D4;&#xD2B8;&#xB9AC;&#xD3EC;&#xC778;&#xD2B8;&#xB97C; &#xD3EC;&#xD568;&#xD574; &#xB2E4;&#xC591;&#xD55C; &#xC704;&#xCE58;&#xB97C; &#xC120;&#xD0DD;&#xC801;&#xC73C;&#xB85C; &#xAC00;&#xC0C1;&#xD654;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="VMProtect-with-LLVM"><a href="#VMProtect-with-LLVM" class="headerlink" title="VMProtect with LLVM"></a>VMProtect with LLVM</h1><p>LLVM&#xC744; &#xD65C;&#xC6A9;&#xD55C; VMProtect &#xBD84;&#xC11D;&#xC740; &#xADF8;&#xB3D9;&#xC548; VM&#xC758; &#xB0B4;&#xBD80; &#xAD6C;&#xC870;&#xB97C; &#xC774;&#xD574;&#xD558;&#xB824;&#xB294; &#xC815;&#xC801; &#xB9AC;&#xD504;&#xD305;(Static Lifting)&#xACFC;, &#xB0B4;&#xBD80; &#xAD6C;&#xC870; &#xB300;&#xC2E0; &#xB3D9;&#xC791; &#xACB0;&#xACFC;&#xC5D0; &#xC9D1;&#xC911;&#xD558;&#xB294; &#xB3D9;&#xC801; &#xD2B8;&#xB808;&#xC774;&#xC2F1;(Dynamic Tracing) &#xB450; &#xAC00;&#xC9C0; &#xCF00;&#xC774;&#xC2A4;&#xB85C; &#xC5F0;&#xAD6C;&#xAC00; &#xC9C4;&#xD589;&#xB41C; &#xBC14; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xC815;&#xC801; &#xB9AC;&#xD504;&#xD305; (Static Lifting)</li>
</ul>
<p>&#xCCAB; &#xBC88;&#xC9F8; &#xC811;&#xADFC;&#xBC95;&#xC5D0;&#xC11C;&#xB294; VM &#xB0B4;&#xBD80;&#xB97C; White-Box&#xB85C; &#xAC04;&#xC8FC;&#xD574; &#xC815;&#xC801; &#xB9AC;&#xD504;&#xD305;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xC811;&#xADFC;&#xBC95;&#xC744; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74;  <code>VmHandler</code>(VMProtect&#xC5D0;&#xC11C; VM&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xAC01; &#xAC00;&#xC0C1; &#xBA85;&#xB839;&#xC5B4; &#xD578;&#xB4E4;&#xB7EC;)&#xB97C; &#xC77C;&#xC77C;&#xC774; &#xB9AC;&#xBC84;&#xC2F1;&#xD558;&#xC5EC; &#xADF8; &#xB3D9;&#xC791;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xACE0;, &#xC774;&#xB97C; C++&#xB97C; &#xD1B5;&#xD574; <code>Helper Function</code>&#xB85C; &#xC7AC;&#xAD6C;&#xD604;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xD6C4; &#xBCF4;&#xD638;&#xB41C; &#xCF54;&#xB4DC;&#xC758; VM &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;&#xB97C; &#xC774; <code>Helper Function</code> &#xD638;&#xCD9C;&#xC758; &#xC5F0;&#xC18D;&#xC73C;&#xB85C; &#xBC88;&#xC5ED;&#xD574; &#xC804;&#xCCB4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; LLVM-IR&#xB85C; &#xBCC0;&#xD658;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB9CC; &#xC704; &#xC811;&#xADFC;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD574; VM &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC5D0; &#xB300;&#xD55C; &#xAE4A;&#xC740; &#xC774;&#xD574;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. <a target="_blank" rel="external nofollow noopener noreferrer" href="https://secret.club/2021/09/08/vmprotect-llvm-lifting-1.html">(reference)</a></p>
<ul>
<li>&#xB3D9;&#xC801; &#xD2B8;&#xB808;&#xC774;&#xC2F1; (Dynamic Tracing)</li>
</ul>
<p>&#xB450; &#xBC88;&#xC9F8; &#xC811;&#xADFC;&#xBC95;&#xC740; &#xB3D9;&#xC801; &#xD2B8;&#xB808;&#xC774;&#xC2F1;&#xC744; &#xD1B5;&#xD574; VM&#xC744; &#xC2E4;&#xD589;&#xC2DC;&#xCF1C; <strong>&#xC785;&#xB825;&#xACFC; &#xCD9C;&#xB825; &#xC0AC;&#xC774;&#xC758; &#xAD00;&#xACC4;&#xB9CC; &#xCD94;&#xC801;&#xD574; &#xD568;&#xC218; &#xB09C;&#xB3C5;&#xD654;&#xB97C; &#xD574;&#xC81C;</strong>&#xD558;&#xB294; Black-Box &#xBC29;&#xC2DD;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD2B9;&#xC815; &#xC785;&#xB825;&#xC744; &#xC8FC;&#xACE0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD574; &#xC2E4;&#xD589;&#xB41C; &#xBAA8;&#xB4E0; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#x2018;trace&#x2019;&#xB85C; &#xAE30;&#xB85D;&#xD558;&#xACE0;, &#xC774; &#xD754;&#xC801;&#xC744; &#xC2EC;&#xBCFC;&#xB9AD; &#xC2E4;&#xD589;&#xC73C;&#xB85C; &#xC7AC;&#xAD6C;&#xC131;&#xD574; &#xC785;&#xCD9C;&#xB825; &#xAD00;&#xACC4;&#xC2DD;&#xC744; &#xB3C4;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;. <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/JonathanSalwan/VMProtect-devirtualization">(reference)</a></p>
<p><strong>LLVM IR&#xACFC; SSA (Single Static Assignment)</strong></p>
<p><img src="/2025/09/11/banda/LLVM_based_VMP/ko/image3.png" srcset="/img/loading.gif" alt></p>
<p>LLVM IR&#xC740; <strong>SSA(Static Single Assignment)</strong> &#xD615;&#xC2DD;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD558;&#xB294; &#xC911;&#xAC04; &#xD45C;&#xD604;(Intermediate Representation, IR)&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. SSA(Static Single Assignment)&#xB780;, &#xBCC0;&#xC218;&#xAC00; &#xD55C; &#xBC88;&#xB9CC; &#xD560;&#xB2F9;&#xB41C;&#xB2E4;&#xB294; &#xC6D0;&#xCE59;&#xC744; &#xB530;&#xB974;&#xBA70;, &#xC0C8;&#xB85C;&#xC6B4; &#xAC12;&#xC774; &#xACC4;&#xC0B0;&#xB420; &#xB54C;&#xB9C8;&#xB2E4; &#xC0C8;&#xB85C;&#xC6B4; &#xAC00;&#xC0C1; &#xB808;&#xC9C0;&#xC2A4;&#xD130;(SSA &#xBCC0;&#xC218;)&#xAC00; &#xC0DD;&#xC131;&#xB418;&#xB294; &#xC6D0;&#xB9AC;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xB798; &#xC5B4;&#xC148;&#xBE14;&#xB9AC; &#xCF54;&#xB4DC;&#xC640; LLVM IR &#xCF54;&#xB4DC;&#xB97C; &#xBE44;&#xAD50;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<pre><code class="hljs python">add rax, rcx
sub rdx, rbx
sub rax, rdx</code></pre>
<pre><code class="hljs llvm"><span class="hljs-symbol">%rax2</span> = <span class="hljs-keyword">add</span> <span class="hljs-keyword">i64</span> <span class="hljs-symbol">%rax</span>, <span class="hljs-symbol">%rcx</span>
<span class="hljs-symbol">%rdx2</span> = <span class="hljs-keyword">sub</span> <span class="hljs-keyword">i64</span> <span class="hljs-symbol">%rdx</span>, <span class="hljs-symbol">%rbx</span>
<span class="hljs-symbol">%rax3</span> = <span class="hljs-keyword">sub</span> <span class="hljs-keyword">i64</span> <span class="hljs-symbol">%rax2</span>, <span class="hljs-symbol">%rdx2</span></code></pre>
<p>LLVM IR &#xCF54;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; <code>%rax1</code>, <code>%rax2</code>&#xCC98;&#xB7FC; &#xBCC0;&#xC218; &#xC774;&#xB984;&#xC774; &#xACC4;&#xC18D; &#xBC14;&#xB00C;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;. &#xC774;&#xC720;&#xB294; &#xD55C; &#xBC88; &#xC815;&#xC758;&#xB41C; SSA &#xBCC0;&#xC218;&#xAC00; &#xB2E4;&#xC2DC; &#xB36E;&#xC5B4;&#xC4F0;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xC6D0;&#xCE59; &#xB54C;&#xBB38;&#xC774;&#xACA0;&#xC8E0;?! &#xB530;&#xB77C;&#xC11C; &#xB370;&#xC774;&#xD130; &#xD750;&#xB984;&#xACFC; &#xC5F0;&#xC0B0; &#xACB0;&#xACFC;&#xB97C; &#xBA85;&#xD655;&#xD788; &#xCD94;&#xC801;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC7A5;&#xC810;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>&#xC774;&#xB7F0; SSA &#xD615;&#xC2DD;&#xC758; LLVM-IR&#xC774; &#xC65C; VMProtect &#xAC00;&#xC0C1;&#xD654; &#xD574;&#xC81C;&#xC5D0; &#xC911;&#xC694;&#xD560;&#xAE4C;&#xC694;?</strong></p>
<p>VMProtect&#xC758; &#xAC00;&#xC0C1;&#xD654; &#xD578;&#xB4E4;&#xB7EC;&#xB294; &#xC218;&#xCC9C; &#xAC1C;, &#xADF8; &#xC774;&#xC0C1;&#xC758; &#xBE44;&#xD2B8; &#xC5F0;&#xC0B0;, &#xC2DC;&#xD504;&#xD2B8;, &#xC0B0;&#xC220; &#xC5F0;&#xC0B0;&#xC744; &#xB4A4;&#xC11E;&#xC5B4; &#xB178;&#xC774;&#xC988;&#xB97C; &#xB9CC;&#xB4E4;&#xBA70;, &#xC6D0;&#xB798; &#xC5F0;&#xC0B0;&#xC744; &#xAC10;&#xCD94;&#xAE30; &#xC704;&#xD574; <strong>MBA(Mixed Boolen-Arithmetic)</strong>&#xACFC; &#xAC19;&#xC740; &#xBCF5;&#xC7A1;&#xD55C; &#xC218;&#xC2DD;&#xC744; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. VMProtect &#xAC00;&#xC0C1;&#xD654;&#xC758; MBA &#xD45C;&#xD604;&#xC2DD;&#xC758; &#xC608;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs llvm">(bvor
    (bvnot (bvor (bvnot (bvnot <span class="hljs-keyword">x</span>)) (bvnot y)))
    (bvnot (bvor (bvnot <span class="hljs-keyword">x</span>) (bvnot (bvand (bvnot y) (bvnot y)))))
)</code></pre>
<p>&#xC704; &#xC2DD;&#xC740; &#xB2E8;&#xC21C;&#xD55C; <code>x^y</code> &#xC5F0;&#xC0B0;&#xACFC; &#xB3D9;&#xC77C;&#xD558;&#xC9C0;&#xB9CC;, &#xC9C1;&#xAD00;&#xC801;&#xC73C;&#xB85C; &#xD30C;&#xC545;&#xD558;&#xAE30;&#xB294; &#xC5B4;&#xB835;&#xC8E0;?</p>
<p>&#xC774;&#xCC98;&#xB7FC; &#xBCF5;&#xC7A1;&#xD558;&#xAC8C; &#xD615;&#xC131;&#xB418;&#xC5B4;&#xC788;&#xB294; &#xD45C;&#xD604;&#xC2DD;&#xC744; SSA &#xAE30;&#xBC18;&#xC758; LLVM IR&#xB85C; &#xBCC0;&#xD658;&#xD558;&#xBA74; &#xB370;&#xC774;&#xD130; &#xD750;&#xB984;&#xC774; &#xBA85;&#xD655;&#xD574;&#xC9C0;&#xACE0;, LLVM &#xCD5C;&#xC801;&#xD654;(Constant Propagation, Dead Code Elimination, Pattern Recognition &#xB4F1;)&#xB97C; &#xD1B5;&#xD574; &#xBD88;&#xD544;&#xC694;&#xD55C; &#xC5F0;&#xC0B0;&#xACFC; &#xB178;&#xC774;&#xC988;&#xB97C; &#xC81C;&#xAC70;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xC218;&#xB9CC; &#xAC1C;&#xC758; VMP &#xBA85;&#xB839;&#xC5B4;&#xAC00; &#xC218;&#xC2ED; &#xAC1C;&#xC758; SSA IR&#xB85C; &#xCD95;&#xC57D;&#xB418;&#xBA74;&#xC11C; &#xC6D0;&#xBCF8; &#xC5F0;&#xC0B0;&#xC5D0; &#xAC00;&#xAE4C;&#xC6B4; &#xD615;&#xD0DC;&#xB97C; &#xBCF5;&#xC6D0;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;!</p>
<h1 id="Devirtualization"><a href="#Devirtualization" class="headerlink" title="Devirtualization"></a>Devirtualization</h1><p>&#xC774;&#xBC88; &#xC5F0;&#xAD6C;&#xAE00;&#xC5D0;&#xC11C;&#xB294; &#xC815;&#xC801; &#xB9AC;&#xD504;&#xD305;&#xC744; &#xD1B5;&#xD574; VM &#xAD6C;&#xC870;&#xB97C; &#xC774;&#xD574;&#xD55C; &#xACBD;&#xD5D8;&#xC744; &#xBC14;&#xD0D5;&#xC73C;&#xB85C;, &#xB3D9;&#xC801; &#xD2B8;&#xB808;&#xC774;&#xC2F1; &#xAE30;&#xBC18; &#xD574;&#xC81C; &#xC811;&#xADFC;&#xBC95;&#xC744; &#xCC38;&#xACE0;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; Jonathan Salwan&#xC758; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/JonathanSalwan/VMProtect-devirtualization"><strong>VMProtect-devirtualization Project</strong></a>&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xB3D9;&#xC801; &#xD2B8;&#xB808;&#xC774;&#xC2F1; &#xAE30;&#xBC18; &#xD574;&#xC81C;&#xB97C; &#xC9C4;&#xD589;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>pure function</li>
</ul>
<pre><code class="hljs c"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdint.h&gt;</span></span>
<span class="hljs-function"><span class="hljs-keyword">uint32_t</span> <span class="hljs-title">f</span><span class="hljs-params">(<span class="hljs-keyword">uint32_t</span> x)</span> </span>{
  x ^= <span class="hljs-number">0xA3C59AC3</span>u;
  x = (x &lt;&lt; <span class="hljs-number">7</span>) | (x &gt;&gt; <span class="hljs-number">25</span>);
  x += <span class="hljs-number">0x9E3779B9</span>u;
  <span class="hljs-keyword">return</span> x;
}</code></pre>
<p>&#xC2E4;&#xC2B5; &#xB300;&#xC0C1;&#xC740; &#xC21C;&#xC218; &#xD568;&#xC218;(pure function)&#xB97C; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xD558;&#xB294;&#xB370;, &#xC21C;&#xC218; &#xD568;&#xC218;&#xB780; &#xAC19;&#xC740; &#xC785;&#xB825;&#xC774;&#xBA74; &#xD56D;&#xC0C1; &#xAC19;&#xC740; &#xCD9C;&#xB825;&#xC744; &#xB0B4;&#xACE0;, random, global, &#xBCC0;&#xC218;, I/O &#xB4F1;&#xC5D0; &#xC758;&#xC874;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xD2B9;&#xC131; &#xB355;&#xBD84;&#xC5D0; devirtualization&#xC5D0; &#xC801;&#xD569;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="How-It-Works"><a href="#How-It-Works" class="headerlink" title="How It Works?"></a><strong>How It Works?</strong></h3><pre><code class="hljs llvm">&#xAC00;&#xC0C1;&#xD654;&#xB41C; &#xCF54;&#xB4DC;&#xC758; &#xC2E4;&#xD589; &#xAE30;&#xB85D; (T&#x2019;) =
&#xC6D0;&#xBCF8; &#xCF54;&#xB4DC;&#xC758; &#xC2E4;&#xD589; &#xAE30;&#xB85D; (T) + &#xAC00;&#xC0C1; &#xBA38;&#xC2E0;(VM) &#xBA85;&#xB839;&#xC5B4;&#xC758; &#xC2E4;&#xD589; &#xAE30;&#xB85D; (VM(T))</code></pre>
<p><strong>&#xC2E4;&#xD589;&#xAE30;&#xB85D;(Trace)</strong>&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC2E4;&#xD589;&#xB420; &#xB54C; CPU&#xAC00; &#xCC98;&#xB9AC;&#xD55C; &#xBA85;&#xB839;&#xC5B4;&#xB4E4;&#xC758; &#xBAA9;&#xB85D;&#xC744; &#xC2DC;&#xAC04; &#xC21C;&#xC11C;&#xB300;&#xB85C; &#xBC1B;&#xC544; &#xC801;&#xC740; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xBCF4;&#xBA74; &#xC27D;&#xC2B5;&#xB2C8;&#xB2E4;.  &#xBAA9;&#xD45C;&#xB294; T&#x2019;&#xC5D0;&#xC11C; VM(T)&#xB77C;&#xB294; &#xB178;&#xC774;&#xC988;&#xB97C; &#xC81C;&#xAC70;&#xD558;&#xACE0; &#xC21C;&#xC218;&#xD55C; T&#xB97C; &#xBCF5;&#xC6D0;&#xD558;&#xB294; &#xAC83;&#xC774;&#xACE0;, &#xB3D9;&#xC791; &#xC6D0;&#xB9AC;&#xB294; &#xC544;&#xB798;&#xC758; 5&#xB2E8;&#xACC4; &#xC808;&#xCC28;&#xB97C; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<ol>
<li><p><strong>Identify the virtualized function and its arguments</strong></p>
<p> &#xC804;&#xCCB4; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC911; &#xC5B4;&#xB5A4; &#xBD80;&#xBD84;&#xC774; VMProtect&#xB85C; &#xBCF4;&#xD638;&#xB418;&#xC5B4; &#xC788;&#xB294;&#xC9C0;, &#xADF8;&#xB9AC;&#xACE0; &#xBCF4;&#xD638;&#xB41C; &#xD568;&#xC218;&#xAC00; &#xC5B4;&#xB5A4; &#xC778;&#xC790;&#xB97C; &#xBC1B;&#xC544;&#xC11C; &#xCC98;&#xB9AC;&#xD558;&#xB294;&#xC9C0; &#xCC3E;&#xC544;&#xB0C5;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p><strong>Generate a VMProtect Trace of the target</strong></p>
<p> (&#xB2E8;&#xACC4; 1)&#xC5D0;&#xC11C; &#xCC3E;&#xC544;&#xB0B8; &#xBCF4;&#xD638;&#xB41C; &#xD568;&#xC218;&#xB97C; &#xC2E4;&#xC81C;&#xB85C; &#xC2E4;&#xD589;&#xC2DC;&#xCF1C;, &#xC5B4;&#xB5A4; &#xBA85;&#xB839;&#xC5B4;&#xB4E4;&#xC774; &#xC5B4;&#xB5A4; &#xC21C;&#xC11C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294;&#xC9C0;(CPU&#xAC00; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xBA85;&#xB839;&#xC5B4; &#xBAA9;&#xB85D;) &#xC804;&#xCCB4; &#xAE30;&#xB85D;(trace)&#xB97C; &#xC218;&#xC9D1;&#xD569;&#xB2C8;&#xB2E4;. </p>
</li>
<li><p><strong>Construct symbolic expressions to obtain the relation between inputs and output</strong></p>
<p> (&#xB2E8;&#xACC4; 2)&#xC5D0;&#xC11C; &#xC5BB;&#xC740; &#xBA85;&#xB839;&#xC5B4; &#xAE30;&#xB85D;&#xC744; &#xBD84;&#xC11D;&#xD569;&#xB2C8;&#xB2E4;. &#xC2E4;&#xC81C; &#xAC12; &#xB300;&#xC2E0; &#xBCC0;&#xC218;(symbolic variable)&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xC11C;, &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; &#xC5B4;&#xB5A4; &#xACC4;&#xC0B0;&#xC744; &#xD558;&#xB294;&#xC9C0; &#xC218;&#xD559; &#xD45C;&#xD604;&#xC2DD;&#xC73C;&#xB85C; &#xC815;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p><strong>Apply optimizations on symbolic expressions to avoid as much as possible instructions from the VM</strong></p>
<p> (&#xB2E8;&#xACC4; 3)&#xC5D0;&#xC11C; &#xB9CC;&#xB4E0; &#xC218;&#xD559; &#xD45C;&#xD604;&#xC2DD;&#xC744; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC815;&#xC758;&#xD558;&#xACE0;, &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; VM&#xC744; &#xC2E4;&#xD589;&#xC2DC;&#xD0A4;&#xAE30; &#xC704;&#xD55C; &#xBD88;&#xD544;&#xC694;&#xD55C; &#xBA85;&#xB839;&#xC5B4;&#xB4E4;&#xC5D0; &#xD574;&#xB2F9;&#xB418;&#xB294; &#xBD80;&#xBD84;&#xC744; &#xC81C;&#xAC70;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p><strong>Lift our symbolic representation to the LLVM-IR</strong></p>
<p> (&#xB2E8;&#xACC4; 4)&#xC5D0;&#xC11C; &#xCC3E;&#xC544;&#xB0B8; &#xD575;&#xC2EC; &#xB85C;&#xC9C1;&#xC744; LLVM-IR(&#xD2B9;&#xC815; CPU&#xC5D0; &#xC885;&#xC18D;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xBC94;&#xC6A9;&#xC801;&#xC778; &#xCF54;&#xB4DC; &#xD615;&#xD0DC;) &#xC911;&#xAC04; &#xB2E8;&#xACC4; &#xCF54;&#xB4DC;&#xB85C; &#xBCC0;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xC774; LLVM-IR&#xC744; &#xB2E4;&#xC2DC; &#xCEF4;&#xD30C;&#xC77C; &#xD558;&#xBA74;, VMProtect &#xBCF4;&#xD638;&#xAC00; &#xC801;&#xC6A9;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xAE68;&#xB057;&#xD55C; &#xBC84;&#xC804;&#xC758; &#xC6D0;&#xBCF8; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xB0BC; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
<p>&#xC774; &#xACFC;&#xC815;&#xC744; &#xD1B5;&#xD574; &#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; VMProtect &#xB09C;&#xB3C5;&#xD654;&#xAC00; &#xC81C;&#xAC70;&#xB41C; LLVM-IR&#xC744; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="Example-Bitwise-Function"><a href="#Example-Bitwise-Function" class="headerlink" title="Example: Bitwise Function"></a>Example: Bitwise Function</h3><pre><code class="hljs c"><span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">bitwise_func</span><span class="hljs-params">(<span class="hljs-keyword">int</span> a, <span class="hljs-keyword">int</span> b, <span class="hljs-keyword">int</span> flag)</span> </span>{
    VMProtectBegin(<span class="hljs-string">&quot;bitwise_func&quot;</span>);
    <span class="hljs-keyword">int</span> r;
    <span class="hljs-keyword">if</span> (flag == <span class="hljs-number">0</span>)
        r = a &amp; b;
    <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (flag == <span class="hljs-number">1</span>)
        r = a | b;
    <span class="hljs-keyword">else</span>
        r = a ^ b;
    VMProtectEnd();
    <span class="hljs-keyword">return</span> r;
}</code></pre>
<p>&#xC81C;&#xACF5;&#xB41C; &#xC608;&#xC81C;&#xC5D0;&#xC11C;&#xB294; &#xB2E8;&#xC21C; &#xC0B0;&#xC220; &#xC5F0;&#xC0B0;&#xC744; &#xC120;&#xC815;&#xD588;&#xC9C0;&#xB9CC; &#xC800;&#xB294; control flow&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xBE4C;&#xB4DC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCC38;&#xACE0;&#xB85C; &#xB2E8;&#xC21C; &#xC5F0;&#xC0B0; &#xCF54;&#xB4DC;&#xAC00; &#xC544;&#xB2CC; &#xBD84;&#xAE30;&#xBB38;&#xC744; &#xD3EC;&#xD568;&#xD55C; &#xD568;&#xC218;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; trace&#xB97C; &#xC5EC;&#xB7EC; &#xAC1C; &#xC0DD;&#xC131;&#xD574;&#xC57C;&#xB9CC; &#xB85C;&#xC9C1;&#xC744; &#xBCF5;&#xC6D0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. LLCM-IR &#xBAA8;&#xB4C8;&#xC740; CFG(Control Flow Graph)&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xAC01; &#xBD84;&#xAE30;&#xBB38;&#xC73C;&#xB85C;&#xBD80;&#xD130; &#xC5BB;&#xC740; trace&#xB4E4;&#xC744; CFG&#xB85C; &#xBCD1;&#xD569;&#xD558;&#xAE30; &#xC704;&#xD574; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xACFC;&#xC815;&#xC774; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/09/11/banda/LLVM_based_VMP/ko/image4.png" srcset="/img/loading.gif" alt></p>
<p>VMProtect&#xC5D0;&#xC11C; &#xAC00;&#xC0C1;&#xD654; &#xC635;&#xC158;&#xC744; &#xC801;&#xC6A9;&#xD558;&#xAE30; &#xC804;&#xD6C4; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xBE44;&#xAD50;&#xD574;&#xBCF4;&#xBA74; &#xD30C;&#xC77C; &#xD06C;&#xAE30;&#xAC00; &#xC5B4;&#xB9C8;&#xC5B4;&#xB9C8;&#xD558;&#xAC8C; &#xCEE4;&#xC9C0;&#xB294; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6D0;&#xBCF8; &#xCF54;&#xB4DC;&#xAC00; VMProtect&#xC758; &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;&#xB85C; &#xBCC0;&#xD658;&#xB418;&#xACE0;, &#xC774;&#xB97C; &#xD574;&#xC11D;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;(Interpreter)&#xC774; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0; &#xCD94;&#xAC00;&#xB418;&#xC5C8;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. (&#xC5EC;&#xB2F4;&#xC774;&#xC9C0;&#xB9CC; &#xC774;&#xB7EC;&#xD55C; &#xD06C;&#xAE30; &#xC99D;&#xAC00;&#xC758; &#xBD80;&#xB2F4;&#xB54C;&#xBB38;&#xC5D0; &#xB09C;&#xB3C5;&#xD654;&#xD560; &#xB54C; &#xD574;&#xB2F9; &#xC635;&#xC158;&#xC744; &#xC801;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xACBD;&#xC6B0;&#xB3C4; &#xB4DC;&#xBB3C;&#xC9C0; &#xC54A;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694;.. &#xD558;&#xC9C0;&#xB9CC; &#xADF8;&#xB300;&#xC2E0; &#xB09C;&#xB3C5;&#xD654; &#xD6A8;&#xACFC;&#xB294; &#xAC15;&#xB825;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.)</p>
<p><img src="/2025/09/11/banda/LLVM_based_VMP/ko/image5.png" srcset="/img/loading.gif" alt></p>
<p>&#xAC00;&#xC0C1;&#xD654; &#xC635;&#xC158;&#xC774; &#xC801;&#xC6A9;&#xB41C; bitwise.vmp.bin &#xD30C;&#xC77C;&#xC744; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; &#xBA87; &#xAC00;&#xC9C0; &#xD2B9;&#xC774;&#xD55C; &#xC810;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;. &#xC800;&#xC758; &#xACBD;&#xC6B0;&#xC640; &#xAC19;&#xC774; &#xAE30;&#xBCF8;&#xC801;&#xC778; VMProtect &#xAC00;&#xC0C1;&#xD654; &#xC635;&#xC158; &#xC801;&#xC6A9;&#xB9CC;&#xC73C;&#xB85C; &#xD568;&#xC218;&#xC758; RVA&#xAC00; &#xBCC0;&#xACBD;&#xB418;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;&#xB9CC;, option&#xC5D0; &#xB530;&#xB77C; &#xBCC0;&#xACBD;&#xB420; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; <code>ret</code> &#xC5C6;&#xC774; <code>jmp</code>&#xB97C; &#xD1B5;&#xD574; <code>loc_407675</code>&#xB85C; &#xC810;&#xD504;&#xB418;&#xBA74;&#xC11C; &#xC6D0;&#xB798; &#xCF54;&#xB4DC;&#xAC00; &#xC544;&#xB2CC;, VMProtect &#xC2DC;&#xC791; &#xC9C0;&#xC810;&#xC73C;&#xB85C; &#xD750;&#xB984;&#xC774; &#xB118;&#xC5B4;&#xAC00;&#xB294; &#xBAA8;&#xC2B5;&#xC774; &#xAC00;&#xC0C1;&#xD654;&#xC758; &#xB300;&#xD45C;&#xC801;&#xC778; &#xD2B9;&#xC9D5;&#xC73C;&#xB85C; &#xBCFC; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/09/11/banda/LLVM_based_VMP/ko/image6.png" srcset="/img/loading.gif" alt></p>
<p><code>loc_407675</code>&#xB85C; &#xB4E4;&#xC5B4;&#xAC00;&#xBD05;&#xC2DC;&#xB2E4;. &#xCD08;&#xAE30;&#xC5D0; <code>push 3987A4B2h</code>, <code>call sub_4A4BBB</code>, <code>int 3</code>&#xC744; &#xD1B5;&#xD574; &#xC2A4;&#xD0DD;&#xC5D0; <code>3987A4B2h</code> context &#xAC12;&#xC744; &#xB123;&#xACE0;, <code>sub_4A4BBB</code> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xBA74;&#xC11C; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;&#xC5D0; &#xC9C4;&#xC785;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xD6C4; <code>VmHandler</code>&#xB77C;&#xB294; &#xCF54;&#xB4DC; &#xBE14;&#xB85D;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294;&#xB370;&#xC694;. <code>call</code> &#xBA85;&#xB839;&#xC5B4;&#xB85C; &#xC9C4;&#xC785;&#xD55C; &#xB8E8;&#xD504; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; VIP&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;&#xB97C; &#xC77D;&#xC5B4;&#xC624;&#xACE0; HANDLER &#xC704;&#xCE58;&#xB97C; &#xCC3E;&#xC544;&#xB0B4; &#xD2B9;&#xC815; &#xC5F0;&#xC0B0;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; &#xAC00;&#xC0C1; &#xBA85;&#xB839;&#xC5B4; &#xCC98;&#xB9AC; &#xACFC;&#xC815;&#xC744; &#xBC18;&#xBCF5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="Trace-&#xC218;&#xC9D1;-Intel-Pin"><a href="#Trace-&#xC218;&#xC9D1;-Intel-Pin" class="headerlink" title="Trace &#xC218;&#xC9D1; (Intel Pin)"></a><strong>Trace &#xC218;&#xC9D1; (Intel Pin)</strong></h3><p><strong>&#x1F4CC;Pin&#xC774;&#xB780;</strong></p>
<p><img src="/2025/09/11/banda/LLVM_based_VMP/ko/image7.png" srcset="/img/loading.gif" alt></p>
<p>Pin&#xC740; Intel&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xB3D9;&#xC801; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xACC4;&#xCE21;(DBI) &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB85C;, Windows&#xC640; Linux &#xD658;&#xACBD;&#xC758; x86 &#xBC0F; x64 &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;. Pin&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC9C1;&#xC811; &#xC218;&#xC815;&#xD558;&#xC9C0; &#xC54A;&#xACE0; JIT(Just-In-Time) &#xAE30;&#xBC18; &#xCF54;&#xB4DC; &#xBCC0;&#xD658;&#xC744; &#xD1B5;&#xD574; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC5D0; &#xAC1C;&#xC785;&#xD558;&#xBA70;, &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC791;&#xC131;&#xD55C; pintool&#xC744; &#xC0BD;&#xC785;&#xD574; &#xBA85;&#xB839;&#xC5B4; &#xC2E4;&#xD589;, &#xBA54;&#xBAA8;&#xB9AC; &#xC811;&#xADFC;, &#xD568;&#xC218; &#xD638;&#xCD9C; &#xB4F1; &#xB7F0;&#xD0C0;&#xC784; &#xB3D9;&#xC791;&#xC744; &#xAD00;&#xCC30;&#xD558;&#xACE0; &#xAE30;&#xB85D;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7EC;&#xD55C; Pin&#xC758; &#xD2B9;&#xC131;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xBA74;, JIT &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC744; &#xAC00;&#xB85C;&#xCC44; &#xC0AC;&#xC6A9;&#xC790; &#xC815;&#xC758; pintool&#xC744; &#xC8FC;&#xC785;&#xD558;&#xACE0;, &#xC9C0;&#xC815;&#xD55C; &#xAD6C;&#xAC04;&#xC758; trace&#xB97C; &#xD6A8;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xC218;&#xC9D1;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c">TRACE_AddInstrumentFunction(OnTrace, <span class="hljs-number">0</span>);

<span class="hljs-function">VOID <span class="hljs-title">OnTrace</span><span class="hljs-params">(TRACE t, VOID*)</span> </span>{
&#xA0;&#xA0;<span class="hljs-keyword">for</span> (BBL b = TRACE_BblHead(t); BBL_Valid(b); b = BBL_Next(b)) {
&#xA0;&#xA0;&#xA0;&#xA0;<span class="hljs-keyword">for</span> (INS i = BBL_InsHead(b); INS_Valid(i); i = INS_Next(i)) {
&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;<span class="hljs-comment">// &#xC2E4;&#xC81C; &#xD6C5; &#xC0BD;&#xC785;</span>
&#xA0;&#xA0;&#xA0;&#xA0;}
&#xA0;&#xA0;}
}
<span class="hljs-comment">// &#xB4F1;&#xB85D;</span>
TRACE_AddInstrumentFunction(OnTrace, <span class="hljs-number">0</span>);</code></pre>
<p>Pin&#xC758; &#xB3D9;&#xC791;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xC21C;&#xC11C;&#xB97C; &#xB530;&#xB985;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC2E4;&#xD589;&#xB420; &#xB54C; Pin&#xC774; <strong>&#xCF54;&#xB4DC; &#xBE14;&#xB85D;(Trace)</strong> &#xC2E4;&#xD589;&#xC744; &#xAC00;&#xB85C;&#xCC55;&#xB2C8;&#xB2E4;.</li>
<li>Pin&#xC740; &#xD574;&#xB2F9; Trace&#xB97C; &#xC989;&#xC2DC; &#xC2E4;&#xD589;&#xD558;&#xC9C0; &#xC54A;&#xACE0;, &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xB4F1;&#xB85D;&#xD55C; <code>&#xCF5C;&#xBC31; &#xD568;&#xC218;(OnTrace)</code>&#xB97C; &#xBA3C;&#xC800; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>OnTrace &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; &#xBD84;&#xC11D; &#xCF54;&#xB4DC;&#xB97C; &#xC0BD;&#xC785;&#xD558;&#xAC70;&#xB098;, &#xC6D0;&#xD558;&#xB294; &#xBA85;&#xB839;&#xC5B4;&#xC5D0; &#xB300;&#xD574; hook&#xC744; &#xCD94;&#xAC00;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. (&#xC77C;&#xBA85; &#xCF54;&#xB4DC; &#xB07C;&#xC6CC;&#xB123;&#xAE30;)</li>
<li>&#xC6D0;&#xBCF8; &#xCF54;&#xB4DC;&#xC640; &#xC0BD;&#xC785;&#xB41C; &#xBD84;&#xC11D; &#xCF54;&#xB4DC;&#xAC00; &#xD569;&#xCCD0;&#xC838; JIT &#xCEF4;&#xD30C;&#xC77C;&#xB418;&#xBA70;, &#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#x201C;&#xC6D0;&#xBCF8; &#xB3D9;&#xC791; + &#xAE30;&#xB85D; &#xAE30;&#xB2A5;&#x201D;&#xC744; &#xB3D9;&#xC2DC;&#xC5D0; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
<p>&#xC704; &#xACFC;&#xC815;&#xC744; &#xD1B5;&#xD574; Pin&#xC740; &#xC2E4;&#xD589;&#xB41C; &#xBAA8;&#xB4E0; &#xAE30;&#xACC4;&#xC5B4; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC65C;&#xACE1; &#xC5C6;&#xC774; &#xAE30;&#xB85D;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c">./pin -t ./source/tools/VMP_Trace/obj-intel64/VMP_Trace.so \
  -start <span class="hljs-number">0x401156</span> -end <span class="hljs-number">0x4011AA</span> \
  -- ./bitwise.vmp.bin <span class="hljs-number">0</span> &amp;&gt; ./bitwise.vmp.trace</code></pre>
<p>Trace&#xB97C; &#xC218;&#xC9D1;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xC774;&#xC804;&#xC5D0; &#xD655;&#xC778;&#xD588;&#xB358; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xBD84;&#xC11D;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xD568;&#xC218;&#xC758; start address(<code>0x401156</code>), end address(<code>0x4011AA</code>), &#xADF8;&#xB9AC;&#xACE0; &#xC778;&#xC790;&#xAC00; &#xBA87; &#xAC1C; &#xB4E4;&#xC5B4;&#xAC00;&#xB294;&#xC9C0; &#xC815;&#xB3C4; &#xD655;&#xC778;&#xD574;&#xC8FC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xC8FC;&#xC18C; &#xBC94;&#xC704;&#xB97C; &#xBC14;&#xD0D5;&#xC73C;&#xB85C;, Intel Pin &#xB3C4;&#xAD6C;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; trace&#xB97C; &#xC218;&#xC9D1;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/09/11/banda/LLVM_based_VMP/ko/image8.png" srcset="/img/loading.gif" alt></p>
<p>&#xC0DD;&#xC131;&#xB41C; trace &#xD30C;&#xC77C; &#xB0B4;&#xBD80;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74;, pin&#xC744; &#xC0AC;&#xC6A9;&#xD574; bitwise.vmp.bin&#xC744; <code>flag=0</code> &#xC778;&#xC790;&#xC640; &#xD568;&#xAED8; &#xC2E4;&#xD589;&#xD588;&#xC744; &#xB54C;, &#xC9C0;&#xC815;&#xD55C; &#xBC94;&#xC704; &#xB0B4;&#xC5D0;&#xC11C; CPU&#xAC00; &#xC2E4;&#xD589;&#xD55C; &#xBAA8;&#xB4E0; &#xAE30;&#xACC4;&#xC5B4; &#xBA85;&#xB839;&#xC5B4; &#xAE30;&#xB85D;&#xC744; &#xB2F4;&#xACE0; &#xC788;&#xC74C;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD30C;&#xC77C; &#xAD6C;&#xC870;&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; <code>r:</code>, <code>i:</code>&#xB97C; &#xD55C; &#xC30D;&#xC73C;&#xB85C; &#xAE30;&#xB85D;&#xD558;&#xB294; &#xD615;&#xC2DD;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><code>r:</code> (Registers): <code>i:</code> &#xAC00; &#xC2E4;&#xD589;&#xB418;&#xAE30; &#xC774;&#xC804;&#xC758; &#xBAA8;&#xB4E0; CPU &#xBC94;&#xC6A9; &#xB808;&#xC9C0;&#xC2A4;&#xD130; &#xC0C1;&#xD0DC;&#xB97C; 16&#xC9C4;&#xC218; &#xAC12;&#xC73C;&#xB85C; &#xAE30;&#xB85D;&#xD55C; &#xD615;&#xD0DC;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><code>i:</code> (Instruction): &#xC2E4;&#xC81C;&#xB85C; &#xC2E4;&#xD589;&#xB41C; &#xBA85;&#xB839;&#xC5B4; &#xC790;&#xCCB4;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xC774;&#xBA70;, <code>i:&lt;&#xBA85;&#xB839;&#xC5B4; &#xC8FC;&#xC18C;&gt;:&lt;&#xBA85;&#xB839;&#xC5B4; &#xD06C;&#xAE30;(byte)&gt;:&lt;&#xAE30;&#xACC4;&#xC5B4; &#xCF54;&#xB4DC;(Opcode)&gt;</code> &#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C;&#xB4E4;&#xBA74; <code>i:0x401156:1:55</code>&#xB294; <code>0x401156</code>&#xC774;&#xB77C;&#xB294; &#xC2DC;&#xC791; &#xC8FC;&#xC18C;&#xB97C; &#xC815;&#xD655;&#xD558;&#xAC8C; &#xB2F4;&#xACE0;&#xC788;&#xACE0;, &#x2018;<code>0x55</code>(<code>push rbp</code>) &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC2E4;&#xD589;&#xD588;&#xB2E4;&#x2019;&#xB294; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD574;&#xC11D;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</li>
</ul>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xC0DD;&#xC131;&#xB41C; trace &#xD30C;&#xC77C;&#xC740; &#xC778;&#xAC04;&#xC774; &#xC804;&#xBD80; &#xC77D;&#xAE30;&#xC5D0;&#xB294; &#xBC29;&#xB300;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBD88;&#xAC00;&#xB2A5;&#xC5D0; &#xAC00;&#xAE5D;&#xC2B5;&#xB2C8;&#xB2E4;.. attack_vmp.py &#xAC19;&#xC740; &#xB3C4;&#xAD6C;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC6D0;&#xBCF8; &#xB85C;&#xC9C1;&#xC744; &#xB2F4;&#xC740; LLVM-IR&#xC744; &#xC0DD;&#xC131;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><strong>vbraddr(Virtual Branch Address) &#xAD6C;&#xD558;&#xAE30;</strong></p>
<p><img src="/2025/09/11/banda/LLVM_based_VMP/ko/image9.png" srcset="/img/loading.gif" alt></p>
<p>&#xC800;&#xC758; &#xACBD;&#xC6B0;&#xC640; &#xAC19;&#xC774; &#xBD84;&#xAE30;&#xBB38;&#xC744; &#xD3EC;&#xD568;&#xD55C; &#xD568;&#xC218;&#xC758; <strong>&#xC804;&#xCCB4; &#xB85C;&#xC9C1;&#xC744; &#xBCF5;&#xC6D0;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294;</strong>, &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xB294; &#xC5EC;&#xB7EC; &#xAC1C;&#xC758; Trace &#xD30C;&#xC77C;&#xC744; &#xB3D9;&#xC2DC;&#xC5D0; &#xBD84;&#xC11D;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7F0;&#xB370; VMProtect&#xB294; &#xC77C;&#xBC18;&#xC801;&#xC778; <code>jmp</code>, <code>jz</code>, <code>jnz</code> &#xAC19;&#xC740; &#xC9C1;&#xC811;&#xC801;&#xC778; &#xBD84;&#xAE30; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xAC00;&#xC0C1;&#xD654;&#xB41C; &#xBD84;&#xB9AC; &#xB85C;&#xC9C1;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xACBD;&#xC6B0; attack &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB294; &#xC774; &#xACBD;&#xB85C;&#xB4E4;&#xC774; &#xC815;&#xD655;&#xD788; &#xC5B4;&#xB290; &#xC9C0;&#xC810;&#xC5D0;&#xC11C; &#xAC08;&#xB77C;&#xC84C;&#xB294;&#xC9C0; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xD30C;&#xC545;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; vbraddr &#xC8FC;&#xC18C; &#xAC12;&#xC744; &#xC778;&#xAC04;&#xC774; IDA&#xB85C; &#xCC3E;&#xC544;&#xC11C; &#xB123;&#xC5B4;&#xC8FC;&#xB3C4;&#xB85D; &#xD569;&#xC2DC;&#xB2E4;. trace &#xC0C1;&#xC5D0;&#xC11C; cmp&#xB098; test &#xAC19;&#xC740; &#xBE44;&#xAD50; &#xBA85;&#xB839;&#xC5B4;&#xAC00; &#xC704;&#xCE58;&#xD55C; &#xBD80;&#xBD84; &#xC911; &#xAC00;&#xC0C1; &#xBD84;&#xAE30;&#xB97C; &#xACB0;&#xC815;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xC744; &#xC815;&#xD655;&#xD788; &#xCC3E;&#xC544;&#xC8FC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xD544;&#xC790;&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; <code>0x4831A5</code>&#xAC00; &#xAC00;&#xC0C1; &#xBD84;&#xAE30; &#xC8FC;&#xC18C;&#xC5D0; &#xD574;&#xB2F9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC774; vbraddr&#xC774; &#xD6C4;&#xC5D0; CFG&#xAC00; &#xAC08;&#xB77C;&#xC9C0;&#xB294; &#xAE30;&#xC900;&#xC810;&#xC744; &#xBA85;&#xC2DC;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC774; &#xB418;&#xC5B4;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/09/11/banda/LLVM_based_VMP/ko/image10.png" srcset="/img/loading.gif" alt></p>
<p>attack_vmp.py &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xC758; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC744; &#xC0B4;&#xD3B4;&#xBD05;&#xC2DC;&#xB2E4;. &#xD574;&#xB2F9; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/jonathansalwan/Triton">Triton &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;</a>&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Triton&#xC740; Trace &#xB0B4;&#xC758; &#xC2E4;&#xD589;&#xB41C; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xD558;&#xB098;&#xC529; &#xD574;&#xC11D;&#xD558;&#xBA74;&#xC11C; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC640; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC2EC;&#xBCFC;&#xB9AD; &#xBCC0;&#xC218;(symbolic variable)&#xB85C; &#xCD94;&#xC801;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC640; &#xBA54;&#xBAA8;&#xB9AC; &#xC0C1;&#xD0DC;&#xAC00; AST(Abstract Syntax Tree) &#xD615;&#xD0DC;&#xB85C; &#xAD00;&#xB9AC;&#xB429;&#xB2C8;&#xB2E4;.</li>
<li>Triton&#xC758; symbolic execution &#xC5D4;&#xC9C4;&#xC744; &#xD1B5;&#xD574; path predicate&#xB97C; &#xAD6C;&#xCD95;&#xD558;&#xC5EC; &#xC870;&#xAC74; &#xBD84;&#xAE30;&#xAE4C;&#xC9C0; &#xC218;&#xD559;&#xC801;&#xC73C;&#xB85C; &#xBAA8;&#xB378;&#xB9C1;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC774;&#xB97C; &#xD1B5;&#xD574; VMProtect &#xB178;&#xC774;&#xC988;&#xAC00; &#xAD6C;&#xCCB4;&#xD654;(concretization) &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC0C1;&#xC218; &#xCC98;&#xB9AC;&#xB418;&#xC5B4; &#xC81C;&#xAC70;&#xB418;&#xACE0;, simplification pass&#xC640; formula slicing &#xAE30;&#xB2A5;&#xC744; &#xD65C;&#xC6A9;&#xD574; &#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; &#xD45C;&#xD604;&#xC2DD;&#xC744; &#xC785;&#xB825;&#xACFC; &#xCD9C;&#xB825; &#xAD00;&#xACC4;&#xB9CC; &#xB2F4;&#xC740; &#xC218;&#xD559; &#xD45C;&#xD604;&#xC2DD;&#xC73C;&#xB85C; &#xB2E8;&#xC21C;&#xD654; &#xD558;&#xB294; &#xC6D0;&#xB9AC;&#xC785;&#xB2C8;&#xB2E4;.</li>
</ul>
<pre><code class="hljs c">./attack_vmp.py \
  --trace1 ./bitwise.vmp.trace0 \
  --trace2 ./bitwise.vmp.trace1 \
  --trace3 ./bitwise.vmp.trace2 \
  --symsize <span class="hljs-number">4</span> \
  --vbraddr <span class="hljs-number">0x4831a5</span> \
  --vbrflag af</code></pre>
<p>&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; &#xBA85;&#xB839;&#xC5B4;&#xB85C; &#xAC01;&#xAC01; &#xB2E4;&#xB978; &#xBD84;&#xAE30;&#xBB38;&#xC744; &#xD0C0;&#xB294; trace &#xC138; &#xAC1C; &#xD30C;&#xC77C;&#xC744; &#xB123;&#xC5B4;&#xC8FC;&#xACE0;, <code>&#x2014;vbraddr</code>&#xACFC; <code>&#x2014;vbrflag</code> &#xC635;&#xC158;&#xC744; &#xD568;&#xAED8; &#xC804;&#xB2EC;&#xD574;&#xC90D;&#xC2DC;&#xB2E4;. &#xCC38;&#xACE0;&#xB85C; &#xAE30;&#xC874;&#xC5D0; &#xC81C;&#xACF5;&#xB41C; attack_vmp &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB294; trace&#xB97C; &#xB450; &#xAC1C;&#xAE4C;&#xC9C0; &#xBC16;&#xC5D0; &#xBABB; &#xC918;&#xC11C; trace &#xD30C;&#xC77C;&#xC744; &#xB354; &#xB9CE;&#xC774; &#xC92C;&#xC744; &#xB54C; &#xC774;&#xB97C; &#xC5F0;&#xACB0;&#xC9C0;&#xC5B4; LLVM-IR&#xB85C; &#xACB0;&#xD569;&#xD560; &#xC218; &#xC788;&#xB294; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; &#xAE30;&#xB2A5;&#xC73C;&#xB85C; &#xC870;&#xAE08; &#xD655;&#xC7A5;&#xD574;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xACFC;&#xC5F0; &#xC138; &#xAC1C;&#xC758; &#xBD84;&#xAE30;&#xBB38;&#xC744; &#xBCD1;&#xD569;&#xD574; CFG &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xBCF5;&#xC6D0;&#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;?</p>
<p><img src="/2025/09/11/banda/LLVM_based_VMP/ko/image11.png" srcset="/img/loading.gif" alt></p>
<p>&#xC0DD;&#xC131;&#xB41C; LLVM-IR&#xC744; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; &#xC6D0;&#xBCF8; &#xCF54;&#xB4DC;&#xC758; <code>if-else</code> &#xAD6C;&#xC870;&#xC640; &#xBE44;&#xD2B8; &#xC5F0;&#xC0B0;(XOR, AND, OR) &#xC870;&#xD569;&#xC744; &#xC815;&#xD655;&#xD558;&#xAC8C; &#xAD6C;&#xD604;&#xD588;&#xB2E4;&#xB294; &#xC810;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. (<a target="_blank" rel="external nofollow noopener noreferrer" href="https://llvm.org/docs/LangRef.html">LLVM-IR Language</a>&#xAC00; &#xAD81;&#xAE08;&#xD558;&#xB2E4;&#xBA74; &#xC774; &#xACF3;&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.)</p>
<p>LLCM IR &#xB9AC;&#xD504;&#xD305; &#xACB0;&#xACFC;, <code>%SymVar_0</code>, <code>%SymVar_1</code>&#xC5D0; &#xB300;&#xD574; &#xCC98;&#xC74C;&#xC5D0;&#xB294; AND&#xC640; OR &#xC5F0;&#xC0B0;&#xC774;, &#xADF8; &#xB2E4;&#xC74C;&#xC5D0; XOR &#xC5F0;&#xC0B0;&#xC774; &#xAC01;&#xAC01; &#xC870;&#xAC74; &#xAC80;&#xC0AC;&#xB97C; &#xAC70;&#xCCD0; &#xACB0;&#xACFC;&#xB97C; &#xC120;&#xD0DD;&#xD55C;&#xB2E4;&#xB294; &#xC810;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. <code>-88</code>, <code>==16</code> &#xAC19;&#xC740; &#xBD88;&#xD544;&#xC694;&#xD55C; &#xBE44;&#xAD50;&#xB294; VMProtect &#xAC00;&#xC0C1;&#xD654; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC0BD;&#xC785;&#xB41C; &#xB178;&#xC774;&#xC988;&#xC774;&#xC9C0;&#xB9CC;, &#xD575;&#xC2EC; &#xB85C;&#xC9C1;&#xACFC; &#xBB34;&#xAD00;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/09/11/banda/LLVM_based_VMP/ko/image12.png" srcset="/img/loading.gif" alt></p>
<p>&#xC704; &#xADF8;&#xB798;&#xD504;&#xB294; VMProtect&#xB85C; &#xAC00;&#xC0C1;&#xD654;&#xB41C; &#xD568;&#xC218;&#xB97C; devirtualization &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xBCF5;&#xC6D0;&#xD55C; &#xACB0;&#xACFC;&#xB85C;, &#xD568;&#xC218;&#xC758; &#xBC18;&#xD658; &#xAC12;&#xC774; select &#xC5F0;&#xC0B0;&#xC5D0; &#xC758;&#xD574; &#xACB0;&#xC815;&#xB418;&#xB294; &#xAD6C;&#xC870;&#xB97C; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. &#xCCAB; &#xBC88;&#xC9F8; select &#xB178;&#xB4DC;&#xB294; cond q&#xB77C;&#xB294; &#xC870;&#xAC74;&#xC5D0; &#xB530;&#xB77C; &#xC67C;&#xCABD;&#xC73C;&#xB85C;&#xB294; <code>SymVar_0</code>&#xACFC; <code>SymVar_1</code>&#xC744; XOR&#xD55C; &#xACB0;&#xACFC;&#xB97C;, &#xC624;&#xB978;&#xCABD;&#xC73C;&#xB85C;&#xB294; &#xB610; &#xB2E4;&#xB978; select &#xB178;&#xB4DC;&#xC758; &#xACB0;&#xACFC;&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC624;&#xB978;&#xCABD;&#xC758; select &#xB178;&#xB4DC;&#xB294; cond p &#xC870;&#xAC74;&#xC5D0; &#xB530;&#xB77C; &#xCC38;&#xC77C; &#xACBD;&#xC6B0; <code>SymVar_0</code>&#xACFC; <code>SymVar_1</code>&#xC744; OR&#xD55C; &#xACB0;&#xACFC;&#xB97C;, &#xAC70;&#xC9D3;&#xC77C; &#xACBD;&#xC6B0; <code>SymVar_0</code>&#xACFC; <code>SymVar_1</code>&#xC744; AND&#xD55C; &#xACB0;&#xACFC;&#xB97C; &#xC120;&#xD0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="Conclusion"><a href="#Conclusion" class="headerlink" title="Conclusion"></a>Conclusion</h1><p>&#xC0AC;&#xC2E4; &#xC774;&#xBC88; &#xAE00;&#xC5D0;&#xC11C; &#xB2E4;&#xB8EC; LLVM &#xAE30;&#xBC18;&#xC758; devirtualization &#xC811;&#xADFC;&#xBC95;&#xC740; &#xB2E8;&#xC77C; &#xACBD;&#xB85C;&#xB098; &#xC18C;&#xC218;&#xC758; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xB97C; &#xAC00;&#xC9C4; &#xD568;&#xC218;&#xC5D0;&#xC11C;&#xB294; &#xD6A8;&#xACFC;&#xC801;&#xC774;&#xC9C0;&#xB9CC;, &#xACBD;&#xB85C; &#xC218;&#xAC00; &#xB9CE;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C;&#xB294; &#xC77C;&#xBD80; &#xCF54;&#xB4DC;&#xAC00; &#xB204;&#xB77D;&#xB420; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD604;&#xC2E4;&#xC801;&#xC778; &#xADDC;&#xBAA8;&#xC758; &#xCF54;&#xB4DC;&#xC5D0; &#xD574;&#xB2F9; &#xC811;&#xADFC;&#xBC95;&#xC744; &#xC801;&#xC6A9;&#xD558;&#xAE30;&#xC5D0;&#xB294; &#xC544;&#xC9C1; &#xBB34;&#xB9AC;&#xAC00; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC774;&#xBC88; &#xC5F0;&#xAD6C;&#xAE00;&#xC740; &#xC5EC;&#xAE30;&#xC11C; part 1&#xC744; &#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C; part&#xC5D0;&#xC11C;&#xB294; &#xAD00;&#xB828; &#xB17C;&#xBB38;&#xB4E4;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xC911;&#xC810;&#xC5D0; &#xB450;&#xC5B4; devirtualization &#xAC00;&#xB2A5;&#xC131;&#xC744; &#xB2F4;&#xC544;&#xBCF4;&#xACE0;, virtualization &#xBFD0;&#xB9CC;&#xC774; &#xC544;&#xB2CC; &#xB2E4;&#xC591;&#xD55C; options&#xC5D0; &#xB300;&#xD55C; &#xB09C;&#xB3C5;&#xD654; &#xD574;&#xC81C; &#xC811;&#xADFC;&#xBC95;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h1><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://koreascience.kr/article/JAKO202106153172639.pub?&amp;lang=ko">https://koreascience.kr/article/JAKO202106153172639.pub?&amp;lang=ko</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/JonathanSalwan/VMProtect-devirtualization/tree/main">https://github.com/JonathanSalwan/VMProtect-devirtualization/tree/main</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://scienceon.kisti.re.kr/commons/util/originalView.do?cn=JAKO202025356104834&amp;oCn=JAKO202025356104834&amp;dbt=JAKO&amp;journal=NJOU00291865">https://scienceon.kisti.re.kr/commons/util/originalView.do?cn=JAKO202025356104834&amp;oCn=JAKO202025356104834&amp;dbt=JAKO&amp;journal=NJOU00291865</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.kc-ml2.com/posts/blog_LLVM">https://www.kc-ml2.com/posts/blog_LLVM</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/banda/">banda</a>
                  
                  <a class="hover-with-bg" href="/tags/VMProtect/">VMProtect</a>
                  
                  <a class="hover-with-bg" href="/tags/LLVM-IR/">LLVM-IR</a>
                  
                  <a class="hover-with-bg" href="/tags/Pin/">Pin</a>
                  
                  <a class="hover-with-bg" href="/tags/Triton/">Triton</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_banda.jpg" srcset="/img/loading.gif" alt="banda">
                  </div>

                  <div class="link-text">
                    <div class="link-title">banda</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/banda">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/09/11/banda/LLVM_based_VMP/en/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] LLVM based VMProtect Devirtualization: Part 1 (EN)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/09/10/OUYA77/2025-09-10/">
                    <span class="hidden-mobile">[] CVE-2025-54878: NASA CryptoLib Heap Buffer Overflow   (DoS)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/09/11/banda/LLVM_based_VMP/ko/';
        this.page.identifier = '/2025/09/11/banda/LLVM_based_VMP/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] LLVM based VMProtect Devirtualization: Part 1 (KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
