

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. idioth&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6D0;&amp;#xB798; &amp;#xC624;&amp;#xB298;&amp;#xC740; ghidra&amp;#xC758; &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xAC00; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xB0A0;&amp;#xC774;&amp;#xC8E0;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xC0AC;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xC9C1; &amp;#xC800;&amp;#xB294; &amp;#xAE30;&amp;#xB9D0; &amp;#xC2DC;&amp;#xD5D8;&amp;#xC774; &amp;#xB05D;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xACE0; &amp;#xB610; &amp;#xC0AC;&amp;#xBB34;&amp;#xC2E4;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xB178;&amp;#xD2B8;&amp;#xBD81;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; VM&amp;#xC774; &amp;#xC7A0;&amp;#xB4E4;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xB370; &amp;#xC5B4;&amp;#xC81C; &amp;#xBC1C;&amp;#xC5D0; &amp;#xB808;&amp;#xC774;&amp;#xC800; &amp;#xCE58;&amp;#xB8CC;&amp;#xB97C; &amp;#xBC1B;&amp;#xC740; &amp;#xD0D3;&amp;#xC5D0; &amp;#xC798; &amp;#xAC77;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2F5;&amp;#xB2C8;&amp;#xB2E4; &amp;#xD558;&amp;#xD558;&amp;#xD558;. &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xBC1C; &amp;#xB4A4;&amp;#xAFC8;&amp;#xCE58;&amp;#xB85C; &amp;#xAC77;&amp;#xB294; &amp;#xAC70; &amp;#xD560;&amp;#xB9CC;&amp;#xD574;&amp;#xC694; ^^&amp;#x2026;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xC774;&amp;#xB7F0;&amp;#xC800;&amp;#xB7F0; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xAE30;&amp;#xB9D0; &amp;#xC900;&amp;#xBE44; &amp;#xC911;&amp;#xC778; &amp;#xC800;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC2F8;&amp;#xC7A5;&amp;#xB2D8;&amp;#xAED8;&amp;#xC11C; &amp;#xC77D;&amp;#xC73C;&amp;#xB77C;&amp;#xACE0; &amp;#xCD94;&amp;#xCC9C;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0; &amp;#xAE00;&amp;#xC744; &amp;#xC77D;&amp;#xC744; &amp;#xACB8; &amp;#xBC88;&amp;#xC5ED;&amp;#xD574;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xD6C4;&amp;#xBC18;&amp;#xBD80;&amp;#xC5D0; &amp;#xBE80; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC870;&amp;#xAE08; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! Siloscape&amp;#xC758; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5B4;&amp;#xC11C; IRC &amp;#xC811;&amp;#xC18D; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC81C;&amp;#xC678;&amp;#xD558;&amp;#xACE0; &amp;#xBC88;&amp;#xC5ED;&amp;#xC744; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. :)&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; &amp;#xAE00; : &lt;a href=&#34;https://unit42.paloaltonetworks.com/siloscape/&#34;&gt;Siloscape: First Known Malware Targeting Windows Containers to Compromise Cloud Environments&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&#34;Executive-Summary&#34;&gt;&lt;a href=&#34;#Executive-Summary&#34; class=&#34;headerlink&#34; title=&#34;Executive Summary&#34;&gt;&lt;/a&gt;Executive Summary&lt;/h1&gt;&lt;p&gt;2021&amp;#xB144; 3&amp;#xC6D4;&amp;#xC5D0; Windows container&amp;#xB97C; &amp;#xD0C0;&amp;#xAE43;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xCD5C;&amp;#xCD08;&amp;#xC758; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xB2E4;. &amp;#xC9C0;&amp;#xB09C; &amp;#xBA87; &amp;#xB144;&amp;#xAC04; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC;&amp;#xB97C; &amp;#xD0C0;&amp;#xAE43;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC99D;&amp;#xAC00;&amp;#xD55C; &amp;#xAC83;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA74; &amp;#xB180;&amp;#xB78D;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xB2E4;. &amp;#xC774; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; container escape&amp;#xAC00; &amp;#xC8FC;&amp;#xBAA9;&amp;#xC801;&amp;#xC774;&amp;#xACE0; &amp;#xC8FC;&amp;#xB85C; server silo&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C; Siloscape (silo escape&amp;#xCC98;&amp;#xB7FC; &amp;#xB4E4;&amp;#xB9BC; &amp;#x314E;)&amp;#xB77C;&amp;#xACE0; &amp;#xC774;&amp;#xB984; &amp;#xC9C0;&amp;#xC5C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Siloscape&amp;#xB294; Windows container&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Kubernetes clusters&amp;#xB97C; &amp;#xD0C0;&amp;#xAE43;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC774;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xBAA9;&amp;#xC801;&amp;#xC740; &amp;#xC545;&amp;#xC131; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; Kubernetes clusters&amp;#xC5D0; &amp;#xBC31;&amp;#xB3C4;&amp;#xC5B4;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC01; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB294; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xBC18;&amp;#xBA74;&amp;#xC5D0; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xAC1C;&amp;#xBCC4; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; &amp;#xC190;&amp;#xC0C1;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC83;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC804;&amp;#xCCB4; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xC190;&amp;#xC0C1;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xB354; &amp;#xCE58;&amp;#xBA85;&amp;#xC801;&amp;#xC774;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xD574;&amp;#xCEE4;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC774;&amp;#xB984; &amp;#xBC0F; &amp;#xC554;&amp;#xD638;, &amp;#xC870;&amp;#xC9C1;&amp;#xC758; &amp;#xAE30;&amp;#xBC00; &amp;#xC815;&amp;#xBCF4;&amp;#xC640; &amp;#xB0B4;&amp;#xBD80; &amp;#xD30C;&amp;#xC77C; &amp;#xB610;&amp;#xB294; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD161; &amp;#xD638;&amp;#xC2A4;&amp;#xD305; &amp;#xB41C; &amp;#xC804;&amp;#xCCB4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC911;&amp;#xC694; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD6D4;&amp;#xCE60; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD574;&amp;#xCEE4;&amp;#xAC00; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC870;&amp;#xC9C1;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC778;&amp;#xC9C8;&amp;#xB85C; &amp;#xC7A1;&amp;#xC744; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;. &amp;#xB354; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xAC83;&amp;#xC740; &amp;#xB9CE;&amp;#xC740; &amp;#xC870;&amp;#xC9C1;&amp;#xB4E4;&amp;#xC774; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC;&amp;#xB85C; &amp;#xC774;&amp;#xC804;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xAC1C;&amp;#xBC1C;, &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD658;&amp;#xACBD;&amp;#xC73C;&amp;#xB85C; Kubernetes clusters&amp;#xB97C; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD11;&amp;#xBC94;&amp;#xC704;&amp;#xD55C; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xAE09;&amp;#xB9DD; &amp;#xACF5;&amp;#xACA9;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Siloscape&amp;#xB294; C2 (Command and Cotrol) &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC775;&amp;#xBA85;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD1A0;&amp;#xB974; &amp;#xD504;&amp;#xB85D;&amp;#xC2DC;&amp;#xC640; &lt;code&gt;.onion&lt;/code&gt; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;. 23&amp;#xAC1C;(&amp;#xBA85;?, &amp;#xAE30;&amp;#xAD00;&amp;#xC778;&amp;#xC9C0; &amp;#xC0AC;&amp;#xB78C;&amp;#xC778;&amp;#xC9C0; &amp;#xC560;&amp;#xB9E4;&amp;#xD558;&amp;#xB124;&amp;#xC694;)&amp;#xC758; &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xB97C; &amp;#xCC3E;&amp;#xC558;&amp;#xACE0; &amp;#xCD1D; 313&amp;#xBA85;&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB97C; &amp;#xD638;&amp;#xC2A4;&amp;#xD305; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; Siloscape&amp;#xAC00; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xC758; &amp;#xBE59;&amp;#xC0B0;&amp;#xC758; &amp;#xC77C;&amp;#xAC01;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xC900;&amp;#xB2E4;. &amp;#xD544;&amp;#xC790;&amp;#xB294; &amp;#xB610;&amp;#xD55C; &amp;#xC774; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xC774; 1&amp;#xB144; &amp;#xC774;&amp;#xC0C1; &amp;#xC9C0;&amp;#xC18D;&amp;#xB418;&amp;#xC5B4; &amp;#xC654;&amp;#xC74C;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB9AC;&amp;#xD3EC;&amp;#xD2B8;&amp;#xB294; Windows container &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xBC30;&amp;#xACBD; &amp;#xC9C0;&amp;#xC2DD;, Siloscape&amp;#xC758; &amp;#xAE30;&amp;#xC220; &amp;#xAC1C;&amp;#xC694;, Windows container &amp;#xBCF4;&amp;#xC548; &amp;#xAD8C;&amp;#xC7A5; &amp;#xC0AC;&amp;#xD56D;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Windows-Server-Container-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#Windows-Server-Container-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xAC1C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;Windows Server Container &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;/a&gt;Windows Server Container &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xAC1C;&amp;#xC694;&lt;/h1&gt;&lt;p&gt;2020&amp;#xB144; 7&amp;#xC6D4; 15&amp;#xC5D0; &lt;a href=&#34;https://unit42.paloaltonetworks.com/windows-server-containers-vulnerabilities/&#34;&gt;Windows container boundaries&amp;#xC5D0; &amp;#xAD00;&amp;#xD55C; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&lt;/a&gt;&amp;#xACFC; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC791;&amp;#xC131;&amp;#xD588;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; escape &amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xACE0; &amp;#xD574;&amp;#xCEE4;&amp;#xAC00; escape &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC704;&amp;#xD5D8;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xD588;&amp;#xB2E4;. &amp;#xAC00;&amp;#xC7A5; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC740; Kubernetes&amp;#xC758; Windows container node&amp;#xB97C; &amp;#xD0C8;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xD655;&amp;#xC0B0;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC5C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; Windows Server container&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xC774; &amp;#xC774;&amp;#xC288;&amp;#xB97C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC740; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA87; &amp;#xC8FC; &amp;#xD6C4;, Kubernetes&amp;#xAC00; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC774;&amp;#xC288;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD588;&amp;#xB2E4;. &amp;#xAD6C;&amp;#xAE00;&amp;#xC740; &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xC600;&amp;#xACE0; &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xB294; &amp;#xC774; &amp;#xC774;&amp;#xC288;&amp;#xB97C; Windows container&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB85C; escape &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xC600;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C; &amp;#xC5C6;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xAC04;&amp;#xC8FC;&amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xD6C4;&amp;#xC5D0; Windows Server container&amp;#xB97C; &amp;#xD0C0;&amp;#xAE43;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; Siloscape&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xC600;&amp;#xB2E4;. Siloscape&amp;#xB294; Hyper-V&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; Server Container&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; Kubernetes&amp;#xC744; &amp;#xD0C0;&amp;#xAE43;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB41C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC774;&amp;#xBA70; &amp;#xC8FC;&amp;#xBAA9;&amp;#xC801;&amp;#xC740; &amp;#xC124;&amp;#xC815;&amp;#xC774; &amp;#xBBF8;&amp;#xD761;&amp;#xD55C; Kubernetes &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xBC31;&amp;#xB3C4;&amp;#xC5B4;&amp;#xB97C; &amp;#xC5F4;&amp;#xC5B4; &amp;#xC554;&amp;#xD638; &amp;#xD654;&amp;#xD3D0; &amp;#xCC44;&amp;#xAD74;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC545;&amp;#xC131; container&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xACFC; &amp;#xAE30;&amp;#xC220;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xB2E4;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; (1-day)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD0C0;&amp;#xAE43; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&lt;/li&gt;
&lt;li&gt;Windows container escape&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; escape &amp;#xD558;&amp;#xACE0; underlying node&amp;#xC5D0;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&lt;/li&gt;
&lt;li&gt;node&amp;#xC758; &amp;#xC790;&amp;#xACA9; &amp;#xC99D;&amp;#xBA85;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xC804;&amp;#xD30C;&amp;#xB97C; &amp;#xC2DC;&amp;#xB3C4;&lt;/li&gt;
&lt;li&gt;&amp;#xD1A0;&amp;#xB974; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; IRC &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; C2 &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&lt;/li&gt;
&lt;li&gt;&amp;#xCD94;&amp;#xAC00; command &amp;#xB300;&amp;#xAE30;&lt;/li&gt;
&lt;li&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; Kubernetes cluster&amp;#xC758; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD305; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD3D0; &amp;#xCC44;&amp;#xAD74;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC190;&amp;#xC0C1;&amp;#xB41C; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC218;&amp;#xBC31; &amp;#xAC1C;&amp;#xC758; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xC911;&amp;#xC694; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC62C; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;C2 &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xC870;&amp;#xC0AC;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC; &amp;#xC774; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xD070; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xBA70; &amp;#xC774; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xC740; 1&amp;#xB144; &amp;#xC774;&amp;#xC0C1; &amp;#xC9C4;&amp;#xD589;&amp;#xB410;&amp;#xB2E4;. &amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC544;&amp;#xC9C1; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAE30;&amp;#xC220;-&amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#&amp;#xAE30;&amp;#xC220;-&amp;#xAC1C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAE30;&amp;#xC220; &amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;/a&gt;&amp;#xAE30;&amp;#xC220; &amp;#xAC1C;&amp;#xC694;&lt;/h1&gt;&lt;p&gt;Siloscape&amp;#xC758; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xC804;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC790;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/06/20/idioth/siloscape/Untitled.png&#34; alt&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD574;&amp;#xCEE4;&amp;#xB294; 1-day &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774;&amp;#xB098; &amp;#xC6F9;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;, &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; Windows container &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xC6D0;&amp;#xACA9; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2E4;&amp;#xD589; (Remote Code Execution, RCE)&amp;#xC744; &amp;#xC218;&amp;#xD589;&lt;/li&gt;
&lt;li&gt;Siloscape (&lt;code&gt;CloudMalware.exe&lt;/code&gt;)&amp;#xB97C; C2 &amp;#xC811;&amp;#xC18D; &amp;#xC815;&amp;#xBCF4;&amp;#xC640; &amp;#xD568;&amp;#xAED8; command line&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&lt;/li&gt;
&lt;li&gt;Siloscape&amp;#xB294; &lt;code&gt;SeTcbPrivilege&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &lt;code&gt;CExecSvc.exe&lt;/code&gt;&amp;#xB97C; impersonate (&lt;a href=&#34;https://unit42.paloaltonetworks.com/windows-server-containers-vulnerabilities/&#34;&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xAE30;&amp;#xC220; &amp;#xC0C1;&amp;#xC138; &amp;#xB0B4;&amp;#xC6A9; &amp;#xD655;&amp;#xC778; &amp;#xAC00;&amp;#xB2A5;)&lt;/li&gt;
&lt;li&gt;&amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0; global symbolic link&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xD654; &amp;#xB41C; X &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB97C; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; C &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&lt;/li&gt;
&lt;li&gt;global link&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;kubectl.exe&lt;/code&gt;&amp;#xB97C; &amp;#xCC3E;&amp;#xACE0; &amp;#xC815;&amp;#xADDC;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; Kubernetes &amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC3E;&amp;#xC74C;&lt;/li&gt;
&lt;li&gt;&amp;#xC190;&amp;#xC0C1;&amp;#xB41C; &amp;#xB178;&amp;#xB4DC;&amp;#xAC00; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; Kubernetes deployments&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xCDA9;&amp;#xBD84;&amp;#xD55C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;unzip&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD1A0;&amp;#xB974; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB85C; &amp;#xCD94;&amp;#xCD9C; (Siloscape&amp;#xC758; main binary&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC555;&amp;#xCD95;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC74C;)&lt;/li&gt;
&lt;li&gt;&amp;#xD1A0;&amp;#xB974; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&lt;/li&gt;
&lt;li&gt;command line argument&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; C2 &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;.onion&lt;/code&gt; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; C2 &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&lt;/li&gt;
&lt;li&gt;C2 &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xC624;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xAE30;&amp;#xB2E4;&amp;#xB9AC;&amp;#xACE0;, &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xC62C; &amp;#xACBD;&amp;#xC6B0; &amp;#xC2E4;&amp;#xD589;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; &amp;#xD0C0;&amp;#xAE43;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xB2E4;&amp;#xB978; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD3D0; &amp;#xCC44;&amp;#xAD74;&amp;#xC774; &amp;#xC8FC; &amp;#xBAA9;&amp;#xC801;&amp;#xC778; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB4E4;&amp;#xACFC; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; Siloscape&amp;#xB294; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xC190;&amp;#xC0C1;&amp;#xC2DC;&amp;#xD0A4;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;. &amp;#xB300;&amp;#xC2E0;&amp;#xC5D0; &amp;#xD0D0;&amp;#xC9C0; &amp;#xBC0F; &amp;#xCD94;&amp;#xC801;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xBC31;&amp;#xB3C4;&amp;#xC5B4;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC5D0; &amp;#xC9D1;&amp;#xC911;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Defense-&amp;#xC6B0;&amp;#xD68C;&amp;#xC640;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&#34;&gt;&lt;a href=&#34;#Defense-&amp;#xC6B0;&amp;#xD68C;&amp;#xC640;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&#34; class=&#34;headerlink&#34; title=&#34;Defense &amp;#xC6B0;&amp;#xD68C;&amp;#xC640; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&#34;&gt;&lt;/a&gt;Defense &amp;#xC6B0;&amp;#xD68C;&amp;#xC640; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/h1&gt;&lt;p&gt;Siloscape&amp;#xB294; &amp;#xC2EC;&amp;#xD558;&amp;#xAC8C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;. &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xB85C;&amp;#xC9C1;&amp;#xC740; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD558;&amp;#xAE30; &amp;#xB108;&amp;#xBB34; &amp;#xD798;&amp;#xB4E4;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/06/20/idioth/siloscape/Untitled%201.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; API &amp;#xD638;&amp;#xCD9C;&amp;#xB3C4; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB2E8;&amp;#xC21C;&amp;#xD558;&amp;#xAC8C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; Native API (NTAPI)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC600;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/06/20/idioth/siloscape/Untitled%202.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &lt;code&gt;CreateFile&lt;/code&gt;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xC2E0;&amp;#xC5D0; &lt;code&gt;NtCreateFile&lt;/code&gt;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;. &lt;code&gt;NtCreateFile&lt;/code&gt;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xC2E0;&amp;#xC5D0; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;ntdll.dll&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD568;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xCC3E;&amp;#xC544; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC810;&amp;#xD504;&amp;#xD558;&amp;#xC5EC; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;. &amp;#xADF8;&amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xD568;&amp;#xC218;&amp;#xC640; &amp;#xBAA8;&amp;#xB4C8; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xACE0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2A4; &amp;#xC5D4;&amp;#xC9C0;&amp;#xB2C8;&amp;#xC5B4;&amp;#xB9C1; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xD798;&amp;#xB4E0; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Siloscape&amp;#xB294; &amp;#xD55C; &amp;#xC30D;&amp;#xC758; key&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; C2 &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;. &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC7A5; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC740; &amp;#xD0A4; &amp;#xD558;&amp;#xB098;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xD558;&amp;#xB4DC; &amp;#xCF54;&amp;#xB529;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xD558;&amp;#xB098;&amp;#xB294; command line argument&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC774;&amp;#xB2E4;. AutoFocus&amp;#xC640; VirusTotal &amp;#xAC19;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; hash&amp;#xB97C; &amp;#xAC80;&amp;#xC0C9;&amp;#xD574;&amp;#xB3C4; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Siloscape&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xD560; &amp;#xB54C; &amp;#xACE0;&amp;#xC720;&amp;#xD55C; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC720;&amp;#xCD94;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD558;&amp;#xB4DC; &amp;#xCF54;&amp;#xB529;&amp;#xB41C; &amp;#xD0A4;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB4E4;&amp;#xC744; &amp;#xC0B4;&amp;#xC9DD;&amp;#xC529; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; hash&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xC74C;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD55C;&amp;#xB2E4;. &amp;#xB610; hash&amp;#xB9CC;&amp;#xC73C;&amp;#xB85C; Siloscape&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/06/20/idioth/siloscape/Untitled%203.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC740; Visual Studio&amp;#xC758; Resource Manager&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. Visual Studio&amp;#xC5D0; &amp;#xB0B4;&amp;#xC7A5;&amp;#xB41C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD30C;&amp;#xC77C;&amp;#xC774;&amp;#xB4E0; &amp;#xC6D0;&amp;#xBCF8; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; API &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. Siloscape&amp;#xB294; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0; &amp;#xD1A0;&amp;#xB974; &amp;#xC544;&amp;#xCE74;&amp;#xC774;&amp;#xBE0C;&amp;#xC640; &amp;#xC544;&amp;#xCE74;&amp;#xC774;&amp;#xBE0C;&amp;#xB97C; &amp;#xC5F4;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; unzip &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCD94;&amp;#xAC00;&amp;#xD588;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xD1A0;&amp;#xB974;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; C2 &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C; &amp;#xC811;&amp;#xC18D;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;The-Container-Escape&#34;&gt;&lt;a href=&#34;#The-Container-Escape&#34; class=&#34;headerlink&#34; title=&#34;The Container Escape&#34;&gt;&lt;/a&gt;The Container Escape&lt;/h1&gt;&lt;p&gt;Siloscape&amp;#xC758; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC810; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB294; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; escape &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. escape&amp;#xB97C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; system call &lt;code&gt;NtSetInformationSymbolicLink&lt;/code&gt;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &lt;code&gt;SeTcbPrivilege&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; &lt;code&gt;CExecSvc.exe&lt;/code&gt;&amp;#xC5D0; DLL&amp;#xC744; inject &amp;#xD558;&amp;#xACE0; &amp;#xADF8; context&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;NtSetInformationSymbolicLink&lt;/code&gt;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Siloscape&amp;#xB294; &amp;#xAE30;&amp;#xC220; &amp;#xBB38;&amp;#xC11C;&amp;#xB098; &amp;#xC608;&amp;#xC2DC;&amp;#xAC00; &amp;#xAC70;&amp;#xC758; &amp;#xC5C6;&amp;#xB294; Thread Impersonation&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC600;&amp;#xB2E4;. &amp;#xC774; &amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xC8FC;&amp;#xC694;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xBB38;&amp;#xC11C;&amp;#xD654;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; system call &lt;code&gt;NtImpersonateThread&lt;/code&gt;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Siloscape&amp;#xB294; main thread&amp;#xB97C; impersonating &amp;#xD558;&amp;#xC5EC; &lt;code&gt;CExecSvc.exe&lt;/code&gt;&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xBAA8;&amp;#xBC29;&amp;#xD558;&amp;#xACE0; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; &amp;#xAE68;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; symbolic link&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;NtSetInformationSymbolicLink&lt;/code&gt;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;. &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xD654; &amp;#xB41C; X &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB97C; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; C &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;-&amp;#xC120;&amp;#xD0DD;&#34;&gt;&lt;a href=&#34;#&amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;-&amp;#xC120;&amp;#xD0DD;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130; &amp;#xC120;&amp;#xD0DD;&#34;&gt;&lt;/a&gt;&amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130; &amp;#xC120;&amp;#xD0DD;&lt;/h1&gt;&lt;p&gt;&amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0; link&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xB4A4;&amp;#xC5D0; Kubernetes &amp;#xB178;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &lt;code&gt;kubectl.exe&lt;/code&gt;&amp;#xC640; Kubernetes &amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC3E;&amp;#xB294;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/06/20/idioth/siloscape/Untitled%204.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;kubectl.exe&lt;/code&gt;&amp;#xB97C; &amp;#xCC3E;&amp;#xACE0; &amp;#xC815;&amp;#xADDC;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; Kubernetes &amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC3E;&amp;#xB294;&amp;#xB2E4;. &amp;#xAC80;&amp;#xC0C9;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xAC80;&amp;#xC0C9;&amp;#xC744; &amp;#xC548; &amp;#xD560; &amp;#xD3F4;&amp;#xB354; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xBCA1;&amp;#xD130;&amp;#xC758; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC778; &amp;#xC778;&amp;#xC218;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/06/20/idioth/siloscape/Untitled%205.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC77C; &amp;#xAC80;&amp;#xC0C9;&amp;#xC744; &amp;#xC704;&amp;#xD574; &lt;code&gt;FindFile&lt;/code&gt;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xB54C; &amp;#xAC80;&amp;#xC0C9; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &lt;code&gt;Program Files&lt;/code&gt;, &lt;code&gt;Program Files (x86)&lt;/code&gt;, &lt;code&gt;Windows&lt;/code&gt;, &lt;code&gt;Users&lt;/code&gt; &amp;#xD3F4;&amp;#xB354;&amp;#xB97C; &amp;#xC81C;&amp;#xC678;&amp;#xD55C;&amp;#xB2E4;. (&amp;#xD574;&amp;#xB2F9; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C;) &amp;#xB450; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xCC3E;&amp;#xC73C;&amp;#xBA74; &amp;#xC804;&amp;#xC5ED; &amp;#xBCC0;&amp;#xC218;&amp;#xC5D0; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xBA48;&amp;#xCD94;&amp;#xACE0; siloscape&amp;#xAC00; &amp;#xC885;&amp;#xB8CC;&amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;kubectl&lt;/code&gt;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC78; &amp;#xBAA8;&amp;#xB450; &amp;#xCC3E;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C; &lt;code&gt;%ls auth can-i create deployments --kubeconfig=%ls&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC190;&amp;#xC0C1;&amp;#xB41C; &amp;#xB178;&amp;#xB4DC;&amp;#xAC00; &amp;#xC545;&amp;#xC131; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD55C;&amp;#xB2E4;. &lt;/p&gt;
&lt;h1 id=&#34;C2-&amp;#xC5F0;&amp;#xACB0;-&amp;#xBC0F;-&amp;#xC9C0;&amp;#xC6D0;-&amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&#34;&gt;&lt;a href=&#34;#C2-&amp;#xC5F0;&amp;#xACB0;-&amp;#xBC0F;-&amp;#xC9C0;&amp;#xC6D0;-&amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&#34; class=&#34;headerlink&#34; title=&#34;C2 &amp;#xC5F0;&amp;#xACB0; &amp;#xBC0F; &amp;#xC9C0;&amp;#xC6D0; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&#34;&gt;&lt;/a&gt;C2 &amp;#xC5F0;&amp;#xACB0; &amp;#xBC0F; &amp;#xC9C0;&amp;#xC6D0; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&lt;/h1&gt;&lt;p&gt;&amp;#xC190;&amp;#xC0C1;&amp;#xB41C; &amp;#xB178;&amp;#xB4DC;&amp;#xAC00; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; deployments&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; C &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xC5D0; &amp;#xD1A0;&amp;#xB974; &amp;#xC544;&amp;#xCE74;&amp;#xC774;&amp;#xBE0C;&amp;#xC640; unzip &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;. &amp;#xD1A0;&amp;#xB974;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD55C; &amp;#xD6C4; &lt;code&gt;tor.exe&lt;/code&gt;&amp;#xB97C; &amp;#xC0C8; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xD1A0;&amp;#xB974; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC758; output&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB300;&amp;#xAE30;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD1A0;&amp;#xB974;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74; &lt;code&gt;.onion&lt;/code&gt; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; IRC &amp;#xC11C;&amp;#xBC84;&amp;#xC778; C2&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB85C; &amp;#xBCF4;&amp;#xD638;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; command line argument&amp;#xC640; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; XOR&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;. C2 &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xD45C;&amp;#xD604;&amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs angelscript&#34;&gt;char hardCodedXor[&lt;span class=&#34;hljs-number&#34;&gt;32&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;HARD_CODED_32_LONG_STRING&amp;quot;&lt;/span&gt;;
char ircPass[&lt;span class=&#34;hljs-number&#34;&gt;32&lt;/span&gt;] = { &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt; };
&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; (&lt;span class=&#34;hljs-built_in&#34;&gt;int&lt;/span&gt; i = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;; i &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;32&lt;/span&gt;; i++)
     ircPass[i] = hardCodedXor[i] ^ argv[&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;][i];&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;IRC &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; &lt;code&gt;JOIN #WindowsKubernetes&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;WindowsKubernetes&lt;/code&gt; IRC &amp;#xCC44;&amp;#xB110;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC04; &amp;#xD6C4; &amp;#xB300;&amp;#xAE30;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Siloscape&amp;#xB294; kubectl &amp;#xC9C0;&amp;#xC6D0; &amp;#xBA85;&amp;#xB839;&amp;#xACFC; Windows &lt;code&gt;cmd&lt;/code&gt; &amp;#xBA85;&amp;#xB839; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC720;&amp;#xD615;&amp;#xC758; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/06/20/idioth/siloscape/Untitled%206.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA85;&amp;#xB839;&amp;#xC744; &lt;code&gt;admin&lt;/code&gt; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xBC1B;&amp;#xC73C;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xB530;&amp;#xB978;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xAC00; &lt;code&gt;K&lt;/code&gt;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xBA74; &lt;code&gt;%ls %s --kubeconfig=%ls&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC3E;&amp;#xC740; &amp;#xACBD;&amp;#xB85C;&amp;#xB85C; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; kubectl &amp;#xBA85;&amp;#xB839; &amp;#xC2E4;&amp;#xD589;&lt;ul&gt;
&lt;li&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130; : &amp;#xC804;&amp;#xC5ED; &amp;#xBCC0;&amp;#xC218;&amp;#xC758; kubectl&amp;#xC758; &amp;#xACBD;&amp;#xB85C;&lt;/li&gt;
&lt;li&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130; : &amp;#xCCAB;&amp;#xBC88;&amp;#xC9F8; &amp;#xBB38;&amp;#xC790;&amp;#xB97C; &amp;#xC81C;&amp;#xC678;&amp;#xD55C; admin&amp;#xC73C;&amp;#xB85C;&amp;#xC758; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&lt;/li&gt;
&lt;li&gt;&amp;#xC138; &amp;#xBC88;&amp;#xC9F8; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130; : &amp;#xC804;&amp;#xC5ED; &amp;#xBCC0;&amp;#xC218;&amp;#xC758; &amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xAC00; &lt;code&gt;C&lt;/code&gt;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xBA74; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xBB38;&amp;#xC790;&amp;#xB97C; &amp;#xBE7C;&amp;#xACE0; Windows cmd &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;&amp;#xACB0;&amp;#xB860;&#34;&gt;&lt;a href=&#34;#&amp;#xACB0;&amp;#xB860;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xACB0;&amp;#xB860;&#34;&gt;&lt;/a&gt;&amp;#xACB0;&amp;#xB860;&lt;/h1&gt;&lt;p&gt;&amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4; &amp;#xD558;&amp;#xC774;&amp;#xC7AC;&amp;#xD0B9;&amp;#xC774;&amp;#xB098; DoS&amp;#xB97C; &amp;#xBAA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xB2EC;&amp;#xB9AC; Siloscape&amp;#xB294; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xBAA9;&amp;#xC801;&amp;#xC5D0;&amp;#xB9CC; &amp;#xAD6D;&amp;#xD55C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC545;&amp;#xC131; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBC31;&amp;#xB3C4;&amp;#xC5B4;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://unit42.paloaltonetworks.com/windows-server-containers-vulnerabilities/&#34;&gt;&amp;#xD544;&amp;#xC790;&amp;#xC758; &amp;#xC9C0;&amp;#xB09C; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xC598;&amp;#xAE30;&amp;#xD588;&amp;#xB4EF; &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xB2A5;&amp;#xC73C;&amp;#xB85C; Windows container&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xB9D0;&amp;#xB77C;&amp;#xACE0; &amp;#xD588;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xB294; security boundary&amp;#xB97C; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xD654;&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xC9C0; &amp;#xB9D0;&amp;#xACE0; Hyper-V &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC78; &amp;#xCD94;&amp;#xCC9C;&amp;#xD55C;&amp;#xB2E4;. Windows Server container&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xBA70; &amp;#xC774;&amp;#xBC88; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; Kubernetes node&amp;#xC600;&amp;#xB2E4;. &amp;#xBCF4;&amp;#xC548;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD55C; Windows Server container&amp;#xC5D0;&amp;#xC11C; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; Hyper-V &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC8C; &amp;#xC88B;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xB294; Kubernetes cluster&amp;#xB97C; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. secured Kubernetes node&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC740; &amp;#xD574;&amp;#xB2F9; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xB9CC;&amp;#xD07C;&amp;#xC758; &amp;#xCDA9;&amp;#xBD84;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC11C; Siloscape&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Siloscape&amp;#xB294; container escape&amp;#xB97C; &amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xBA74; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xC720;&amp;#xBC1C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108; &amp;#xBCF4;&amp;#xC548;&amp;#xC758; &amp;#xC911;&amp;#xC694;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC900;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Translation] Siloscape: First Known Malware Targeting Windows Containers to Compromise Cloud Environments - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. idioth&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6D0;&amp;#xB798; &amp;#xC624;&amp;#xB298;&amp;#xC740; ghidra&amp;#xC758; &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xAC00; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xB0A0;&amp;#xC774;&amp;#xC8E0;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xC0AC;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xC9C1; &amp;#xC800;&amp;#xB294; &amp;#xAE30;&amp;#xB9D0; &amp;#xC2DC;&amp;#xD5D8;&amp;#xC774; &amp;#xB05D;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xACE0; &amp;#xB610; &amp;#xC0AC;&amp;#xBB34;&amp;#xC2E4;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xB178;&amp;#xD2B8;&amp;#xBD81;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; VM&amp;#xC774; &amp;#xC7A0;&amp;#xB4E4;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xB370; &amp;#xC5B4;&amp;#xC81C; &amp;#xBC1C;&amp;#xC5D0; &amp;#xB808;&amp;#xC774;&amp;#xC800; &amp;#xCE58;&amp;#xB8CC;&amp;#xB97C; &amp;#xBC1B;&amp;#xC740; &amp;#xD0D3;&amp;#xC5D0; &amp;#xC798; &amp;#xAC77;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2F5;&amp;#xB2C8;&amp;#xB2E4; &amp;#xD558;&amp;#xD558;&amp;#xD558;. &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xBC1C; &amp;#xB4A4;&amp;#xAFC8;&amp;#xCE58;&amp;#xB85C; &amp;#xAC77;&amp;#xB294; &amp;#xAC70; &amp;#xD560;&amp;#xB9CC;&amp;#xD574;&amp;#xC694; ^^&amp;#x2026;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xC774;&amp;#xB7F0;&amp;#xC800;&amp;#xB7F0; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xAE30;&amp;#xB9D0; &amp;#xC900;&amp;#xBE44; &amp;#xC911;&amp;#xC778; &amp;#xC800;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC2F8;&amp;#xC7A5;&amp;#xB2D8;&amp;#xAED8;&amp;#xC11C; &amp;#xC77D;&amp;#xC73C;&amp;#xB77C;&amp;#xACE0; &amp;#xCD94;&amp;#xCC9C;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0; &amp;#xAE00;&amp;#xC744; &amp;#xC77D;&amp;#xC744; &amp;#xACB8; &amp;#xBC88;&amp;#xC5ED;&amp;#xD574;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xD6C4;&amp;#xBC18;&amp;#xBD80;&amp;#xC5D0; &amp;#xBE80; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC870;&amp;#xAE08; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! Siloscape&amp;#xC758; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5B4;&amp;#xC11C; IRC &amp;#xC811;&amp;#xC18D; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC81C;&amp;#xC678;&amp;#xD558;&amp;#xACE0; &amp;#xBC88;&amp;#xC5ED;&amp;#xC744; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. :)&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; &amp;#xAE00; : &lt;a href=&#34;https://unit42.paloaltonetworks.com/siloscape/&#34;&gt;Siloscape: First Known Malware Targeting Windows Containers to Compromise Cloud Environments&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&#34;Executive-Summary&#34;&gt;&lt;a href=&#34;#Executive-Summary&#34; class=&#34;headerlink&#34; title=&#34;Executive Summary&#34;&gt;&lt;/a&gt;Executive Summary&lt;/h1&gt;&lt;p&gt;2021&amp;#xB144; 3&amp;#xC6D4;&amp;#xC5D0; Windows container&amp;#xB97C; &amp;#xD0C0;&amp;#xAE43;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xCD5C;&amp;#xCD08;&amp;#xC758; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xB2E4;. &amp;#xC9C0;&amp;#xB09C; &amp;#xBA87; &amp;#xB144;&amp;#xAC04; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC;&amp;#xB97C; &amp;#xD0C0;&amp;#xAE43;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC99D;&amp;#xAC00;&amp;#xD55C; &amp;#xAC83;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA74; &amp;#xB180;&amp;#xB78D;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xB2E4;. &amp;#xC774; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; container escape&amp;#xAC00; &amp;#xC8FC;&amp;#xBAA9;&amp;#xC801;&amp;#xC774;&amp;#xACE0; &amp;#xC8FC;&amp;#xB85C; server silo&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C; Siloscape (silo escape&amp;#xCC98;&amp;#xB7FC; &amp;#xB4E4;&amp;#xB9BC; &amp;#x314E;)&amp;#xB77C;&amp;#xACE0; &amp;#xC774;&amp;#xB984; &amp;#xC9C0;&amp;#xC5C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Siloscape&amp;#xB294; Windows container&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Kubernetes clusters&amp;#xB97C; &amp;#xD0C0;&amp;#xAE43;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC774;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xBAA9;&amp;#xC801;&amp;#xC740; &amp;#xC545;&amp;#xC131; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; Kubernetes clusters&amp;#xC5D0; &amp;#xBC31;&amp;#xB3C4;&amp;#xC5B4;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC01; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB294; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xBC18;&amp;#xBA74;&amp;#xC5D0; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xAC1C;&amp;#xBCC4; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; &amp;#xC190;&amp;#xC0C1;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC83;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC804;&amp;#xCCB4; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xC190;&amp;#xC0C1;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xB354; &amp;#xCE58;&amp;#xBA85;&amp;#xC801;&amp;#xC774;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xD574;&amp;#xCEE4;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC774;&amp;#xB984; &amp;#xBC0F; &amp;#xC554;&amp;#xD638;, &amp;#xC870;&amp;#xC9C1;&amp;#xC758; &amp;#xAE30;&amp;#xBC00; &amp;#xC815;&amp;#xBCF4;&amp;#xC640; &amp;#xB0B4;&amp;#xBD80; &amp;#xD30C;&amp;#xC77C; &amp;#xB610;&amp;#xB294; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD161; &amp;#xD638;&amp;#xC2A4;&amp;#xD305; &amp;#xB41C; &amp;#xC804;&amp;#xCCB4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC911;&amp;#xC694; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD6D4;&amp;#xCE60; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD574;&amp;#xCEE4;&amp;#xAC00; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC870;&amp;#xC9C1;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC778;&amp;#xC9C8;&amp;#xB85C; &amp;#xC7A1;&amp;#xC744; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;. &amp;#xB354; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xAC83;&amp;#xC740; &amp;#xB9CE;&amp;#xC740; &amp;#xC870;&amp;#xC9C1;&amp;#xB4E4;&amp;#xC774; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC;&amp;#xB85C; &amp;#xC774;&amp;#xC804;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xAC1C;&amp;#xBC1C;, &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD658;&amp;#xACBD;&amp;#xC73C;&amp;#xB85C; Kubernetes clusters&amp;#xB97C; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD11;&amp;#xBC94;&amp;#xC704;&amp;#xD55C; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xAE09;&amp;#xB9DD; &amp;#xACF5;&amp;#xACA9;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Siloscape&amp;#xB294; C2 (Command and Cotrol) &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC775;&amp;#xBA85;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD1A0;&amp;#xB974; &amp;#xD504;&amp;#xB85D;&amp;#xC2DC;&amp;#xC640; &lt;code&gt;.onion&lt;/code&gt; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;. 23&amp;#xAC1C;(&amp;#xBA85;?, &amp;#xAE30;&amp;#xAD00;&amp;#xC778;&amp;#xC9C0; &amp;#xC0AC;&amp;#xB78C;&amp;#xC778;&amp;#xC9C0; &amp;#xC560;&amp;#xB9E4;&amp;#xD558;&amp;#xB124;&amp;#xC694;)&amp;#xC758; &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xB97C; &amp;#xCC3E;&amp;#xC558;&amp;#xACE0; &amp;#xCD1D; 313&amp;#xBA85;&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB97C; &amp;#xD638;&amp;#xC2A4;&amp;#xD305; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; Siloscape&amp;#xAC00; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xC758; &amp;#xBE59;&amp;#xC0B0;&amp;#xC758; &amp;#xC77C;&amp;#xAC01;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xC900;&amp;#xB2E4;. &amp;#xD544;&amp;#xC790;&amp;#xB294; &amp;#xB610;&amp;#xD55C; &amp;#xC774; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xC774; 1&amp;#xB144; &amp;#xC774;&amp;#xC0C1; &amp;#xC9C0;&amp;#xC18D;&amp;#xB418;&amp;#xC5B4; &amp;#xC654;&amp;#xC74C;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB9AC;&amp;#xD3EC;&amp;#xD2B8;&amp;#xB294; Windows container &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xBC30;&amp;#xACBD; &amp;#xC9C0;&amp;#xC2DD;, Siloscape&amp;#xC758; &amp;#xAE30;&amp;#xC220; &amp;#xAC1C;&amp;#xC694;, Windows container &amp;#xBCF4;&amp;#xC548; &amp;#xAD8C;&amp;#xC7A5; &amp;#xC0AC;&amp;#xD56D;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Windows-Server-Container-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#Windows-Server-Container-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xAC1C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;Windows Server Container &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;/a&gt;Windows Server Container &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xAC1C;&amp;#xC694;&lt;/h1&gt;&lt;p&gt;2020&amp;#xB144; 7&amp;#xC6D4; 15&amp;#xC5D0; &lt;a href=&#34;https://unit42.paloaltonetworks.com/windows-server-containers-vulnerabilities/&#34;&gt;Windows container boundaries&amp;#xC5D0; &amp;#xAD00;&amp;#xD55C; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&lt;/a&gt;&amp;#xACFC; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC791;&amp;#xC131;&amp;#xD588;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; escape &amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xACE0; &amp;#xD574;&amp;#xCEE4;&amp;#xAC00; escape &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC704;&amp;#xD5D8;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xD588;&amp;#xB2E4;. &amp;#xAC00;&amp;#xC7A5; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC740; Kubernetes&amp;#xC758; Windows container node&amp;#xB97C; &amp;#xD0C8;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xD655;&amp;#xC0B0;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC5C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; Windows Server container&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xC774; &amp;#xC774;&amp;#xC288;&amp;#xB97C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC740; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA87; &amp;#xC8FC; &amp;#xD6C4;, Kubernetes&amp;#xAC00; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC774;&amp;#xC288;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD588;&amp;#xB2E4;. &amp;#xAD6C;&amp;#xAE00;&amp;#xC740; &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xC600;&amp;#xACE0; &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xB294; &amp;#xC774; &amp;#xC774;&amp;#xC288;&amp;#xB97C; Windows container&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB85C; escape &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xC600;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C; &amp;#xC5C6;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xAC04;&amp;#xC8FC;&amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xD6C4;&amp;#xC5D0; Windows Server container&amp;#xB97C; &amp;#xD0C0;&amp;#xAE43;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; Siloscape&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xC600;&amp;#xB2E4;. Siloscape&amp;#xB294; Hyper-V&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; Server Container&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; Kubernetes&amp;#xC744; &amp;#xD0C0;&amp;#xAE43;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB41C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC774;&amp;#xBA70; &amp;#xC8FC;&amp;#xBAA9;&amp;#xC801;&amp;#xC740; &amp;#xC124;&amp;#xC815;&amp;#xC774; &amp;#xBBF8;&amp;#xD761;&amp;#xD55C; Kubernetes &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xBC31;&amp;#xB3C4;&amp;#xC5B4;&amp;#xB97C; &amp;#xC5F4;&amp;#xC5B4; &amp;#xC554;&amp;#xD638; &amp;#xD654;&amp;#xD3D0; &amp;#xCC44;&amp;#xAD74;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC545;&amp;#xC131; container&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xACFC; &amp;#xAE30;&amp;#xC220;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xB2E4;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; (1-day)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD0C0;&amp;#xAE43; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&lt;/li&gt;
&lt;li&gt;Windows container escape&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; escape &amp;#xD558;&amp;#xACE0; underlying node&amp;#xC5D0;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&lt;/li&gt;
&lt;li&gt;node&amp;#xC758; &amp;#xC790;&amp;#xACA9; &amp;#xC99D;&amp;#xBA85;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xC804;&amp;#xD30C;&amp;#xB97C; &amp;#xC2DC;&amp;#xB3C4;&lt;/li&gt;
&lt;li&gt;&amp;#xD1A0;&amp;#xB974; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; IRC &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; C2 &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&lt;/li&gt;
&lt;li&gt;&amp;#xCD94;&amp;#xAC00; command &amp;#xB300;&amp;#xAE30;&lt;/li&gt;
&lt;li&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; Kubernetes cluster&amp;#xC758; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD305; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD3D0; &amp;#xCC44;&amp;#xAD74;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC190;&amp;#xC0C1;&amp;#xB41C; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC218;&amp;#xBC31; &amp;#xAC1C;&amp;#xC758; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xC911;&amp;#xC694; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC62C; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;C2 &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xC870;&amp;#xC0AC;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC; &amp;#xC774; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xD070; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xBA70; &amp;#xC774; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xC740; 1&amp;#xB144; &amp;#xC774;&amp;#xC0C1; &amp;#xC9C4;&amp;#xD589;&amp;#xB410;&amp;#xB2E4;. &amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC544;&amp;#xC9C1; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAE30;&amp;#xC220;-&amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#&amp;#xAE30;&amp;#xC220;-&amp;#xAC1C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAE30;&amp;#xC220; &amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;/a&gt;&amp;#xAE30;&amp;#xC220; &amp;#xAC1C;&amp;#xC694;&lt;/h1&gt;&lt;p&gt;Siloscape&amp;#xC758; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xC804;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC790;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/06/20/idioth/siloscape/Untitled.png&#34; alt&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD574;&amp;#xCEE4;&amp;#xB294; 1-day &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774;&amp;#xB098; &amp;#xC6F9;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;, &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; Windows container &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xC6D0;&amp;#xACA9; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2E4;&amp;#xD589; (Remote Code Execution, RCE)&amp;#xC744; &amp;#xC218;&amp;#xD589;&lt;/li&gt;
&lt;li&gt;Siloscape (&lt;code&gt;CloudMalware.exe&lt;/code&gt;)&amp;#xB97C; C2 &amp;#xC811;&amp;#xC18D; &amp;#xC815;&amp;#xBCF4;&amp;#xC640; &amp;#xD568;&amp;#xAED8; command line&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&lt;/li&gt;
&lt;li&gt;Siloscape&amp;#xB294; &lt;code&gt;SeTcbPrivilege&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &lt;code&gt;CExecSvc.exe&lt;/code&gt;&amp;#xB97C; impersonate (&lt;a href=&#34;https://unit42.paloaltonetworks.com/windows-server-containers-vulnerabilities/&#34;&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xAE30;&amp;#xC220; &amp;#xC0C1;&amp;#xC138; &amp;#xB0B4;&amp;#xC6A9; &amp;#xD655;&amp;#xC778; &amp;#xAC00;&amp;#xB2A5;)&lt;/li&gt;
&lt;li&gt;&amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0; global symbolic link&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xD654; &amp;#xB41C; X &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB97C; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; C &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&lt;/li&gt;
&lt;li&gt;global link&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;kubectl.exe&lt;/code&gt;&amp;#xB97C; &amp;#xCC3E;&amp;#xACE0; &amp;#xC815;&amp;#xADDC;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; Kubernetes &amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC3E;&amp;#xC74C;&lt;/li&gt;
&lt;li&gt;&amp;#xC190;&amp;#xC0C1;&amp;#xB41C; &amp;#xB178;&amp;#xB4DC;&amp;#xAC00; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; Kubernetes deployments&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xCDA9;&amp;#xBD84;&amp;#xD55C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;unzip&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD1A0;&amp;#xB974; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB85C; &amp;#xCD94;&amp;#xCD9C; (Siloscape&amp;#xC758; main binary&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC555;&amp;#xCD95;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC74C;)&lt;/li&gt;
&lt;li&gt;&amp;#xD1A0;&amp;#xB974; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&lt;/li&gt;
&lt;li&gt;command line argument&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; C2 &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;.onion&lt;/code&gt; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; C2 &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&lt;/li&gt;
&lt;li&gt;C2 &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xC624;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xAE30;&amp;#xB2E4;&amp;#xB9AC;&amp;#xACE0;, &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xC62C; &amp;#xACBD;&amp;#xC6B0; &amp;#xC2E4;&amp;#xD589;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; &amp;#xD0C0;&amp;#xAE43;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xB2E4;&amp;#xB978; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD3D0; &amp;#xCC44;&amp;#xAD74;&amp;#xC774; &amp;#xC8FC; &amp;#xBAA9;&amp;#xC801;&amp;#xC778; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB4E4;&amp;#xACFC; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; Siloscape&amp;#xB294; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xC190;&amp;#xC0C1;&amp;#xC2DC;&amp;#xD0A4;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;. &amp;#xB300;&amp;#xC2E0;&amp;#xC5D0; &amp;#xD0D0;&amp;#xC9C0; &amp;#xBC0F; &amp;#xCD94;&amp;#xC801;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xBC31;&amp;#xB3C4;&amp;#xC5B4;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC5D0; &amp;#xC9D1;&amp;#xC911;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Defense-&amp;#xC6B0;&amp;#xD68C;&amp;#xC640;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&#34;&gt;&lt;a href=&#34;#Defense-&amp;#xC6B0;&amp;#xD68C;&amp;#xC640;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&#34; class=&#34;headerlink&#34; title=&#34;Defense &amp;#xC6B0;&amp;#xD68C;&amp;#xC640; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&#34;&gt;&lt;/a&gt;Defense &amp;#xC6B0;&amp;#xD68C;&amp;#xC640; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/h1&gt;&lt;p&gt;Siloscape&amp;#xB294; &amp;#xC2EC;&amp;#xD558;&amp;#xAC8C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;. &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xB85C;&amp;#xC9C1;&amp;#xC740; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD558;&amp;#xAE30; &amp;#xB108;&amp;#xBB34; &amp;#xD798;&amp;#xB4E4;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/06/20/idioth/siloscape/Untitled%201.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; API &amp;#xD638;&amp;#xCD9C;&amp;#xB3C4; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB2E8;&amp;#xC21C;&amp;#xD558;&amp;#xAC8C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; Native API (NTAPI)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC600;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/06/20/idioth/siloscape/Untitled%202.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &lt;code&gt;CreateFile&lt;/code&gt;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xC2E0;&amp;#xC5D0; &lt;code&gt;NtCreateFile&lt;/code&gt;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;. &lt;code&gt;NtCreateFile&lt;/code&gt;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xC2E0;&amp;#xC5D0; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;ntdll.dll&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD568;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xCC3E;&amp;#xC544; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC810;&amp;#xD504;&amp;#xD558;&amp;#xC5EC; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;. &amp;#xADF8;&amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xD568;&amp;#xC218;&amp;#xC640; &amp;#xBAA8;&amp;#xB4C8; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xACE0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2A4; &amp;#xC5D4;&amp;#xC9C0;&amp;#xB2C8;&amp;#xC5B4;&amp;#xB9C1; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xD798;&amp;#xB4E0; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Siloscape&amp;#xB294; &amp;#xD55C; &amp;#xC30D;&amp;#xC758; key&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; C2 &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;. &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC7A5; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC740; &amp;#xD0A4; &amp;#xD558;&amp;#xB098;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xD558;&amp;#xB4DC; &amp;#xCF54;&amp;#xB529;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xD558;&amp;#xB098;&amp;#xB294; command line argument&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC774;&amp;#xB2E4;. AutoFocus&amp;#xC640; VirusTotal &amp;#xAC19;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; hash&amp;#xB97C; &amp;#xAC80;&amp;#xC0C9;&amp;#xD574;&amp;#xB3C4; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Siloscape&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xD560; &amp;#xB54C; &amp;#xACE0;&amp;#xC720;&amp;#xD55C; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC720;&amp;#xCD94;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD558;&amp;#xB4DC; &amp;#xCF54;&amp;#xB529;&amp;#xB41C; &amp;#xD0A4;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB4E4;&amp;#xC744; &amp;#xC0B4;&amp;#xC9DD;&amp;#xC529; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; hash&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xC74C;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD55C;&amp;#xB2E4;. &amp;#xB610; hash&amp;#xB9CC;&amp;#xC73C;&amp;#xB85C; Siloscape&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/06/20/idioth/siloscape/Untitled%203.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC740; Visual Studio&amp;#xC758; Resource Manager&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. Visual Studio&amp;#xC5D0; &amp;#xB0B4;&amp;#xC7A5;&amp;#xB41C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD30C;&amp;#xC77C;&amp;#xC774;&amp;#xB4E0; &amp;#xC6D0;&amp;#xBCF8; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; API &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. Siloscape&amp;#xB294; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0; &amp;#xD1A0;&amp;#xB974; &amp;#xC544;&amp;#xCE74;&amp;#xC774;&amp;#xBE0C;&amp;#xC640; &amp;#xC544;&amp;#xCE74;&amp;#xC774;&amp;#xBE0C;&amp;#xB97C; &amp;#xC5F4;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; unzip &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCD94;&amp;#xAC00;&amp;#xD588;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xD1A0;&amp;#xB974;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; C2 &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C; &amp;#xC811;&amp;#xC18D;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;The-Container-Escape&#34;&gt;&lt;a href=&#34;#The-Container-Escape&#34; class=&#34;headerlink&#34; title=&#34;The Container Escape&#34;&gt;&lt;/a&gt;The Container Escape&lt;/h1&gt;&lt;p&gt;Siloscape&amp;#xC758; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC810; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB294; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; escape &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. escape&amp;#xB97C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; system call &lt;code&gt;NtSetInformationSymbolicLink&lt;/code&gt;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &lt;code&gt;SeTcbPrivilege&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; &lt;code&gt;CExecSvc.exe&lt;/code&gt;&amp;#xC5D0; DLL&amp;#xC744; inject &amp;#xD558;&amp;#xACE0; &amp;#xADF8; context&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;NtSetInformationSymbolicLink&lt;/code&gt;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Siloscape&amp;#xB294; &amp;#xAE30;&amp;#xC220; &amp;#xBB38;&amp;#xC11C;&amp;#xB098; &amp;#xC608;&amp;#xC2DC;&amp;#xAC00; &amp;#xAC70;&amp;#xC758; &amp;#xC5C6;&amp;#xB294; Thread Impersonation&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC600;&amp;#xB2E4;. &amp;#xC774; &amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xC8FC;&amp;#xC694;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xBB38;&amp;#xC11C;&amp;#xD654;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; system call &lt;code&gt;NtImpersonateThread&lt;/code&gt;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Siloscape&amp;#xB294; main thread&amp;#xB97C; impersonating &amp;#xD558;&amp;#xC5EC; &lt;code&gt;CExecSvc.exe&lt;/code&gt;&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xBAA8;&amp;#xBC29;&amp;#xD558;&amp;#xACE0; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; &amp;#xAE68;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; symbolic link&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;NtSetInformationSymbolicLink&lt;/code&gt;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;. &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xD654; &amp;#xB41C; X &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB97C; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; C &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;-&amp;#xC120;&amp;#xD0DD;&#34;&gt;&lt;a href=&#34;#&amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;-&amp;#xC120;&amp;#xD0DD;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130; &amp;#xC120;&amp;#xD0DD;&#34;&gt;&lt;/a&gt;&amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130; &amp;#xC120;&amp;#xD0DD;&lt;/h1&gt;&lt;p&gt;&amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0; link&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xB4A4;&amp;#xC5D0; Kubernetes &amp;#xB178;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &lt;code&gt;kubectl.exe&lt;/code&gt;&amp;#xC640; Kubernetes &amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC3E;&amp;#xB294;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/06/20/idioth/siloscape/Untitled%204.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;kubectl.exe&lt;/code&gt;&amp;#xB97C; &amp;#xCC3E;&amp;#xACE0; &amp;#xC815;&amp;#xADDC;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; Kubernetes &amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC3E;&amp;#xB294;&amp;#xB2E4;. &amp;#xAC80;&amp;#xC0C9;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xAC80;&amp;#xC0C9;&amp;#xC744; &amp;#xC548; &amp;#xD560; &amp;#xD3F4;&amp;#xB354; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xBCA1;&amp;#xD130;&amp;#xC758; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC778; &amp;#xC778;&amp;#xC218;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/06/20/idioth/siloscape/Untitled%205.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC77C; &amp;#xAC80;&amp;#xC0C9;&amp;#xC744; &amp;#xC704;&amp;#xD574; &lt;code&gt;FindFile&lt;/code&gt;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xB54C; &amp;#xAC80;&amp;#xC0C9; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &lt;code&gt;Program Files&lt;/code&gt;, &lt;code&gt;Program Files (x86)&lt;/code&gt;, &lt;code&gt;Windows&lt;/code&gt;, &lt;code&gt;Users&lt;/code&gt; &amp;#xD3F4;&amp;#xB354;&amp;#xB97C; &amp;#xC81C;&amp;#xC678;&amp;#xD55C;&amp;#xB2E4;. (&amp;#xD574;&amp;#xB2F9; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C;) &amp;#xB450; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xCC3E;&amp;#xC73C;&amp;#xBA74; &amp;#xC804;&amp;#xC5ED; &amp;#xBCC0;&amp;#xC218;&amp;#xC5D0; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xBA48;&amp;#xCD94;&amp;#xACE0; siloscape&amp;#xAC00; &amp;#xC885;&amp;#xB8CC;&amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;kubectl&lt;/code&gt;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC78; &amp;#xBAA8;&amp;#xB450; &amp;#xCC3E;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C; &lt;code&gt;%ls auth can-i create deployments --kubeconfig=%ls&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC190;&amp;#xC0C1;&amp;#xB41C; &amp;#xB178;&amp;#xB4DC;&amp;#xAC00; &amp;#xC545;&amp;#xC131; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD55C;&amp;#xB2E4;. &lt;/p&gt;
&lt;h1 id=&#34;C2-&amp;#xC5F0;&amp;#xACB0;-&amp;#xBC0F;-&amp;#xC9C0;&amp;#xC6D0;-&amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&#34;&gt;&lt;a href=&#34;#C2-&amp;#xC5F0;&amp;#xACB0;-&amp;#xBC0F;-&amp;#xC9C0;&amp;#xC6D0;-&amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&#34; class=&#34;headerlink&#34; title=&#34;C2 &amp;#xC5F0;&amp;#xACB0; &amp;#xBC0F; &amp;#xC9C0;&amp;#xC6D0; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&#34;&gt;&lt;/a&gt;C2 &amp;#xC5F0;&amp;#xACB0; &amp;#xBC0F; &amp;#xC9C0;&amp;#xC6D0; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&lt;/h1&gt;&lt;p&gt;&amp;#xC190;&amp;#xC0C1;&amp;#xB41C; &amp;#xB178;&amp;#xB4DC;&amp;#xAC00; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; deployments&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; C &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xC5D0; &amp;#xD1A0;&amp;#xB974; &amp;#xC544;&amp;#xCE74;&amp;#xC774;&amp;#xBE0C;&amp;#xC640; unzip &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;. &amp;#xD1A0;&amp;#xB974;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD55C; &amp;#xD6C4; &lt;code&gt;tor.exe&lt;/code&gt;&amp;#xB97C; &amp;#xC0C8; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xD1A0;&amp;#xB974; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC758; output&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB300;&amp;#xAE30;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD1A0;&amp;#xB974;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74; &lt;code&gt;.onion&lt;/code&gt; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; IRC &amp;#xC11C;&amp;#xBC84;&amp;#xC778; C2&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB85C; &amp;#xBCF4;&amp;#xD638;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; command line argument&amp;#xC640; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; XOR&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;. C2 &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xD45C;&amp;#xD604;&amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs angelscript&#34;&gt;char hardCodedXor[&lt;span class=&#34;hljs-number&#34;&gt;32&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;HARD_CODED_32_LONG_STRING&amp;quot;&lt;/span&gt;;
char ircPass[&lt;span class=&#34;hljs-number&#34;&gt;32&lt;/span&gt;] = { &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt; };
&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; (&lt;span class=&#34;hljs-built_in&#34;&gt;int&lt;/span&gt; i = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;; i &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;32&lt;/span&gt;; i++)
     ircPass[i] = hardCodedXor[i] ^ argv[&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;][i];&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;IRC &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; &lt;code&gt;JOIN #WindowsKubernetes&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;WindowsKubernetes&lt;/code&gt; IRC &amp;#xCC44;&amp;#xB110;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC04; &amp;#xD6C4; &amp;#xB300;&amp;#xAE30;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Siloscape&amp;#xB294; kubectl &amp;#xC9C0;&amp;#xC6D0; &amp;#xBA85;&amp;#xB839;&amp;#xACFC; Windows &lt;code&gt;cmd&lt;/code&gt; &amp;#xBA85;&amp;#xB839; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC720;&amp;#xD615;&amp;#xC758; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/06/20/idioth/siloscape/Untitled%206.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA85;&amp;#xB839;&amp;#xC744; &lt;code&gt;admin&lt;/code&gt; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xBC1B;&amp;#xC73C;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xB530;&amp;#xB978;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xAC00; &lt;code&gt;K&lt;/code&gt;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xBA74; &lt;code&gt;%ls %s --kubeconfig=%ls&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC3E;&amp;#xC740; &amp;#xACBD;&amp;#xB85C;&amp;#xB85C; &amp;#xD074;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; kubectl &amp;#xBA85;&amp;#xB839; &amp;#xC2E4;&amp;#xD589;&lt;ul&gt;
&lt;li&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130; : &amp;#xC804;&amp;#xC5ED; &amp;#xBCC0;&amp;#xC218;&amp;#xC758; kubectl&amp;#xC758; &amp;#xACBD;&amp;#xB85C;&lt;/li&gt;
&lt;li&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130; : &amp;#xCCAB;&amp;#xBC88;&amp;#xC9F8; &amp;#xBB38;&amp;#xC790;&amp;#xB97C; &amp;#xC81C;&amp;#xC678;&amp;#xD55C; admin&amp;#xC73C;&amp;#xB85C;&amp;#xC758; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&lt;/li&gt;
&lt;li&gt;&amp;#xC138; &amp;#xBC88;&amp;#xC9F8; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130; : &amp;#xC804;&amp;#xC5ED; &amp;#xBCC0;&amp;#xC218;&amp;#xC758; &amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xAC00; &lt;code&gt;C&lt;/code&gt;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xBA74; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xBB38;&amp;#xC790;&amp;#xB97C; &amp;#xBE7C;&amp;#xACE0; Windows cmd &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;&amp;#xACB0;&amp;#xB860;&#34;&gt;&lt;a href=&#34;#&amp;#xACB0;&amp;#xB860;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xACB0;&amp;#xB860;&#34;&gt;&lt;/a&gt;&amp;#xACB0;&amp;#xB860;&lt;/h1&gt;&lt;p&gt;&amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4; &amp;#xD558;&amp;#xC774;&amp;#xC7AC;&amp;#xD0B9;&amp;#xC774;&amp;#xB098; DoS&amp;#xB97C; &amp;#xBAA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xB2EC;&amp;#xB9AC; Siloscape&amp;#xB294; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xBAA9;&amp;#xC801;&amp;#xC5D0;&amp;#xB9CC; &amp;#xAD6D;&amp;#xD55C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC545;&amp;#xC131; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBC31;&amp;#xB3C4;&amp;#xC5B4;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://unit42.paloaltonetworks.com/windows-server-containers-vulnerabilities/&#34;&gt;&amp;#xD544;&amp;#xC790;&amp;#xC758; &amp;#xC9C0;&amp;#xB09C; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xC598;&amp;#xAE30;&amp;#xD588;&amp;#xB4EF; &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xB2A5;&amp;#xC73C;&amp;#xB85C; Windows container&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xB9D0;&amp;#xB77C;&amp;#xACE0; &amp;#xD588;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xB294; security boundary&amp;#xB97C; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xD654;&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xC9C0; &amp;#xB9D0;&amp;#xACE0; Hyper-V &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC78; &amp;#xCD94;&amp;#xCC9C;&amp;#xD55C;&amp;#xB2E4;. Windows Server container&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xBA70; &amp;#xC774;&amp;#xBC88; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; Kubernetes node&amp;#xC600;&amp;#xB2E4;. &amp;#xBCF4;&amp;#xC548;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD55C; Windows Server container&amp;#xC5D0;&amp;#xC11C; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; Hyper-V &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC8C; &amp;#xC88B;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xB294; Kubernetes cluster&amp;#xB97C; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. secured Kubernetes node&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC740; &amp;#xD574;&amp;#xB2F9; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xB9CC;&amp;#xD07C;&amp;#xC758; &amp;#xCDA9;&amp;#xBD84;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC11C; Siloscape&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Siloscape&amp;#xB294; container escape&amp;#xB97C; &amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xBA74; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xC720;&amp;#xBC1C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108; &amp;#xBCF4;&amp;#xC548;&amp;#xC758; &amp;#xC911;&amp;#xC694;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC900;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/06/20/idioth/siloscape/Untitled.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/06/20/idioth/siloscape/">

  <title>[Translation] Siloscape: First Known Malware Targeting Windows Containers to Compromise Cloud Environments - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-06-20 18:00" pubdate>
      2021 6 20 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3.6k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      71
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Translation] Siloscape: First Known Malware Targeting Windows Containers to Compromise Cloud Environments</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;. idioth&#xC785;&#xB2C8;&#xB2E4;. &#xC6D0;&#xB798; &#xC624;&#xB298;&#xC740; ghidra&#xC758; &#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xAC00; &#xB098;&#xC624;&#xB294; &#xB0A0;&#xC774;&#xC8E0;. &#xD558;&#xC9C0;&#xB9CC; &#xC5EC;&#xB7EC; &#xAC00;&#xC9C0; &#xC0AC;&#xC815;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xBC88;&#xC5ED;&#xAE00;&#xC744; &#xC791;&#xC131;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC5B4;&#xC694;.</p>
<p>&#xC544;&#xC9C1; &#xC800;&#xB294; &#xAE30;&#xB9D0; &#xC2DC;&#xD5D8;&#xC774; &#xB05D;&#xB098;&#xC9C0; &#xC54A;&#xC558;&#xACE0; &#xB610; &#xC0AC;&#xBB34;&#xC2E4;&#xC5D0; &#xC788;&#xB294; &#xB178;&#xD2B8;&#xBD81;&#xC5D0; &#xBD84;&#xC11D;&#xD55C; VM&#xC774; &#xC7A0;&#xB4E4;&#xC5B4; &#xC788;&#xB294;&#xB370; &#xC5B4;&#xC81C; &#xBC1C;&#xC5D0; &#xB808;&#xC774;&#xC800; &#xCE58;&#xB8CC;&#xB97C; &#xBC1B;&#xC740; &#xD0D3;&#xC5D0; &#xC798; &#xAC77;&#xC9C0; &#xBABB;&#xD558;&#xACE0; &#xC788;&#xB2F5;&#xB2C8;&#xB2E4; &#xD558;&#xD558;&#xD558;. &#xC0DD;&#xAC01;&#xBCF4;&#xB2E4; &#xBC1C; &#xB4A4;&#xAFC8;&#xCE58;&#xB85C; &#xAC77;&#xB294; &#xAC70; &#xD560;&#xB9CC;&#xD574;&#xC694; ^^&#x2026;.</p>
<p>&#xC544;&#xBB34;&#xD2BC; &#xC774;&#xB7F0;&#xC800;&#xB7F0; &#xC774;&#xC720;&#xB85C; &#xAE30;&#xB9D0; &#xC900;&#xBE44; &#xC911;&#xC778; &#xC800;&#xC5D0;&#xAC8C; &#xC2F8;&#xC7A5;&#xB2D8;&#xAED8;&#xC11C; &#xC77D;&#xC73C;&#xB77C;&#xACE0; &#xCD94;&#xCC9C;&#xD574;&#xC8FC;&#xC2E0; &#xAE00;&#xC744; &#xC77D;&#xC744; &#xACB8; &#xBC88;&#xC5ED;&#xD574;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;! &#xD6C4;&#xBC18;&#xBD80;&#xC5D0; &#xBE80; &#xBD80;&#xBD84;&#xC774; &#xC870;&#xAE08; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! Siloscape&#xC758; &#xD589;&#xC704;&#xB97C; &#xBCF4;&#xACE0; &#xC2F6;&#xC5B4;&#xC11C; IRC &#xC811;&#xC18D; &#xBD80;&#xBD84;&#xC740; &#xC81C;&#xC678;&#xD558;&#xACE0; &#xBC88;&#xC5ED;&#xC744; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. :)</p>
<blockquote>
<p>&#xC6D0;&#xBB38; &#xAE00; : <a target="_blank" rel="external nofollow noopener noreferrer" href="https://unit42.paloaltonetworks.com/siloscape/">Siloscape: First Known Malware Targeting Windows Containers to Compromise Cloud Environments</a></p>
</blockquote>
<h1 id="Executive-Summary"><a href="#Executive-Summary" class="headerlink" title="Executive Summary"></a>Executive Summary</h1><p>2021&#xB144; 3&#xC6D4;&#xC5D0; Windows container&#xB97C; &#xD0C0;&#xAE43;&#xC73C;&#xB85C; &#xD558;&#xB294; &#xCD5C;&#xCD08;&#xC758; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB97C; &#xBC1C;&#xACAC;&#xD588;&#xB2E4;. &#xC9C0;&#xB09C; &#xBA87; &#xB144;&#xAC04; &#xD074;&#xB77C;&#xC6B0;&#xB4DC;&#xB97C; &#xD0C0;&#xAE43;&#xC73C;&#xB85C; &#xD55C; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xAC00; &#xC99D;&#xAC00;&#xD55C; &#xAC83;&#xC744; &#xC0DD;&#xAC01;&#xD558;&#xBA74; &#xB180;&#xB78D;&#xC9C0;&#xB294; &#xC54A;&#xB2E4;. &#xC774; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB294; container escape&#xAC00; &#xC8FC;&#xBAA9;&#xC801;&#xC774;&#xACE0; &#xC8FC;&#xB85C; server silo&#xB97C; &#xD1B5;&#xD574; Windows&#xC5D0;&#xC11C; &#xAD6C;&#xD604;&#xB418;&#xBBC0;&#xB85C; Siloscape (silo escape&#xCC98;&#xB7FC; &#xB4E4;&#xB9BC; &#x314E;)&#xB77C;&#xACE0; &#xC774;&#xB984; &#xC9C0;&#xC5C8;&#xB2E4;.</p>
<p>Siloscape&#xB294; Windows container&#xB97C; &#xD1B5;&#xD574; Kubernetes clusters&#xB97C; &#xD0C0;&#xAE43;&#xC73C;&#xB85C; &#xD558;&#xB294; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xC774;&#xB2E4;. &#xC8FC;&#xBAA9;&#xC801;&#xC740; &#xC545;&#xC131; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD574; &#xCDE8;&#xC57D;&#xD55C; Kubernetes clusters&#xC5D0; &#xBC31;&#xB3C4;&#xC5B4;&#xB97C; &#xC124;&#xCE58;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p>
<p>&#xAC01; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xB294; &#xD558;&#xB098;&#xC758; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xBC18;&#xBA74;&#xC5D0; &#xD558;&#xB098;&#xC758; &#xD074;&#xB7EC;&#xC2A4;&#xD130;&#xB294; &#xC5EC;&#xB7EC; &#xAC1C;&#xC758; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC744; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xAC1C;&#xBCC4; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xB97C; &#xC190;&#xC0C1;&#xC2DC;&#xD0A4;&#xB294; &#xAC83;&#xBCF4;&#xB2E4; &#xC804;&#xCCB4; &#xD074;&#xB7EC;&#xC2A4;&#xD130;&#xB97C; &#xC190;&#xC0C1;&#xC2DC;&#xD0A4;&#xB294; &#xAC83;&#xC774; &#xB354; &#xCE58;&#xBA85;&#xC801;&#xC774;&#xB2E4;. &#xC608;&#xC2DC;&#xB85C; &#xD574;&#xCEE4;&#xAC00; &#xC0AC;&#xC6A9;&#xC790; &#xC774;&#xB984; &#xBC0F; &#xC554;&#xD638;, &#xC870;&#xC9C1;&#xC758; &#xAE30;&#xBC00; &#xC815;&#xBCF4;&#xC640; &#xB0B4;&#xBD80; &#xD30C;&#xC77C; &#xB610;&#xB294; &#xD074;&#xB7EC;&#xC2A4;&#xD161; &#xD638;&#xC2A4;&#xD305; &#xB41C; &#xC804;&#xCCB4; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC640; &#xAC19;&#xC740; &#xC911;&#xC694; &#xC815;&#xBCF4;&#xB97C; &#xD6D4;&#xCE60; &#xC218; &#xC788;&#xB2E4;. &#xD574;&#xCEE4;&#xAC00; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB97C; &#xD1B5;&#xD574; &#xC870;&#xC9C1;&#xC758; &#xD30C;&#xC77C;&#xC744; &#xC778;&#xC9C8;&#xB85C; &#xC7A1;&#xC744; &#xC218;&#xB3C4; &#xC788;&#xB2E4;. &#xB354; &#xC2EC;&#xAC01;&#xD55C; &#xAC83;&#xC740; &#xB9CE;&#xC740; &#xC870;&#xC9C1;&#xB4E4;&#xC774; &#xD074;&#xB77C;&#xC6B0;&#xB4DC;&#xB85C; &#xC774;&#xC804;&#xD558;&#xBA74;&#xC11C; &#xAC1C;&#xBC1C;, &#xD14C;&#xC2A4;&#xD2B8; &#xD658;&#xACBD;&#xC73C;&#xB85C; Kubernetes clusters&#xB97C; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xC810;&#xC5D0;&#xC11C; &#xAD11;&#xBC94;&#xC704;&#xD55C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xACF5;&#xAE09;&#xB9DD; &#xACF5;&#xACA9;&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xB2E4;.</p>
<p>Siloscape&#xB294; C2 (Command and Cotrol) &#xC11C;&#xBC84;&#xC5D0; &#xC775;&#xBA85;&#xC73C;&#xB85C; &#xC5F0;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xD1A0;&#xB974; &#xD504;&#xB85D;&#xC2DC;&#xC640; <code>.onion</code> &#xB3C4;&#xBA54;&#xC778;&#xC744; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;. 23&#xAC1C;(&#xBA85;?, &#xAE30;&#xAD00;&#xC778;&#xC9C0; &#xC0AC;&#xB78C;&#xC778;&#xC9C0; &#xC560;&#xB9E4;&#xD558;&#xB124;&#xC694;)&#xC758; &#xD53C;&#xD574;&#xC790;&#xB97C; &#xCC3E;&#xC558;&#xACE0; &#xCD1D; 313&#xBA85;&#xC758; &#xC0AC;&#xC6A9;&#xC790;&#xB97C; &#xD638;&#xC2A4;&#xD305; &#xD558;&#xB294;&#xB370; &#xC11C;&#xBC84;&#xAC00; &#xC0AC;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xC74C;&#xC744; &#xBC1C;&#xACAC;&#xD588;&#xB2E4;. &#xC774;&#xB294; Siloscape&#xAC00; &#xCEA0;&#xD398;&#xC778;&#xC758; &#xBE59;&#xC0B0;&#xC758; &#xC77C;&#xAC01;&#xC774;&#xB77C;&#xB294; &#xBD80;&#xBD84;&#xC744; &#xC54C;&#xB824;&#xC900;&#xB2E4;. &#xD544;&#xC790;&#xB294; &#xB610;&#xD55C; &#xC774; &#xCEA0;&#xD398;&#xC778;&#xC774; 1&#xB144; &#xC774;&#xC0C1; &#xC9C0;&#xC18D;&#xB418;&#xC5B4; &#xC654;&#xC74C;&#xC744; &#xBC1C;&#xACAC;&#xD588;&#xB2E4;.</p>
<p>&#xC774; &#xB9AC;&#xD3EC;&#xD2B8;&#xB294; Windows container &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xBC30;&#xACBD; &#xC9C0;&#xC2DD;, Siloscape&#xC758; &#xAE30;&#xC220; &#xAC1C;&#xC694;, Windows container &#xBCF4;&#xC548; &#xAD8C;&#xC7A5; &#xC0AC;&#xD56D;&#xC744; &#xC81C;&#xACF5;&#xD55C;&#xB2E4;.</p>
<h1 id="Windows-Server-Container-&#xCDE8;&#xC57D;&#xC810;-&#xAC1C;&#xC694;"><a href="#Windows-Server-Container-&#xCDE8;&#xC57D;&#xC810;-&#xAC1C;&#xC694;" class="headerlink" title="Windows Server Container &#xCDE8;&#xC57D;&#xC810; &#xAC1C;&#xC694;"></a>Windows Server Container &#xCDE8;&#xC57D;&#xC810; &#xAC1C;&#xC694;</h1><p>2020&#xB144; 7&#xC6D4; 15&#xC5D0; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://unit42.paloaltonetworks.com/windows-server-containers-vulnerabilities/">Windows container boundaries&#xC5D0; &#xAD00;&#xD55C; &#xAC8C;&#xC2DC;&#xAE00;</a>&#xACFC; &#xC5B4;&#xB5BB;&#xAC8C; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xC791;&#xC131;&#xD588;&#xB2E4;. &#xC774; &#xAC8C;&#xC2DC;&#xAE00;&#xC5D0;&#xC11C; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xB97C; escape &#xD558;&#xB294; &#xAE30;&#xC220;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xD574;&#xCEE4;&#xAC00; escape &#xD560; &#xC218; &#xC788;&#xB294; &#xC704;&#xD5D8;&#xC774; &#xC788;&#xB294; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0; &#xB300;&#xD574; &#xC774;&#xC57C;&#xAE30;&#xD588;&#xB2E4;. &#xAC00;&#xC7A5; &#xC911;&#xC694;&#xD55C; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC740; Kubernetes&#xC758; Windows container node&#xB97C; &#xD0C8;&#xCD9C;&#xD558;&#xC5EC; &#xD074;&#xB7EC;&#xC2A4;&#xD130;&#xB97C; &#xD655;&#xC0B0;&#xC2DC;&#xD0A4;&#xB294; &#xAC83;&#xC774;&#xC5C8;&#xB2E4;.</p>
<p>&#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8;&#xC5D0;&#xC11C; Windows Server container&#xB294; &#xBCF4;&#xC548; &#xAE30;&#xB2A5;&#xC774; &#xC544;&#xB2C8;&#xB77C;&#xB294; &#xC774;&#xC720;&#xB85C; &#xC774; &#xC774;&#xC288;&#xB97C; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xC0DD;&#xAC01;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xCEE8;&#xD14C;&#xC774;&#xB108; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xAC01;&#xAC01;&#xC758; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC740; &#xD638;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C; &#xC9C1;&#xC811; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xAC83;&#xCC98;&#xB7FC; &#xCC98;&#xB9AC;&#xB418;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;.</p>
<p>&#xBA87; &#xC8FC; &#xD6C4;, Kubernetes&#xAC00; &#xC774;&#xB7EC;&#xD55C; &#xC774;&#xC288;&#xC5D0; &#xCDE8;&#xC57D;&#xD558;&#xB2E4;&#xACE0; &#xAD6C;&#xAE00;&#xC5D0; &#xC804;&#xB2EC;&#xD588;&#xB2E4;. &#xAD6C;&#xAE00;&#xC740; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8;&#xC5D0; &#xC804;&#xB2EC;&#xD558;&#xC600;&#xACE0; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8;&#xB294; &#xC774; &#xC774;&#xC288;&#xB97C; Windows container&#xC5D0;&#xC11C; &#xD638;&#xC2A4;&#xD2B8;&#xB85C; escape &#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xACB0;&#xC815;&#xD558;&#xC600;&#xC9C0;&#xB9CC; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xC5D0;&#xC11C; &#xAD00;&#xB9AC;&#xC790; &#xAD8C;&#xD55C; &#xC5C6;&#xC774; &#xC2E4;&#xD589;&#xB418;&#xBA74; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xAC04;&#xC8FC;&#xB41C;&#xB2E4;.</p>
<p>&#xADF8; &#xD6C4;&#xC5D0; Windows Server container&#xB97C; &#xD0C0;&#xAE43;&#xC73C;&#xB85C; &#xD55C; &#xC545;&#xC131;&#xCF54;&#xB4DC; Siloscape&#xB97C; &#xBC1C;&#xACAC;&#xD558;&#xC600;&#xB2E4;. Siloscape&#xB294; Hyper-V&#xAC00; &#xC544;&#xB2CC; Server Container&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; Kubernetes&#xC744; &#xD0C0;&#xAE43;&#xC73C;&#xB85C; &#xD558;&#xB294; &#xB09C;&#xB3C5;&#xD654;&#xB41C; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xC774;&#xBA70; &#xC8FC;&#xBAA9;&#xC801;&#xC740; &#xC124;&#xC815;&#xC774; &#xBBF8;&#xD761;&#xD55C; Kubernetes &#xD074;&#xB7EC;&#xC2A4;&#xD130;&#xC5D0; &#xBC31;&#xB3C4;&#xC5B4;&#xB97C; &#xC5F4;&#xC5B4; &#xC554;&#xD638; &#xD654;&#xD3D0; &#xCC44;&#xAD74;&#xACFC; &#xAC19;&#xC740; &#xC545;&#xC131; container&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p>
<p>&#xC545;&#xC131;&#xCF54;&#xB4DC;&#xC758; &#xB3D9;&#xC791;&#xACFC; &#xAE30;&#xC220;&#xC5D0; &#xB300;&#xD55C; &#xD2B9;&#xC9D5;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xB2E4;:</p>
<ul>
<li>&#xC54C;&#xB824;&#xC9C4; &#xCDE8;&#xC57D;&#xC810; (1-day)&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD0C0;&#xAE43; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0; &#xC811;&#xADFC;</li>
<li>Windows container escape&#xB97C; &#xD1B5;&#xD574; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xB97C; escape &#xD558;&#xACE0; underlying node&#xC5D0;&#xC11C; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;</li>
<li>node&#xC758; &#xC790;&#xACA9; &#xC99D;&#xBA85;&#xC744; &#xD1B5;&#xD574; &#xD074;&#xB7EC;&#xC2A4;&#xD130;&#xC5D0; &#xC804;&#xD30C;&#xB97C; &#xC2DC;&#xB3C4;</li>
<li>&#xD1A0;&#xB974; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xD1B5;&#xD574; IRC &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; C2 &#xC11C;&#xBC84;&#xC5D0; &#xC811;&#xC18D;</li>
<li>&#xCD94;&#xAC00; command &#xB300;&#xAE30;</li>
<li></li>
</ul>
<p>&#xC774; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB294; Kubernetes cluster&#xC758; &#xCEF4;&#xD4E8;&#xD305; &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC554;&#xD638;&#xD654;&#xD3D0; &#xCC44;&#xAD74;&#xC744; &#xC218;&#xD589;&#xD558;&#xACE0; &#xC190;&#xC0C1;&#xB41C; &#xD074;&#xB7EC;&#xC2A4;&#xD130;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xC218;&#xBC31; &#xAC1C;&#xC758; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xC911;&#xC694; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAC00;&#xC838;&#xC62C; &#xC218; &#xC788;&#xB2E4;.</p>
<p>C2 &#xC11C;&#xBC84;&#xB97C; &#xC870;&#xC0AC;&#xD55C; &#xACB0;&#xACFC; &#xC774; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB294; &#xD070; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC758; &#xC77C;&#xBD80;&#xBD84;&#xC774;&#xBA70; &#xC774; &#xCEA0;&#xD398;&#xC778;&#xC740; 1&#xB144; &#xC774;&#xC0C1; &#xC9C4;&#xD589;&#xB410;&#xB2E4;. &#xAC8C;&#xB2E4;&#xAC00; &#xCEA0;&#xD398;&#xC778;&#xC758; &#xD2B9;&#xC815; &#xBD80;&#xBD84;&#xC774; &#xC544;&#xC9C1; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4;&#xC788;&#xB2E4;.</p>
<h1 id="&#xAE30;&#xC220;-&#xAC1C;&#xC694;"><a href="#&#xAE30;&#xC220;-&#xAC1C;&#xC694;" class="headerlink" title="&#xAE30;&#xC220; &#xAC1C;&#xC694;"></a>&#xAE30;&#xC220; &#xAC1C;&#xC694;</h1><p>Siloscape&#xC758; &#xC790;&#xC138;&#xD55C; &#xAE30;&#xC220;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xAE30; &#xC804;&#xC5D0; &#xC804;&#xBC18;&#xC801;&#xC778; &#xD589;&#xC704;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xC790;.</p>
<p><img src="/2021/06/20/idioth/siloscape/Untitled.png" srcset="/img/loading.gif" alt></p>
<ol>
<li>&#xD574;&#xCEE4;&#xB294; 1-day &#xCDE8;&#xC57D;&#xC810;&#xC774;&#xB098; &#xC6F9;&#xD398;&#xC774;&#xC9C0;, &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; Windows container &#xB0B4;&#xBD80;&#xC5D0; &#xC6D0;&#xACA9; &#xCF54;&#xB4DC; &#xC2E4;&#xD589; (Remote Code Execution, RCE)&#xC744; &#xC218;&#xD589;</li>
<li>Siloscape (<code>CloudMalware.exe</code>)&#xB97C; C2 &#xC811;&#xC18D; &#xC815;&#xBCF4;&#xC640; &#xD568;&#xAED8; command line&#xC73C;&#xB85C; &#xC2E4;&#xD589;</li>
<li>Siloscape&#xB294; <code>SeTcbPrivilege</code> &#xAD8C;&#xD55C;&#xC744; &#xC5BB;&#xAE30; &#xC704;&#xD574; <code>CExecSvc.exe</code>&#xB97C; impersonate (<a target="_blank" rel="external nofollow noopener noreferrer" href="https://unit42.paloaltonetworks.com/windows-server-containers-vulnerabilities/">&#xD574;&#xB2F9; &#xAC8C;&#xC2DC;&#xAE00;</a>&#xC5D0;&#xC11C; &#xAE30;&#xC220; &#xC0C1;&#xC138; &#xB0B4;&#xC6A9; &#xD655;&#xC778; &#xAC00;&#xB2A5;)</li>
<li>&#xD638;&#xC2A4;&#xD2B8;&#xC5D0; global symbolic link&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xD654; &#xB41C; X &#xB4DC;&#xB77C;&#xC774;&#xBE0C;&#xB97C; &#xD638;&#xC2A4;&#xD2B8;&#xC758; C &#xB4DC;&#xB77C;&#xC774;&#xBE0C;&#xC5D0; &#xC5F0;&#xACB0;</li>
<li>global link&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD638;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C; &#xC774;&#xB984;&#xC73C;&#xB85C; <code>kubectl.exe</code>&#xB97C; &#xCC3E;&#xACE0; &#xC815;&#xADDC;&#xC2DD;&#xC73C;&#xB85C; Kubernetes &#xC124;&#xC815; &#xD30C;&#xC77C;&#xC744; &#xCC3E;&#xC74C;</li>
<li>&#xC190;&#xC0C1;&#xB41C; &#xB178;&#xB4DC;&#xAC00; &#xC0C8;&#xB85C;&#xC6B4; Kubernetes deployments&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xB294; &#xAD8C;&#xD55C;&#xC774; &#xCDA9;&#xBD84;&#xD55C;&#xC9C0; &#xD655;&#xC778;</li>
<li>unzip&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xC555;&#xCD95; &#xD30C;&#xC77C;&#xC5D0;&#xC11C; &#xD1A0;&#xB974; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xB514;&#xC2A4;&#xD06C;&#xB85C; &#xCD94;&#xCD9C; (Siloscape&#xC758; main binary&#xC5D0; &#xD30C;&#xC77C;&#xC774; &#xC555;&#xCD95;&#xB418;&#xC5B4; &#xC788;&#xC74C;)</li>
<li>&#xD1A0;&#xB974; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xC5F0;&#xACB0;</li>
<li>command line argument&#xB97C; &#xD1B5;&#xD574; C2 &#xC11C;&#xBC84;&#xC758; &#xBE44;&#xBC00;&#xBC88;&#xD638;&#xB97C; &#xC554;&#xD638;&#xD654;</li>
<li><code>.onion</code> &#xB3C4;&#xBA54;&#xC778;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; C2 &#xC11C;&#xBC84;&#xC5D0; &#xC5F0;&#xACB0;</li>
<li>C2 &#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xC624;&#xB294; &#xBA85;&#xB839;&#xC744; &#xAE30;&#xB2E4;&#xB9AC;&#xACE0;, &#xBA85;&#xB839;&#xC774; &#xC62C; &#xACBD;&#xC6B0; &#xC2E4;&#xD589;</li>
</ol>
<p>&#xCEE8;&#xD14C;&#xC774;&#xB108;&#xB97C; &#xD0C0;&#xAE43;&#xC73C;&#xB85C; &#xD55C; &#xB2E4;&#xB978; &#xC554;&#xD638;&#xD654;&#xD3D0; &#xCC44;&#xAD74;&#xC774; &#xC8FC; &#xBAA9;&#xC801;&#xC778; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB4E4;&#xACFC; &#xB2E4;&#xB974;&#xAC8C; Siloscape&#xB294; &#xD074;&#xB7EC;&#xC2A4;&#xD130;&#xB97C; &#xC190;&#xC0C1;&#xC2DC;&#xD0A4;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xB300;&#xC2E0;&#xC5D0; &#xD0D0;&#xC9C0; &#xBC0F; &#xCD94;&#xC801;&#xC744; &#xBC29;&#xC9C0;&#xD558;&#xACE0; &#xD074;&#xB7EC;&#xC2A4;&#xD130;&#xC5D0; &#xBC31;&#xB3C4;&#xC5B4;&#xB97C; &#xC124;&#xCE58;&#xD558;&#xB294; &#xB370;&#xC5D0; &#xC9D1;&#xC911;&#xD588;&#xB2E4;.</p>
<h1 id="Defense-&#xC6B0;&#xD68C;&#xC640;-&#xB09C;&#xB3C5;&#xD654;"><a href="#Defense-&#xC6B0;&#xD68C;&#xC640;-&#xB09C;&#xB3C5;&#xD654;" class="headerlink" title="Defense &#xC6B0;&#xD68C;&#xC640; &#xB09C;&#xB3C5;&#xD654;"></a>Defense &#xC6B0;&#xD68C;&#xC640; &#xB09C;&#xB3C5;&#xD654;</h1><p>Siloscape&#xB294; &#xC2EC;&#xD558;&#xAC8C; &#xB09C;&#xB3C5;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xC77D;&#xC744; &#xC218; &#xC5C6;&#xB2E4;. &#xB09C;&#xB3C5;&#xD654; &#xB85C;&#xC9C1;&#xC740; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xC9C0;&#xB9CC; &#xB9AC;&#xBC84;&#xC2F1; &#xD558;&#xAE30; &#xB108;&#xBB34; &#xD798;&#xB4E4;&#xB2E4;.</p>
<p><img src="/2021/06/20/idioth/siloscape/Untitled%201.png" srcset="/img/loading.gif" alt></p>
<p>&#xB2E8;&#xC21C;&#xD55C; API &#xD638;&#xCD9C;&#xB3C4; &#xB09C;&#xB3C5;&#xD654; &#xB418;&#xC5B4;&#xC788;&#xC73C;&#xBA70; &#xD568;&#xC218;&#xB97C; &#xB2E8;&#xC21C;&#xD558;&#xAC8C; &#xD638;&#xCD9C;&#xD558;&#xC9C0; &#xC54A;&#xACE0; Native API (NTAPI)&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC600;&#xB2E4;.</p>
<p><img src="/2021/06/20/idioth/siloscape/Untitled%202.png" srcset="/img/loading.gif" alt></p>
<p>&#xC608;&#xC2DC;&#xB85C; <code>CreateFile</code>&#xC744; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xB300;&#xC2E0;&#xC5D0; <code>NtCreateFile</code>&#xC744; &#xD638;&#xCD9C;&#xD55C;&#xB2E4;. <code>NtCreateFile</code>&#xC744; &#xC9C1;&#xC811; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xB300;&#xC2E0;&#xC5D0; &#xB7F0;&#xD0C0;&#xC784;&#xC5D0;&#xC11C; <code>ntdll.dll</code>&#xC5D0;&#xC11C; &#xD568;&#xC218; &#xC774;&#xB984;&#xC744; &#xCC3E;&#xC544; &#xC8FC;&#xC18C;&#xB85C; &#xC810;&#xD504;&#xD558;&#xC5EC; &#xD638;&#xCD9C;&#xD55C;&#xB2E4;. &#xADF8;&#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; &#xD568;&#xC218;&#xC640; &#xBAA8;&#xB4C8; &#xC774;&#xB984;&#xC744; &#xB09C;&#xB3C5;&#xD654;&#xD558;&#xACE0; &#xB7F0;&#xD0C0;&#xC784;&#xC5D0;&#xC11C; &#xBCF5;&#xD638;&#xD654;&#xD55C;&#xB2E4;. &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC73C;&#xB85C;&#xB294; &#xBD84;&#xC11D;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xACE0; &#xB9AC;&#xBC84;&#xC2A4; &#xC5D4;&#xC9C0;&#xB2C8;&#xC5B4;&#xB9C1; &#xD558;&#xB294;&#xB370; &#xD798;&#xB4E0; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xC774;&#xB2E4;.</p>
<p>Siloscape&#xB294; &#xD55C; &#xC30D;&#xC758; key&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; C2 &#xC11C;&#xBC84;&#xC758; &#xBE44;&#xBC00;&#xBC88;&#xD638;&#xB97C; &#xBCF5;&#xD638;&#xD654;&#xD55C;&#xB2E4;. &#xB09C;&#xB3C5;&#xD654; &#xC911;&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xC911;&#xC694;&#xD55C; &#xD2B9;&#xC9D5;&#xC740; &#xD0A4; &#xD558;&#xB098;&#xB294; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0; &#xD558;&#xB4DC; &#xCF54;&#xB529;&#xB418;&#xC5B4; &#xC788;&#xB294;&#xB370;, &#xD558;&#xB098;&#xB294; command line argument&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xB41C;&#xB2E4;&#xB294; &#xC810;&#xC774;&#xB2E4;. AutoFocus&#xC640; VirusTotal &#xAC19;&#xC740; &#xC5EC;&#xB7EC; &#xC5D4;&#xC9C4;&#xC5D0;&#xC11C; hash&#xB97C; &#xAC80;&#xC0C9;&#xD574;&#xB3C4; &#xACB0;&#xACFC;&#xB97C; &#xCC3E;&#xC744; &#xC218; &#xC5C6;&#xC5C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; Siloscape&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xACF5;&#xACA9;&#xC744; &#xD560; &#xB54C; &#xACE0;&#xC720;&#xD55C; &#xD0A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xCEF4;&#xD30C;&#xC77C;&#xC744; &#xD558;&#xB294; &#xAC83;&#xC744; &#xC720;&#xCD94;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xD558;&#xB4DC; &#xCF54;&#xB529;&#xB41C; &#xD0A4;&#xB294; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB4E4;&#xC744; &#xC0B4;&#xC9DD;&#xC529; &#xB2E4;&#xB974;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC11C; hash&#xB97C; &#xD1B5;&#xD574; &#xCC3E;&#xC744; &#xC218; &#xC5C6;&#xC74C;&#xC744; &#xC124;&#xBA85;&#xD55C;&#xB2E4;. &#xB610; hash&#xB9CC;&#xC73C;&#xB85C; Siloscape&#xB97C; &#xD0D0;&#xC9C0;&#xD560; &#xC218; &#xC5C6;&#xB2E4;.</p>
<p><img src="/2021/06/20/idioth/siloscape/Untitled%203.png" srcset="/img/loading.gif" alt></p>
<p>&#xB2E4;&#xB978; &#xD765;&#xBBF8;&#xB85C;&#xC6B4; &#xD2B9;&#xC9D5;&#xC740; Visual Studio&#xC758; Resource Manager&#xB97C; &#xC0AC;&#xC6A9;&#xD55C; &#xAC83;&#xC774;&#xB2E4;. Visual Studio&#xC5D0; &#xB0B4;&#xC7A5;&#xB41C; &#xAE30;&#xB2A5;&#xC73C;&#xB85C; &#xC5B4;&#xB5A4; &#xD30C;&#xC77C;&#xC774;&#xB4E0; &#xC6D0;&#xBCF8; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0; &#xCD94;&#xAC00;&#xD560; &#xC218; &#xC788;&#xACE0; &#xAC04;&#xB2E8;&#xD55C; API &#xD638;&#xCD9C;&#xC744; &#xD1B5;&#xD574; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xB2E4;. Siloscape&#xB294; &#xB514;&#xC2A4;&#xD06C;&#xC5D0; &#xD1A0;&#xB974; &#xC544;&#xCE74;&#xC774;&#xBE0C;&#xC640; &#xC544;&#xCE74;&#xC774;&#xBE0C;&#xB97C; &#xC5F4;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xB418;&#xB294; unzip &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xCD94;&#xAC00;&#xD588;&#xB2E4;. &#xB610;&#xD55C; &#xD1A0;&#xB974;&#xB97C; &#xD1B5;&#xD574; C2 &#xC11C;&#xBC84;&#xC5D0; &#xC548;&#xC804;&#xD558;&#xAC8C; &#xC811;&#xC18D;&#xD55C;&#xB2E4;.</p>
<h1 id="The-Container-Escape"><a href="#The-Container-Escape" class="headerlink" title="The Container Escape"></a>The Container Escape</h1><p>Siloscape&#xC758; &#xD765;&#xBBF8;&#xB85C;&#xC6B4; &#xC810; &#xC911; &#xD558;&#xB098;&#xB294; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xB97C; escape &#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;. escape&#xB97C; &#xD558;&#xAE30; &#xC704;&#xD574; system call <code>NtSetInformationSymbolicLink</code>&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB824;&#xBA74; <code>SeTcbPrivilege</code> &#xAD8C;&#xD55C;&#xC744; &#xC5BB;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;. &#xC5EC;&#xAE30;&#xC5D0;&#xB294; &#xBA87; &#xAC00;&#xC9C0; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xAD8C;&#xD55C;&#xC744; &#xAC00;&#xC9C4; <code>CExecSvc.exe</code>&#xC5D0; DLL&#xC744; inject &#xD558;&#xACE0; &#xADF8; context&#xC5D0;&#xC11C; <code>NtSetInformationSymbolicLink</code>&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; Siloscape&#xB294; &#xAE30;&#xC220; &#xBB38;&#xC11C;&#xB098; &#xC608;&#xC2DC;&#xAC00; &#xAC70;&#xC758; &#xC5C6;&#xB294; Thread Impersonation&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC600;&#xB2E4;. &#xC774; &#xAE30;&#xC220;&#xC758; &#xC8FC;&#xC694;&#xD55C; &#xD568;&#xC218;&#xB294; &#xBB38;&#xC11C;&#xD654;&#xB418;&#xC9C0; &#xC54A;&#xC740; system call <code>NtImpersonateThread</code>&#xC774;&#xB2E4;.</p>
<p>Siloscape&#xB294; main thread&#xB97C; impersonating &#xD558;&#xC5EC; <code>CExecSvc.exe</code>&#xC758; &#xAD8C;&#xD55C;&#xC744; &#xBAA8;&#xBC29;&#xD558;&#xACE0; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xB97C; &#xAE68;&#xAE30; &#xC704;&#xD574; &#xC0C8;&#xB85C; &#xC0DD;&#xC131;&#xB41C; symbolic link&#xC5D0;&#xC11C; <code>NtSetInformationSymbolicLink</code>&#xB97C; &#xD638;&#xCD9C;&#xD55C;&#xB2E4;. &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xD654; &#xB41C; X &#xB4DC;&#xB77C;&#xC774;&#xBE0C;&#xB97C; &#xD638;&#xC2A4;&#xD2B8;&#xC758; C &#xB4DC;&#xB77C;&#xC774;&#xBE0C;&#xC5D0; &#xC5F0;&#xACB0;&#xD55C;&#xB2E4;.</p>
<h1 id="&#xD074;&#xB7EC;&#xC2A4;&#xD130;-&#xC120;&#xD0DD;"><a href="#&#xD074;&#xB7EC;&#xC2A4;&#xD130;-&#xC120;&#xD0DD;" class="headerlink" title="&#xD074;&#xB7EC;&#xC2A4;&#xD130; &#xC120;&#xD0DD;"></a>&#xD074;&#xB7EC;&#xC2A4;&#xD130; &#xC120;&#xD0DD;</h1><p>&#xD638;&#xC2A4;&#xD2B8;&#xC5D0; link&#xB97C; &#xC0DD;&#xC131;&#xD55C; &#xB4A4;&#xC5D0; Kubernetes &#xB178;&#xB4DC;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; <code>kubectl.exe</code>&#xC640; Kubernetes &#xC124;&#xC815; &#xD30C;&#xC77C;&#xC744; &#xCC3E;&#xB294;&#xB2E4;.</p>
<p><img src="/2021/06/20/idioth/siloscape/Untitled%204.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xB984;&#xC744; &#xD1B5;&#xD574; <code>kubectl.exe</code>&#xB97C; &#xCC3E;&#xACE0; &#xC815;&#xADDC;&#xC2DD;&#xC744; &#xC0AC;&#xC6A9;&#xD574; Kubernetes &#xC124;&#xC815; &#xD30C;&#xC77C;&#xC744; &#xCC3E;&#xB294;&#xB2E4;. &#xAC80;&#xC0C9;&#xD558;&#xB294; &#xD568;&#xC218;&#xB294; &#xAC80;&#xC0C9;&#xC744; &#xC548; &#xD560; &#xD3F4;&#xB354; &#xC774;&#xB984;&#xC774; &#xD3EC;&#xD568;&#xB41C; &#xBCA1;&#xD130;&#xC758; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xC778;&#xC218;&#xB85C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;.</p>
<p><img src="/2021/06/20/idioth/siloscape/Untitled%205.png" srcset="/img/loading.gif" alt></p>
<p>&#xD30C;&#xC77C; &#xAC80;&#xC0C9;&#xC744; &#xC704;&#xD574; <code>FindFile</code>&#xC744; &#xD638;&#xCD9C;&#xD560; &#xB54C; &#xAC80;&#xC0C9; &#xC18D;&#xB3C4;&#xB97C; &#xBE60;&#xB974;&#xAC8C; &#xD558;&#xAE30; &#xC704;&#xD574; <code>Program Files</code>, <code>Program Files (x86)</code>, <code>Windows</code>, <code>Users</code> &#xD3F4;&#xB354;&#xB97C; &#xC81C;&#xC678;&#xD55C;&#xB2E4;. (&#xD574;&#xB2F9; &#xD3F4;&#xB354;&#xC5D0; &#xD30C;&#xC77C;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xC744; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xB192;&#xC73C;&#xBBC0;&#xB85C;) &#xB450; &#xD30C;&#xC77C;&#xC744; &#xBAA8;&#xB450; &#xCC3E;&#xC73C;&#xBA74; &#xC804;&#xC5ED; &#xBCC0;&#xC218;&#xC5D0; &#xACBD;&#xB85C;&#xAC00; &#xC800;&#xC7A5;&#xB41C;&#xB2E4;. &#xD30C;&#xC77C;&#xC774; &#xC5C6;&#xC73C;&#xBA74; &#xACF5;&#xACA9;&#xC744; &#xBA48;&#xCD94;&#xACE0; siloscape&#xAC00; &#xC885;&#xB8CC;&#xB41C;&#xB2E4;.</p>
<p><code>kubectl</code>&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294;&#xB370; &#xD544;&#xC694;&#xD55C; &#xAC78; &#xBAA8;&#xB450; &#xCC3E;&#xC740; &#xB2E4;&#xC74C; <code>%ls auth can-i create deployments --kubeconfig=%ls</code> &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xD1B5;&#xD574; &#xC190;&#xC0C1;&#xB41C; &#xB178;&#xB4DC;&#xAC00; &#xC545;&#xC131; &#xD589;&#xC704;&#xB97C; &#xD560; &#xC218; &#xC788;&#xB294; &#xAD8C;&#xD55C;&#xC774; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD55C;&#xB2E4;. </p>
<h1 id="C2-&#xC5F0;&#xACB0;-&#xBC0F;-&#xC9C0;&#xC6D0;-&#xBA85;&#xB839;&#xC5B4;"><a href="#C2-&#xC5F0;&#xACB0;-&#xBC0F;-&#xC9C0;&#xC6D0;-&#xBA85;&#xB839;&#xC5B4;" class="headerlink" title="C2 &#xC5F0;&#xACB0; &#xBC0F; &#xC9C0;&#xC6D0; &#xBA85;&#xB839;&#xC5B4;"></a>C2 &#xC5F0;&#xACB0; &#xBC0F; &#xC9C0;&#xC6D0; &#xBA85;&#xB839;&#xC5B4;</h1><p>&#xC190;&#xC0C1;&#xB41C; &#xB178;&#xB4DC;&#xAC00; &#xC0C8;&#xB85C;&#xC6B4; deployments&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA74; &#xD638;&#xC2A4;&#xD2B8;&#xC758; C &#xB4DC;&#xB77C;&#xC774;&#xBE0C;&#xC5D0; &#xD1A0;&#xB974; &#xC544;&#xCE74;&#xC774;&#xBE0C;&#xC640; unzip &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xCD94;&#xCD9C;&#xD55C;&#xB2E4;. &#xD1A0;&#xB974;&#xB97C; &#xCD94;&#xCD9C;&#xD55C; &#xD6C4; <code>tor.exe</code>&#xB97C; &#xC0C8; &#xC2A4;&#xB808;&#xB4DC;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xACE0; &#xD1A0;&#xB974; &#xC2A4;&#xB808;&#xB4DC;&#xC758; output&#xC744; &#xD655;&#xC778;&#xD560; &#xB54C;&#xAE4C;&#xC9C0; &#xB300;&#xAE30;&#xD55C;&#xB2E4;.</p>
<p>&#xD1A0;&#xB974;&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xBA74; <code>.onion</code> &#xB3C4;&#xBA54;&#xC778;&#xC744; &#xD1B5;&#xD574; IRC &#xC11C;&#xBC84;&#xC778; C2&#xC5D0; &#xC5F0;&#xACB0;&#xD55C;&#xB2E4;.</p>
<p>&#xC11C;&#xBC84;&#xB294; &#xBE44;&#xBC00;&#xBC88;&#xD638;&#xB85C; &#xBCF4;&#xD638;&#xB418;&#xACE0; &#xC788;&#xACE0; command line argument&#xC640; &#xBC14;&#xC774;&#xD2B8; XOR&#xC744; &#xD1B5;&#xD574; &#xBCF5;&#xD638;&#xD654;&#xD55C;&#xB2E4;. C2 &#xC11C;&#xBC84;&#xC758; &#xBCF5;&#xD638;&#xD654; &#xB85C;&#xC9C1;&#xC744; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xD45C;&#xD604;&#xD558;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xB2E4;.</p>
<pre><code class="hljs angelscript">char hardCodedXor[<span class="hljs-number">32</span>] = <span class="hljs-string">&quot;HARD_CODED_32_LONG_STRING&quot;</span>;
char ircPass[<span class="hljs-number">32</span>] = { <span class="hljs-number">0</span> };
<span class="hljs-keyword">for</span> (<span class="hljs-built_in">int</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">32</span>; i++)
     ircPass[i] = hardCodedXor[i] ^ argv[<span class="hljs-number">1</span>][i];</code></pre>
<p>IRC &#xC11C;&#xBC84;&#xC5D0; &#xC5F0;&#xACB0;&#xC774; &#xC131;&#xACF5;&#xD558;&#xBA74; <code>JOIN #WindowsKubernetes</code> &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; <code>WindowsKubernetes</code> IRC &#xCC44;&#xB110;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC04; &#xD6C4; &#xB300;&#xAE30;&#xD55C;&#xB2E4;.</p>
<p>Siloscape&#xB294; kubectl &#xC9C0;&#xC6D0; &#xBA85;&#xB839;&#xACFC; Windows <code>cmd</code> &#xBA85;&#xB839; &#xB450; &#xAC00;&#xC9C0; &#xC720;&#xD615;&#xC758; &#xBA85;&#xB839;&#xC774; &#xC788;&#xB2E4;.</p>
<p><img src="/2021/06/20/idioth/siloscape/Untitled%206.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA85;&#xB839;&#xC744; <code>admin</code> &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xBC1B;&#xC73C;&#xBA74; &#xB2E4;&#xC74C; &#xB85C;&#xC9C1;&#xC744; &#xB530;&#xB978;&#xB2E4;.</p>
<ul>
<li>&#xBA54;&#xC2DC;&#xC9C0;&#xAC00; <code>K</code>&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xBA74; <code>%ls %s --kubeconfig=%ls</code> &#xBA85;&#xB839;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xC5EC; &#xC704;&#xC5D0;&#xC11C; &#xCC3E;&#xC740; &#xACBD;&#xB85C;&#xB85C; &#xD074;&#xB7EC;&#xC2A4;&#xD130;&#xC5D0; kubectl &#xBA85;&#xB839; &#xC2E4;&#xD589;<ul>
<li>&#xCCAB; &#xBC88;&#xC9F8; &#xD30C;&#xB77C;&#xBBF8;&#xD130; : &#xC804;&#xC5ED; &#xBCC0;&#xC218;&#xC758; kubectl&#xC758; &#xACBD;&#xB85C;</li>
<li>&#xB450; &#xBC88;&#xC9F8; &#xD30C;&#xB77C;&#xBBF8;&#xD130; : &#xCCAB;&#xBC88;&#xC9F8; &#xBB38;&#xC790;&#xB97C; &#xC81C;&#xC678;&#xD55C; admin&#xC73C;&#xB85C;&#xC758; &#xBA54;&#xC2DC;&#xC9C0;</li>
<li>&#xC138; &#xBC88;&#xC9F8; &#xD30C;&#xB77C;&#xBBF8;&#xD130; : &#xC804;&#xC5ED; &#xBCC0;&#xC218;&#xC758; &#xC124;&#xC815; &#xD30C;&#xC77C; &#xACBD;&#xB85C;</li>
</ul>
</li>
<li>&#xBA54;&#xC2DC;&#xC9C0;&#xAC00; <code>C</code>&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xBA74; &#xCCAB; &#xBC88;&#xC9F8; &#xBB38;&#xC790;&#xB97C; &#xBE7C;&#xACE0; Windows cmd &#xBA85;&#xB839;&#xC744; &#xC2E4;&#xD589;</li>
</ul>
<h1 id="&#xACB0;&#xB860;"><a href="#&#xACB0;&#xB860;" class="headerlink" title="&#xACB0;&#xB860;"></a>&#xACB0;&#xB860;</h1><p>&#xB9AC;&#xC18C;&#xC2A4; &#xD558;&#xC774;&#xC7AC;&#xD0B9;&#xC774;&#xB098; DoS&#xB97C; &#xBAA9;&#xC801;&#xC73C;&#xB85C; &#xD55C; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xC640; &#xB2EC;&#xB9AC; Siloscape&#xB294; &#xD558;&#xB098;&#xC758; &#xBAA9;&#xC801;&#xC5D0;&#xB9CC; &#xAD6D;&#xD55C;&#xB418;&#xC9C0; &#xC54A;&#xACE0; &#xB2E4;&#xC591;&#xD55C; &#xC545;&#xC131; &#xD589;&#xC704;&#xB97C; &#xC218;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD574; &#xBC31;&#xB3C4;&#xC5B4;&#xB97C; &#xC124;&#xCE58;&#xD55C;&#xB2E4;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://unit42.paloaltonetworks.com/windows-server-containers-vulnerabilities/">&#xD544;&#xC790;&#xC758; &#xC9C0;&#xB09C; &#xAC8C;&#xC2DC;&#xAE00;</a>&#xC5D0;&#xC11C; &#xC598;&#xAE30;&#xD588;&#xB4EF; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8;&#xB294; &#xBCF4;&#xC548; &#xAE30;&#xB2A5;&#xC73C;&#xB85C; Windows container&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xB9D0;&#xB77C;&#xACE0; &#xD588;&#xB2E4;. &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8;&#xB294; security boundary&#xB97C; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xD654;&#xC5D0; &#xC758;&#xC874;&#xD558;&#xC9C0; &#xB9D0;&#xACE0; Hyper-V &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC78; &#xCD94;&#xCC9C;&#xD55C;&#xB2E4;. Windows Server container&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xBAA8;&#xB4E0; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xD638;&#xC2A4;&#xD2B8;&#xC758; &#xAD00;&#xB9AC;&#xC790; &#xAD8C;&#xD55C;&#xC744; &#xAC00;&#xC9C4; &#xAC83;&#xC73C;&#xB85C; &#xC0DD;&#xAC01;&#xD574;&#xC57C; &#xD558;&#xBA70; &#xC774;&#xBC88; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; Kubernetes node&#xC600;&#xB2E4;. &#xBCF4;&#xC548;&#xC774; &#xD544;&#xC694;&#xD55C; Windows Server container&#xC5D0;&#xC11C; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xACBD;&#xC6B0; Hyper-V &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC8C; &#xC88B;&#xB2E4;.</p>
<p>&#xAC8C;&#xB2E4;&#xAC00; &#xAD00;&#xB9AC;&#xC790;&#xB294; Kubernetes cluster&#xB97C; &#xC548;&#xC804;&#xD558;&#xAC8C; &#xC124;&#xC815;&#xD574;&#xC57C; &#xD55C;&#xB2E4;. secured Kubernetes node&#xC758; &#xAD8C;&#xD55C;&#xC740; &#xD574;&#xB2F9; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xAC00; &#xC2E4;&#xD589;&#xB420; &#xB9CC;&#xD07C;&#xC758; &#xCDA9;&#xBD84;&#xD55C; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xC5B4;&#xC11C; Siloscape&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;.</p>
<p>Siloscape&#xB294; container escape&#xB97C; &#xD558;&#xC9C0; &#xBABB;&#xD558;&#xBA74; &#xD53C;&#xD574;&#xB97C; &#xC720;&#xBC1C;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xC810;&#xC5D0;&#xC11C; &#xCEE8;&#xD14C;&#xC774;&#xB108; &#xBCF4;&#xC548;&#xC758; &#xC911;&#xC694;&#xC131;&#xC744; &#xBCF4;&#xC5EC;&#xC900;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Translation/">Translation</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/idioth/">idioth</a>
                  
                  <a class="hover-with-bg" href="/tags/cloud/">cloud</a>
                  
                  <a class="hover-with-bg" href="/tags/malware/">malware</a>
                  
                  <a class="hover-with-bg" href="/tags/containers/">containers</a>
                  
                  <a class="hover-with-bg" href="/tags/kubernetes/">kubernetes</a>
                  
                  <a class="hover-with-bg" href="/tags/siloscape/">siloscape</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_idioth.jpg" srcset="/img/loading.gif" alt="idioth">
                  </div>

                  <div class="link-text">
                    <div class="link-title">idioth</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/idioth">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/06/21/idioth/2021-06-21/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] VirusTotal Grafana Admin Panel bypass</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/06/20/j0ker/2021-06-20/">
                    <span class="hidden-mobile">[] Bypassing Image Load Kernel Callbacks</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/06/20/idioth/siloscape/';
        this.page.identifier = '/2021/06/20/idioth/siloscape/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Translation] Siloscape: First Known Malware Targeting Windows Containers to Compromise Cloud Environments&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
