

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! ogu123&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/p&gt;
&lt;p&gt;Part1&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; COM&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBCBD;&amp;#xC744; &amp;#xB290;&amp;#xAEF4;..? &amp;#xB2E4;&amp;#xB978; &amp;#xBD84;&amp;#xC57C;&amp;#xB85C; &amp;#xB3C4;&amp;#xB9DD;&amp;#xAC00;&amp;#xB824;&amp;#xB2E4; COM&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C;&amp;#xC9C0;?&amp;#xB77C;&amp;#xB294; &amp;#xB9D0;&amp;#xC5D0; &amp;#xC194;&amp;#xAE43;&amp;#xD574; Part2&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. &amp;#xD558;&amp;#xD558;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C;! Part2&amp;#xB294; Red Team&amp;#xC774;&amp;#xB098; &amp;#xB0B4;&amp;#xBD80; &amp;#xCE68;&amp;#xD22C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC911; Lateral Movement&amp;#xC5D0; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; DCOM&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC798;&amp;#xBABB;&amp;#xB41C; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; RCE, LPE &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C4;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB2C8; &amp;#xC2E0;&amp;#xB098;&amp;#xAC8C; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB7EC; &amp;#xAC00;&amp;#xBCF4;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&lt;del&gt;(&amp;#xC8FC;&amp;#xC758; : Part2&amp;#xB294; &amp;#xC2E4;&amp;#xC2B5;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC774;&amp;#xB860;&amp;#xC774; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/Part2.jpg&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;DCOM&#34;&gt;&lt;a href=&#34;#DCOM&#34; class=&#34;headerlink&#34; title=&#34;DCOM&#34;&gt;&lt;/a&gt;DCOM&lt;/h1&gt;&lt;p&gt;COM&amp;#xACFC; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; DCOM(Distributed Component Object Model) &amp;#xB610;&amp;#xD55C; &lt;a href=&#34;https://learn.microsoft.com/ko-kr/openspecs/windows_protocols/ms-dcom/86b9cf84-df2e-4f0b-ac22-1b957627e1ca&#34;&gt;Microsoft &amp;#xAE30;&amp;#xC220;&lt;/a&gt;&amp;#xB85C; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;DCOM(&amp;#xBD84;&amp;#xC0B0; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8; &amp;#xAC1D;&amp;#xCCB4; &amp;#xBAA8;&amp;#xB378;) &amp;#xC6D0;&amp;#xACA9; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC740; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131; &amp;#xBC0F; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xAC1D;&amp;#xCCB4; &amp;#xCC38;&amp;#xC870;, &amp;#xAC1D;&amp;#xCCB4; &amp;#xC218;&amp;#xBA85; &amp;#xBC0F; &amp;#xAC1D;&amp;#xCCB4; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xCFFC;&amp;#xB9AC;&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; COM(&amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8; &amp;#xAC1D;&amp;#xCCB4; &amp;#xBAA8;&amp;#xB378;)&amp;#xC744; &amp;#xD655;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB124;&amp;#x2026; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB124;&amp;#xC694;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC27D;&amp;#xAC8C;! DCOM&amp;#xC740; COM&amp;#xC758; &amp;#xD655;&amp;#xC7A5;&amp;#xC73C;&amp;#xB85C;, &amp;#xC6D0;&amp;#xACA9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB9C8;&amp;#xCE58; &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xC6D0;&amp;#xACA9;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC624;&amp;#xBA74; &amp;#xC11C;&amp;#xBC84; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0;, &amp;#xC6D0;&amp;#xACA9; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; COM&amp;#xC758; &amp;#xD638;&amp;#xCD9C;&amp;#xACFC; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC720;&amp;#xD615;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC744; &amp;#xC9DA;&amp;#xACE0; DCOM&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;COM-&amp;#xAC1D;&amp;#xCCB4;-&amp;#xC694;&amp;#xCCAD;-&amp;#xCC98;&amp;#xB9AC;-&amp;#xC21C;&amp;#xC11C;&#34;&gt;&lt;a href=&#34;#COM-&amp;#xAC1D;&amp;#xCCB4;-&amp;#xC694;&amp;#xCCAD;-&amp;#xCC98;&amp;#xB9AC;-&amp;#xC21C;&amp;#xC11C;&#34; class=&#34;headerlink&#34; title=&#34;COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xC21C;&amp;#xC11C;&#34;&gt;&lt;/a&gt;COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xC21C;&amp;#xC11C;&lt;/h1&gt;&lt;p&gt;Windows&amp;#xC5D0;&amp;#xC11C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xBC0F; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xACFC;&amp;#xC815;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;del&gt;(tip : &amp;#xC544;&amp;#xB798; &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xBCF4;&amp;#xBA74; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xC3D9;&amp;#xC3D9; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/1.png&#34; alt&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xC694;&amp;#xCCAD;&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &lt;code&gt;CoCreateInstance&lt;/code&gt;, &lt;code&gt;CoGetClassObject&lt;/code&gt; &amp;#xB4F1;&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xB97C; CLSID &amp;#xB610;&amp;#xB294; ProgID&amp;#xB97C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xC694;&amp;#xCCAD;&amp;#xC740; COM &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;(ole32.dll)&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;SCM(Service Control Manager)&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;COM &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB294; SCM&amp;#xC5D0;&amp;#xAC8C; &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; CLSID &amp;#xB610;&amp;#xB294; ProgID&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; COM &amp;#xC11C;&amp;#xBC84;(DLL &amp;#xB610;&amp;#xB294; EXE)&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xB2EC;&amp;#xB77C;&amp;#xACE0; &amp;#xC694;&amp;#xCCAD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;SCM&amp;#xC740; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;(&lt;code&gt;HKCR\CLSID&lt;/code&gt; &amp;#xB610;&amp;#xB294; &lt;code&gt;HKCR\ProgID&lt;/code&gt;)&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC5EC;, &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; CLSID &amp;#xB610;&amp;#xB294; ProgID&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; COM &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;COM &amp;#xC11C;&amp;#xBC84; &amp;#xB85C;&amp;#xB4DC;&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;SCM&amp;#xC740; &amp;#xD655;&amp;#xC778;&amp;#xB41C; COM &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0;, &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; CLSID &amp;#xB610;&amp;#xB294; ProgID&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; Class Factory&amp;#xC758; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;Class Factory&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC0DD;&amp;#xC131; &amp;#xBC0F; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;Class Factory&amp;#xB294; &lt;code&gt;CreateInstance&lt;/code&gt; &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; CLSID &amp;#xB610;&amp;#xB294; ProgID&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC0DD;&amp;#xC131;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC694;&amp;#xCCAD;&amp;#xD55C; &amp;#xD2B9;&amp;#xC815; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xBC18;&amp;#xD658;&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;Class Factory&amp;#xAC00; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xBA74;, &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; COM &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC5D0; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;COM &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB294; &amp;#xC774; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC804;&amp;#xB2EC;&amp;#xBC1B;&amp;#xC740; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&amp;#xC640; &amp;#xC18D;&amp;#xC131;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/ogu.jpg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB124;&amp;#x2026; &amp;#xCC9C;&amp;#xCC9C;&amp;#xD788; &amp;#xC77D;&amp;#xB2E4; &amp;#xBCF4;&amp;#xBA74; &amp;#xD06C;&amp;#xAC8C; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBA40;&amp;#xB9AC;&amp;#xC11C; &amp;#xBCF4;&amp;#xBA74; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD574; &amp;#xBCF4;&amp;#xC774;&amp;#xB124;&amp;#xC694;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB9B0; &amp;#xC774;&amp;#xC720;&amp;#xB294; Part1&amp;#xC5D0;&amp;#xC11C; COM &amp;#xD638;&amp;#xCD9C; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC548; &amp;#xB2E4;&amp;#xB918;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0;, COM &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; DLL &amp;#xB610;&amp;#xB294; EXE&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC838; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xB354; &amp;#xB098;&amp;#xC544;&amp;#xAC00;&amp;#xBA74; DCOM&amp;#xACFC; &amp;#xC5F0;&amp;#xAD00;&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;del&gt;(&amp;#xC0AC;&amp;#xC2E4; part1&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xB9D0;&amp;#xC500; &amp;#xB4DC;&amp;#xB9AC;&amp;#xB824; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC9C0;&amp;#xAE08; &amp;#xD55C; &amp;#xAC74; &amp;#xC548; &amp;#xBE44;&amp;#xBC00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;)&lt;/del&gt;&lt;/p&gt;
&lt;h1 id=&#34;COM-&amp;#xC11C;&amp;#xBC84;&amp;#xC758;-&amp;#xD65C;&amp;#xC131;&amp;#xD654;-&amp;#xC720;&amp;#xD615;&#34;&gt;&lt;a href=&#34;#COM-&amp;#xC11C;&amp;#xBC84;&amp;#xC758;-&amp;#xD65C;&amp;#xC131;&amp;#xD654;-&amp;#xC720;&amp;#xD615;&#34; class=&#34;headerlink&#34; title=&#34;COM &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC720;&amp;#xD615;&#34;&gt;&lt;/a&gt;COM &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC720;&amp;#xD615;&lt;/h1&gt;&lt;p&gt;&amp;#xAC01; COM &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB420; &amp;#xB54C; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xBA70;, &amp;#xD574;&amp;#xB2F9; &amp;#xC124;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xACB0;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC2EC;&amp;#xD638;&amp;#xD761; &amp;#xD55C; &amp;#xBC88; &amp;#xD558;&amp;#xACE0; &amp;#xB2E4;&amp;#xC74C; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;In-Process (InprocServer32)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;COM &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; DLL &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC5B4; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACF5;&amp;#xAC04;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xBA70; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;SCM&amp;#xC740; DLL&amp;#xC758; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xACE0;, &amp;#xD574;&amp;#xB2F9; DLL&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD55C; &amp;#xD6C4; Class Factory&amp;#xB97C; &amp;#xC694;&amp;#xCCAD;&amp;#xD574; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Out-of-Process / Local (LocalServer32)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;COM &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; EXE &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA70;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACF5;&amp;#xAC04;&amp;#xC744; &amp;#xAC00;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;SCM&amp;#xC740; EXE&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0;, EXE&amp;#xAC00; &amp;#xC790;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; Class Factory&amp;#xB97C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; Class Factory&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC5EC; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Out-of-Process / Remote (&amp;#xC6D0;&amp;#xACA9; COM, DCOM)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC6D0;&amp;#xACA9;&amp;#xC740; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; COM, DCOM(Distributed COM)&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xB85C;, &amp;#xC6D0;&amp;#xACA9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB85C;&amp;#xCEEC; SCM&amp;#xC740; &amp;#xC6D0;&amp;#xACA9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC758; SCM&amp;#xC5D0;&amp;#xC11C; Class Factory &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC640; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xC21C;&amp;#xC11C;&amp;#xC640; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xCC9C;&amp;#xCC9C;&amp;#xD788; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xB420; &amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..!&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC7A0;&amp;#xAE50;! &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xBB38;&amp;#xC81C;!&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;DCOM &amp;#xC11C;&amp;#xBC84; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; DLL&amp;#xC640; EXE &amp;#xC911; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/sphinx.jpg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB2F5;&amp;#xC740; &amp;#xC0C1;&amp;#xAD00;&amp;#xC5C6;&amp;#xB2E4;! &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC6D0;&amp;#xACA9;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xBA74; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xB2E4;&amp;#xB978; &amp;#xC8FC;&amp;#xC18C; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; EXE &amp;#xD30C;&amp;#xC77C;&amp;#xB9CC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;del&gt;(&amp;#xC0AC;&amp;#xC2E4; &amp;#xC81C;&amp;#xAC00; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;)&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, DLL Surrogate&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; DLL&amp;#xB85C; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xAD6C;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;DLL&amp;#xC740; &amp;#xC218;&amp;#xB3D9;&amp;#xC801;&amp;#xC778; &amp;#xBAA8;&amp;#xB4C8;&amp;#xB85C;, &amp;#xC790;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; Surrogate &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Surrogate &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; EXE&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74;, dllhost.exe&amp;#xAC00; Windows&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; DLL Surrogate &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; dllhost.exe&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; COM &amp;#xC11C;&amp;#xBC84; &amp;#xB610;&amp;#xD55C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;h1 id=&#34;Out-of-Process-&amp;#xC2E4;&amp;#xC2B5;-MMC-exe&#34;&gt;&lt;a href=&#34;#Out-of-Process-&amp;#xC2E4;&amp;#xC2B5;-MMC-exe&#34; class=&#34;headerlink&#34; title=&#34;Out-of-Process &amp;#xC2E4;&amp;#xC2B5;(MMC.exe)&#34;&gt;&lt;/a&gt;Out-of-Process &amp;#xC2E4;&amp;#xC2B5;(MMC.exe)&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC774;&amp;#xB860;&amp;#xC740; &amp;#xC7A0;&amp;#xC2DC; &amp;#xB4A4;&amp;#xB85C;&amp;#xD558;&amp;#xACE0;, &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xC81C; &amp;#xB3D9;&amp;#xC791; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; CLSID&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC5EC; COM &amp;#xC11C;&amp;#xBC84; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC720;&amp;#xD615;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xACE0;, &amp;#xC2E4;&amp;#xC81C; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xB4A4; ProcessHacker&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC5B4;&amp;#xB514;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs latex&#34;&gt;Get-ChildItem -Path &amp;quot;Registry::HKEY_LOCAL_MACHINE&lt;span class=&#34;hljs-tag&#34;&gt;\&lt;span class=&#34;hljs-name&#34;&gt;SOFTWARE&lt;/span&gt;&lt;/span&gt;&lt;span class=&#34;hljs-tag&#34;&gt;\&lt;span class=&#34;hljs-name&#34;&gt;Classes&lt;/span&gt;&lt;/span&gt;&lt;span class=&#34;hljs-tag&#34;&gt;\&lt;span class=&#34;hljs-name&#34;&gt;CLSID&lt;/span&gt;&lt;/span&gt;&lt;span class=&#34;hljs-tag&#34;&gt;\&lt;span class=&#34;hljs-name&#34;&gt;{&lt;/span&gt;&lt;/span&gt;49B2791A-B1AE-4C90-9B8E-E860BA07F889}&amp;quot;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; CLSID&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; COM &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC720;&amp;#xD615;&amp;#xC73C;&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA85;&amp;#xB839; &amp;#xC2E4;&amp;#xD589; &amp;#xACB0;&amp;#xACFC; &lt;code&gt;LocalServer32&lt;/code&gt; &amp;#xD0A4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB294; Out-of-Process(EXE)&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD568;&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs elixir&#34;&gt;&lt;span class=&#34;hljs-variable&#34;&gt;$comobj&lt;/span&gt; = [System.Activator]::CreateInstance([Type]::GetTypeFromCLSID(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;49B2791A-B1AE-4C90-9B8E-E860BA07F889&amp;quot;&lt;/span&gt;))
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; CLSID&amp;#xC758; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131; &amp;#xD6C4; ProcessHacker&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Out-of-Process(LocalServer) COM &amp;#xB610;&amp;#xB294; DCOM&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC740; svchost.exe &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; RPCSS &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C;, MMC.exe &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC18D;&amp;#xC131;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74;, Parent Process&amp;#xB85C; &lt;code&gt;svchost.exe&lt;/code&gt;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC2B5;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xC8E0;..? &amp;#xC0AC;&amp;#xC2E4; &amp;#xB208;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB294; &amp;#xAC8C; &amp;#xAC00;&amp;#xC7A5; &amp;#xC88B;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574; &amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xB4E4;&amp;#xB3C4; &amp;#xB530;&amp;#xB77C; &amp;#xD574;&amp;#xBCF4;&amp;#xC138;&amp;#xC6A9;!&lt;/p&gt;
&lt;h1 id=&#34;DCOM-&amp;#xAC1C;&amp;#xB150;&#34;&gt;&lt;a href=&#34;#DCOM-&amp;#xAC1C;&amp;#xB150;&#34; class=&#34;headerlink&#34; title=&#34;DCOM &amp;#xAC1C;&amp;#xB150;&#34;&gt;&lt;/a&gt;DCOM &amp;#xAC1C;&amp;#xB150;&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xB4DC;&amp;#xB514;&amp;#xC5B4; DCOM &amp;#xAC1C;&amp;#xB150;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! COM &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xC21C;&amp;#xC11C;, &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC720;&amp;#xD615;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xB2C8; &amp;#xAC00;&amp;#xBCCD;&amp;#xAC8C; &amp;#xC77D;&amp;#xC73C;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;DCOM&amp;#xC758; &amp;#xC8FC;&amp;#xC694; &amp;#xAE30;&amp;#xB2A5;&amp;#xC740; &amp;#xC6D0;&amp;#xACA9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC1D;&amp;#xCCB4; &amp;#xC790;&amp;#xCCB4;&amp;#xB294; &amp;#xC6D0;&amp;#xACA9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA70;, &amp;#xB85C;&amp;#xCEEC; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB294; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; DCOM&amp;#xC740; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;DCOM&amp;#xC740; &amp;#xC6D0;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Lateral Movement&amp;#xC5D0; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACFC;&amp;#xAC70;&amp;#xC5D0;&amp;#xB294; PowerShell Remoting&amp;#xC744; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC774; &amp;#xD65C;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;ShellWindows&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;ShellBrowserWindows&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;MMC20.Application&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Excel.Application&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;DDEInitiate&lt;/li&gt;
&lt;li&gt;RegisterXLL&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Outlook.Application&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;CreateObject-&amp;gt;Shell.Application&lt;/li&gt;
&lt;li&gt;CreateObject-&amp;gt;ScriptControl (office-32bit only)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Visio.InvisibleApp&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;Addons&lt;/li&gt;
&lt;li&gt;ExecuteLine&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Word.Application&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;RunAutoMacro&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;DCOM-&amp;#xAC1D;&amp;#xCCB4;&amp;#xC758;-&amp;#xC124;&amp;#xC815;-&amp;#xC870;&amp;#xAC74;&#34;&gt;&lt;a href=&#34;#DCOM-&amp;#xAC1D;&amp;#xCCB4;&amp;#xC758;-&amp;#xC124;&amp;#xC815;-&amp;#xC870;&amp;#xAC74;&#34; class=&#34;headerlink&#34; title=&#34;DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC124;&amp;#xC815; &amp;#xC870;&amp;#xAC74;&#34;&gt;&lt;/a&gt;DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC124;&amp;#xC815; &amp;#xC870;&amp;#xAC74;&lt;/h1&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; COM&amp;#xC5D0;&amp;#xB294; CLSID&amp;#xC640; ProgID &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; AppID&amp;#xB77C;&amp;#xB294; &amp;#xAC12;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows/win32/com/appid-key&#34;&gt;AppID&lt;/a&gt;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xC811;&amp;#xADFC; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xAC01;&amp;#xC885; &amp;#xAD6C;&amp;#xC131; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;,&lt;br&gt;&amp;#xD558;&amp;#xB098; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xD2B9;&amp;#xC815; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; AppID&amp;#xAC00; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC6D0;&amp;#xACA9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; DCOM&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB824;&amp;#xBA74; CLSID&amp;#xAC00; &amp;#xC801;&amp;#xC808;&amp;#xD55C; AppID&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xACE0;, AppID&amp;#xC5D0; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xACA9;&amp;#xC5D0;&amp;#xC11C; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB824;&amp;#xBA74;, AppID&amp;#xC5D0; &amp;#xB2E4;&amp;#xC74C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC815;&amp;#xC758;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;AccessPermissions&lt;/code&gt;: &amp;#xAC1D;&amp;#xCCB4; &amp;#xC811;&amp;#xADFC; &amp;#xAD8C;&amp;#xD55C;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;LaunchPermissions&lt;/code&gt;: &amp;#xAC1D;&amp;#xCCB4; &amp;#xC2E4;&amp;#xD589; &amp;#xAD8C;&amp;#xD55C;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC740; &amp;#xD2B9;&amp;#xC815; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xAC83;&amp;#xC774;&amp;#xACE0; Global Permissions&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC804;&amp;#xCCB4; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCD94;&amp;#xAC00;&amp;#xB85C; DCOM&amp;#xC740; DCE-RPC(Distributed Computing Environment Remote Procedure Call) &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA70;, &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; 135&amp;#xBC88; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C;, DCOM&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xD3EC;&amp;#xD2B8; &amp;#xD655;&amp;#xC778;, Global Permissions, COM AppID&amp;#x2026; &amp;#xC21C;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xD2B9;&amp;#xC815;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C;-&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C;-COM-&amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#&amp;#xD2B9;&amp;#xC815;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C;-&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C;-COM-&amp;#xCC3E;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;/a&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xCC3E;&amp;#xAE30;&lt;/h1&gt;&lt;p&gt;DCOM &amp;#xAC1C;&amp;#xB150;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;(Excel, Outlook &amp;#x2026;)&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C; &amp;#xC774;&amp;#xB7F0; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;~ Lateral Movement &amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC138;&amp;#xC694;~ &amp;#xB294; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xC544;&amp;#xB2C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xC74C; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;del&gt;(7KCA64qUIE1jQWZlZSBTY2Fu66W8IO2DgOqyn+ycvOuhnCDtlojsirXri4jri6Qu)&lt;/del&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC124;&amp;#xCE58;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4;&lt;/li&gt;
&lt;li&gt;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; Out-of-Process &amp;#xAC1D;&amp;#xCCB4;&lt;/li&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xCC28;&amp;#xB840;&amp;#xB300;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs pgsql&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;Set&lt;/span&gt;-ComDatabase -&lt;span class=&#34;hljs-type&#34;&gt;Path&lt;/span&gt; ComDb_old.db -&lt;span class=&#34;hljs-keyword&#34;&gt;Database&lt;/span&gt; (&lt;span class=&#34;hljs-keyword&#34;&gt;Get&lt;/span&gt;-ComDatabase -PassThru)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC124;&amp;#xCE58;&amp;#xD55C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xACE0; &amp;#xBA85;&amp;#xD655;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC124;&amp;#xCE58; &amp;#xC804;&amp;#xACFC; &amp;#xD6C4;&amp;#xC758; &amp;#xC2A4;&amp;#xB0C5;&amp;#xC0F7;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;ComDb_old.db&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xBC31;&amp;#xC5C5; &amp;#xD6C4; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC124;&amp;#xCE58;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs mathematica&#34;&gt;$comDiff = Compare-ComDatabase `
    -&lt;span class=&#34;hljs-keyword&#34;&gt;Left&lt;/span&gt; (&lt;span class=&#34;hljs-keyword&#34;&gt;Get&lt;/span&gt;-ComDatabase -&lt;span class=&#34;hljs-keyword&#34;&gt;Path&lt;/span&gt; ComDb_old.db -PassThru) `
    -&lt;span class=&#34;hljs-keyword&#34;&gt;Right&lt;/span&gt; (&lt;span class=&#34;hljs-keyword&#34;&gt;Get&lt;/span&gt;-ComDatabase -PassThru) `
    -DiffMode RightOnly
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC124;&amp;#xCE58;&amp;#xAC00; &amp;#xC644;&amp;#xB8CC;&amp;#xB418;&amp;#xBA74; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xC804; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC9D1;&amp;#xD55C; &amp;#xC2A4;&amp;#xB0C5;&amp;#xC0F7;&amp;#xACFC; &amp;#xBE44;&amp;#xAD50;&amp;#xD574; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xACB0;&amp;#xACFC; &lt;code&gt;$comDiff&lt;/code&gt; &amp;#xBCC0;&amp;#xC218;&amp;#xC5D0;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs powershell&#34;&gt;&lt;span class=&#34;hljs-variable&#34;&gt;$explorerId&lt;/span&gt; = (&lt;span class=&#34;hljs-built_in&#34;&gt;Get-Process&lt;/span&gt; &lt;span class=&#34;hljs-literal&#34;&gt;-Name&lt;/span&gt; explorer).Id

&lt;span class=&#34;hljs-variable&#34;&gt;$comsAsSystem&lt;/span&gt; = &lt;span class=&#34;hljs-variable&#34;&gt;$comDiff&lt;/span&gt;.AppIDs.Values |
    &lt;span class=&#34;hljs-built_in&#34;&gt;Where-Object&lt;/span&gt; {
        &lt;span class=&#34;hljs-variable&#34;&gt;$_&lt;/span&gt;.IsService &lt;span class=&#34;hljs-operator&#34;&gt;-eq&lt;/span&gt; &lt;span class=&#34;hljs-variable&#34;&gt;$true&lt;/span&gt; &lt;span class=&#34;hljs-operator&#34;&gt;-or&lt;/span&gt;
        &lt;span class=&#34;hljs-variable&#34;&gt;$_&lt;/span&gt;.RunAs &lt;span class=&#34;hljs-operator&#34;&gt;-ieq&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;nt authority\system&amp;quot;&lt;/span&gt;
    }
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Explorer &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; ID&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xACE0;, &lt;code&gt;$comDiff&lt;/code&gt;&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC911; NT Authority\SYSTEM &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAC70;&amp;#xB098; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB9CC; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs routeros&#34;&gt;&lt;span class=&#34;hljs-variable&#34;&gt;$comsAsSystem&lt;/span&gt; |
Select-ComAccess -ProcessId &lt;span class=&#34;hljs-variable&#34;&gt;$explorerId&lt;/span&gt; -Principal S-1-5-18

Name                           AppID                                IsService  HasPermission
----                           -----                                ---------  -------------
PerceptionSimulation           1b162a5b-b67a-4468-9613-c3f9765b353b &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;       &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;
42CBFAA7-A4A7-47BB-B422-BD1&lt;span class=&#34;hljs-built_in&#34;&gt;..&lt;/span&gt;. 42cbfaa7-a4a7-47bb-b422-bd10e9d02700 &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;       &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;
Trusted Installer&lt;span class=&#34;hljs-built_in&#34;&gt; Service &lt;/span&gt;     752073a2-23f2-4396-85f0-8fdb879ed0ed &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;       &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;
Spectrum                       c0e1ce99-c981-44a2-ac4c-41036fac6593 &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;       &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Explorer &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;(&lt;code&gt;$explorerId&lt;/code&gt;)&amp;#xAC00; SYSTEM &amp;#xAD8C;&amp;#xD55C;(&lt;code&gt;S-1-5-18&lt;/code&gt;)&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74;, System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB9D0;&amp;#xC740; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xB9CC;&amp;#xB4E0; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &lt;code&gt;$explorerId&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC811;&amp;#xADFC;(Launch &amp;#xBC0F; Access) &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;! &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; Access&amp;#xB294; Launch &amp;#xBC0F; Access &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; &amp;#xC758;&amp;#xBBF8;&amp;#xB85C; &amp;#xB9CC;&amp;#xC57D;, Launch &amp;#xAD8C;&amp;#xD55C;&amp;#xB9CC; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;(Access=0&amp;#xC778; &amp;#xACBD;&amp;#xC6B0; &amp;#xB4F1;) &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xB098;&amp;#xC62C; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs angelscript&#34;&gt;$comsAsSystem |
Select-ComAccess `
         -ProcessId $explorerId `
         -Principal S&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-5&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-18&lt;/span&gt; `
         -LaunchAccess ActivateLocal, ExecuteLocal `
         -Access &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;

Name                           AppID                                IsService  HasPermission
----                           -----                                ---------  -------------
&lt;span class=&#34;hljs-number&#34;&gt;000&lt;/span&gt;C101C&lt;span class=&#34;hljs-number&#34;&gt;-0000&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-0000&lt;/span&gt;-C000&lt;span class=&#34;hljs-number&#34;&gt;-000.&lt;/span&gt;.. &lt;span class=&#34;hljs-number&#34;&gt;000&lt;/span&gt;c101c&lt;span class=&#34;hljs-number&#34;&gt;-0000&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-0000&lt;/span&gt;-c000&lt;span class=&#34;hljs-number&#34;&gt;-000000000046&lt;/span&gt; True       False
PerceptionSimulation           &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;b162a5b-b67a&lt;span class=&#34;hljs-number&#34;&gt;-4468&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-9613&lt;/span&gt;-c3f9765b353b True       True
&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;FCBE96C&lt;span class=&#34;hljs-number&#34;&gt;-1697&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-43&lt;/span&gt;AF&lt;span class=&#34;hljs-number&#34;&gt;-9140&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-289.&lt;/span&gt;.. &lt;span class=&#34;hljs-number&#34;&gt;1f&lt;/span&gt;cbe96c&lt;span class=&#34;hljs-number&#34;&gt;-1697&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-43&lt;/span&gt;af&lt;span class=&#34;hljs-number&#34;&gt;-9140&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-2897&lt;/span&gt;c7c69767 True       False
&lt;span class=&#34;hljs-number&#34;&gt;2781761E-28&lt;/span&gt;E2&lt;span class=&#34;hljs-number&#34;&gt;-4109&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-99&lt;/span&gt;FE-B9D... &lt;span class=&#34;hljs-number&#34;&gt;2781761e-28&lt;/span&gt;e2&lt;span class=&#34;hljs-number&#34;&gt;-4109&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-99f&lt;/span&gt;e-b9d127c57afe True       False
Windows Security Health Ser... &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;eb6d15c&lt;span class=&#34;hljs-number&#34;&gt;-5239&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-41&lt;/span&gt;cf&lt;span class=&#34;hljs-number&#34;&gt;-82f&lt;/span&gt;b&lt;span class=&#34;hljs-number&#34;&gt;-353&lt;/span&gt;d20b816cf True       True
&lt;span class=&#34;hljs-number&#34;&gt;42&lt;/span&gt;CBFAA7-A4A7&lt;span class=&#34;hljs-number&#34;&gt;-47&lt;/span&gt;BB-B422-BD1... &lt;span class=&#34;hljs-number&#34;&gt;42&lt;/span&gt;cbfaa7-a4a7&lt;span class=&#34;hljs-number&#34;&gt;-47&lt;/span&gt;bb-b422-bd10e9d02700 True       True
&lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;A0F9AA8-A71E&lt;span class=&#34;hljs-number&#34;&gt;-4&lt;/span&gt;CC3&lt;span class=&#34;hljs-number&#34;&gt;-891&lt;/span&gt;B&lt;span class=&#34;hljs-number&#34;&gt;-76&lt;/span&gt;C... &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;a0f9aa8-a71e&lt;span class=&#34;hljs-number&#34;&gt;-4&lt;/span&gt;cc3&lt;span class=&#34;hljs-number&#34;&gt;-891&lt;/span&gt;b&lt;span class=&#34;hljs-number&#34;&gt;-76&lt;/span&gt;cac67e67c0 True       False
&lt;span class=&#34;hljs-number&#34;&gt;521&lt;/span&gt;FDB42&lt;span class=&#34;hljs-number&#34;&gt;-7130&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-4806&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-822&lt;/span&gt;A-FC5... &lt;span class=&#34;hljs-number&#34;&gt;521f&lt;/span&gt;db42&lt;span class=&#34;hljs-number&#34;&gt;-7130&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-4806&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-822&lt;/span&gt;a-fc5163fad983 True       False
&lt;span class=&#34;hljs-number&#34;&gt;534&lt;/span&gt;F5323&lt;span class=&#34;hljs-number&#34;&gt;-3569&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-4&lt;/span&gt;F42&lt;span class=&#34;hljs-number&#34;&gt;-919&lt;/span&gt;D&lt;span class=&#34;hljs-number&#34;&gt;-1E1&lt;/span&gt;... &lt;span class=&#34;hljs-number&#34;&gt;534f&lt;/span&gt;5323&lt;span class=&#34;hljs-number&#34;&gt;-3569&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-4f&lt;/span&gt;42&lt;span class=&#34;hljs-number&#34;&gt;-919&lt;/span&gt;d&lt;span class=&#34;hljs-number&#34;&gt;-1e1&lt;/span&gt;cf93e5bf6 True       False
&lt;span class=&#34;hljs-number&#34;&gt;53&lt;/span&gt;A53FE9&lt;span class=&#34;hljs-number&#34;&gt;-0&lt;/span&gt;D1A&lt;span class=&#34;hljs-number&#34;&gt;-5&lt;/span&gt;CE1-A982&lt;span class=&#34;hljs-number&#34;&gt;-92&lt;/span&gt;E... &lt;span class=&#34;hljs-number&#34;&gt;53&lt;/span&gt;a53fe9&lt;span class=&#34;hljs-number&#34;&gt;-0&lt;/span&gt;d1a&lt;span class=&#34;hljs-number&#34;&gt;-5&lt;/span&gt;ce1-a982&lt;span class=&#34;hljs-number&#34;&gt;-92&lt;/span&gt;eca1cb48bc True       False
&lt;span class=&#34;hljs-number&#34;&gt;63&lt;/span&gt;A53A38&lt;span class=&#34;hljs-number&#34;&gt;-004&lt;/span&gt;F&lt;span class=&#34;hljs-number&#34;&gt;-489&lt;/span&gt;B-BD61&lt;span class=&#34;hljs-number&#34;&gt;-96&lt;/span&gt;B... &lt;span class=&#34;hljs-number&#34;&gt;63&lt;/span&gt;a53a38&lt;span class=&#34;hljs-number&#34;&gt;-004f&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-489&lt;/span&gt;b-bd61&lt;span class=&#34;hljs-number&#34;&gt;-96&lt;/span&gt;b5eefadc04 True       False
TieringEngineService           &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;df5bcf4&lt;span class=&#34;hljs-number&#34;&gt;-22e9&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-446&lt;/span&gt;d&lt;span class=&#34;hljs-number&#34;&gt;-8763&lt;/span&gt;-a2c7677ecf7d True       True
&lt;span class=&#34;hljs-number&#34;&gt;708860E0&lt;/span&gt;-F641&lt;span class=&#34;hljs-number&#34;&gt;-4611&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-8895&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-7&lt;/span&gt;D8... &lt;span class=&#34;hljs-number&#34;&gt;708860e0&lt;/span&gt;-f641&lt;span class=&#34;hljs-number&#34;&gt;-4611&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-8895&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-7&lt;/span&gt;d867dd3675b True       False
McComponentHostService         &lt;span class=&#34;hljs-number&#34;&gt;727&lt;/span&gt;b5bd4-fae7&lt;span class=&#34;hljs-number&#34;&gt;-4&lt;/span&gt;ea7&lt;span class=&#34;hljs-number&#34;&gt;-98&lt;/span&gt;bd&lt;span class=&#34;hljs-number&#34;&gt;-20&lt;/span&gt;ac6bc25d89 True       False
Trusted Installer Service      &lt;span class=&#34;hljs-number&#34;&gt;752073&lt;/span&gt;a2&lt;span class=&#34;hljs-number&#34;&gt;-23f&lt;/span&gt;2&lt;span class=&#34;hljs-number&#34;&gt;-4396&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-85f&lt;/span&gt;0&lt;span class=&#34;hljs-number&#34;&gt;-8f&lt;/span&gt;db879ed0ed True       True
&lt;span class=&#34;hljs-number&#34;&gt;8018&lt;/span&gt;F647-BF07&lt;span class=&#34;hljs-number&#34;&gt;-55&lt;/span&gt;BB&lt;span class=&#34;hljs-number&#34;&gt;-82&lt;/span&gt;BE-A2D... &lt;span class=&#34;hljs-number&#34;&gt;8018f&lt;/span&gt;647-bf07&lt;span class=&#34;hljs-number&#34;&gt;-55&lt;/span&gt;bb&lt;span class=&#34;hljs-number&#34;&gt;-82&lt;/span&gt;be-a2d7049f7ce4 True       False
&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;A1D4361&lt;span class=&#34;hljs-number&#34;&gt;-2&lt;/span&gt;C08&lt;span class=&#34;hljs-number&#34;&gt;-4700&lt;/span&gt;-A351&lt;span class=&#34;hljs-number&#34;&gt;-3&lt;/span&gt;EA... &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;a1d4361&lt;span class=&#34;hljs-number&#34;&gt;-2&lt;/span&gt;c08&lt;span class=&#34;hljs-number&#34;&gt;-4700&lt;/span&gt;-a351&lt;span class=&#34;hljs-number&#34;&gt;-3&lt;/span&gt;eaa9cbff5e4 True       False
&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;A2F4279&lt;span class=&#34;hljs-number&#34;&gt;-5&lt;/span&gt;AFC&lt;span class=&#34;hljs-number&#34;&gt;-549&lt;/span&gt;D-B352-F32... &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;a2f4279&lt;span class=&#34;hljs-number&#34;&gt;-5&lt;/span&gt;afc&lt;span class=&#34;hljs-number&#34;&gt;-549&lt;/span&gt;d-b352-f32e6dbac9df True       False
WSearch                        &lt;span class=&#34;hljs-number&#34;&gt;9e175&lt;/span&gt;b9c-f52a&lt;span class=&#34;hljs-number&#34;&gt;-11&lt;/span&gt;d8-b9a5&lt;span class=&#34;hljs-number&#34;&gt;-505054503030&lt;/span&gt; True       True
ServiceModule                  a6b716cb&lt;span class=&#34;hljs-number&#34;&gt;-028&lt;/span&gt;b&lt;span class=&#34;hljs-number&#34;&gt;-404&lt;/span&gt;d-b72c&lt;span class=&#34;hljs-number&#34;&gt;-50e153&lt;/span&gt;dd68da True       False
ABC01078-F197&lt;span class=&#34;hljs-number&#34;&gt;-4&lt;/span&gt;B0B-ADBC-CFE... abc01078-f197&lt;span class=&#34;hljs-number&#34;&gt;-4&lt;/span&gt;b0b-adbc-cfe684b39c82 True       False
Spectrum                       c0e1ce99-c981&lt;span class=&#34;hljs-number&#34;&gt;-44&lt;/span&gt;a2-ac4c&lt;span class=&#34;hljs-number&#34;&gt;-41036f&lt;/span&gt;ac6593 True       True
ServiceModule                  cecddd22&lt;span class=&#34;hljs-number&#34;&gt;-2e72&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-4832&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-9606&lt;/span&gt;-a9b0e5e344b2 True       False
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Launch &amp;#xAD8C;&amp;#xD55C;&amp;#xB9CC; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;, &amp;#xC774;&amp;#xC804;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xBAA9;&amp;#xB85D;&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xBA70;, &amp;#xADF8;&amp;#xC911;&amp;#xC5D0;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4;&amp;#xB85C;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xC740; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC65C;? &amp;#xC0AC;&amp;#xC6A9;&amp;#xC740; &amp;#xBABB; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xB3D9;&amp;#xC801;&amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xB9C9;&amp;#xC0C1; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xBA74;, HasPermission&amp;#xC774; True&amp;#xAC00; &amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; Part1&amp;#xC744; &amp;#xD1B5;&amp;#xD574;, COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC228;&amp;#xACA8;&amp;#xC9C4; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC7AC;&amp;#xADC0;&amp;#xC801; &amp;#xD0D0;&amp;#xC0C9;&amp;#xC73C;&amp;#xB85C; &amp;#xAC1D;&amp;#xCCB4; &amp;#xC548;&amp;#xC758; &amp;#xC228;&amp;#xACA8;&amp;#xC9C4; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; COM &amp;#xCC98;&amp;#xB9AC; &amp;#xC21C;&amp;#xC11C;, &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC720;&amp;#xD615;, DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xB418;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC870;&amp;#xAC74;&amp;#xACFC; &amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;DCOM&amp;#xBCF4;&amp;#xB2E4; COM &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB9CE;&amp;#xC9C0;&amp;#xB9CC;, DCOM&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xC9DA;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xC57C; &amp;#xD560; &amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xACE0; DCOM &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xD1B5;&amp;#xC2E0; &amp;#xACFC;&amp;#xC815;(marshaling, proxy, stub)&amp;#xC744; &amp;#xC81C;&amp;#xC678;&amp;#xD558;&amp;#xBA74; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; Part 1&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB358; &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC73C;&amp;#xB2C8;, Part 3&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC640; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xB4E4;&amp;#xACE0; &amp;#xC624;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xAE34; &amp;#xAE00; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2F9; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/truman.gif&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h1&gt;&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://klezvirus.github.io/RedTeaming/LateralMovement/LateralMovementDCOM/&#34;&gt;https://klezvirus.github.io/RedTeaming/LateralMovement/LateralMovementDCOM/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.221bluestreet.com/offensive-security/windows-components-object-model/demystifying-windows-component-object-model-com&#34;&gt;https://www.221bluestreet.com/offensive-security/windows-components-object-model/demystifying-windows-component-object-model-com&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://the-deniss.github.io/posts/2021/05/17/discovering-and-exploiting-mcafee-com-objects.html&#34;&gt;https://the-deniss.github.io/posts/2021/05/17/discovering-and-exploiting-mcafee-com-objects.html&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://posts.specterops.io/lateral-movement-abuse-the-power-of-dcom-excel-application-3c016d0d9922&#34;&gt;https://posts.specterops.io/lateral-movement-abuse-the-power-of-dcom-excel-application-3c016d0d9922&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] COM Object - Part 2 (DCOM)(KR) - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! ogu123&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/p&gt;
&lt;p&gt;Part1&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; COM&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBCBD;&amp;#xC744; &amp;#xB290;&amp;#xAEF4;..? &amp;#xB2E4;&amp;#xB978; &amp;#xBD84;&amp;#xC57C;&amp;#xB85C; &amp;#xB3C4;&amp;#xB9DD;&amp;#xAC00;&amp;#xB824;&amp;#xB2E4; COM&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C;&amp;#xC9C0;?&amp;#xB77C;&amp;#xB294; &amp;#xB9D0;&amp;#xC5D0; &amp;#xC194;&amp;#xAE43;&amp;#xD574; Part2&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. &amp;#xD558;&amp;#xD558;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C;! Part2&amp;#xB294; Red Team&amp;#xC774;&amp;#xB098; &amp;#xB0B4;&amp;#xBD80; &amp;#xCE68;&amp;#xD22C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC911; Lateral Movement&amp;#xC5D0; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; DCOM&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC798;&amp;#xBABB;&amp;#xB41C; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; RCE, LPE &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C4;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB2C8; &amp;#xC2E0;&amp;#xB098;&amp;#xAC8C; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB7EC; &amp;#xAC00;&amp;#xBCF4;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&lt;del&gt;(&amp;#xC8FC;&amp;#xC758; : Part2&amp;#xB294; &amp;#xC2E4;&amp;#xC2B5;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC774;&amp;#xB860;&amp;#xC774; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/Part2.jpg&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;DCOM&#34;&gt;&lt;a href=&#34;#DCOM&#34; class=&#34;headerlink&#34; title=&#34;DCOM&#34;&gt;&lt;/a&gt;DCOM&lt;/h1&gt;&lt;p&gt;COM&amp;#xACFC; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; DCOM(Distributed Component Object Model) &amp;#xB610;&amp;#xD55C; &lt;a href=&#34;https://learn.microsoft.com/ko-kr/openspecs/windows_protocols/ms-dcom/86b9cf84-df2e-4f0b-ac22-1b957627e1ca&#34;&gt;Microsoft &amp;#xAE30;&amp;#xC220;&lt;/a&gt;&amp;#xB85C; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;DCOM(&amp;#xBD84;&amp;#xC0B0; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8; &amp;#xAC1D;&amp;#xCCB4; &amp;#xBAA8;&amp;#xB378;) &amp;#xC6D0;&amp;#xACA9; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC740; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131; &amp;#xBC0F; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xAC1D;&amp;#xCCB4; &amp;#xCC38;&amp;#xC870;, &amp;#xAC1D;&amp;#xCCB4; &amp;#xC218;&amp;#xBA85; &amp;#xBC0F; &amp;#xAC1D;&amp;#xCCB4; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xCFFC;&amp;#xB9AC;&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; COM(&amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8; &amp;#xAC1D;&amp;#xCCB4; &amp;#xBAA8;&amp;#xB378;)&amp;#xC744; &amp;#xD655;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB124;&amp;#x2026; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB124;&amp;#xC694;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC27D;&amp;#xAC8C;! DCOM&amp;#xC740; COM&amp;#xC758; &amp;#xD655;&amp;#xC7A5;&amp;#xC73C;&amp;#xB85C;, &amp;#xC6D0;&amp;#xACA9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB9C8;&amp;#xCE58; &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xC6D0;&amp;#xACA9;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC624;&amp;#xBA74; &amp;#xC11C;&amp;#xBC84; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0;, &amp;#xC6D0;&amp;#xACA9; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; COM&amp;#xC758; &amp;#xD638;&amp;#xCD9C;&amp;#xACFC; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC720;&amp;#xD615;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC744; &amp;#xC9DA;&amp;#xACE0; DCOM&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;COM-&amp;#xAC1D;&amp;#xCCB4;-&amp;#xC694;&amp;#xCCAD;-&amp;#xCC98;&amp;#xB9AC;-&amp;#xC21C;&amp;#xC11C;&#34;&gt;&lt;a href=&#34;#COM-&amp;#xAC1D;&amp;#xCCB4;-&amp;#xC694;&amp;#xCCAD;-&amp;#xCC98;&amp;#xB9AC;-&amp;#xC21C;&amp;#xC11C;&#34; class=&#34;headerlink&#34; title=&#34;COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xC21C;&amp;#xC11C;&#34;&gt;&lt;/a&gt;COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xC21C;&amp;#xC11C;&lt;/h1&gt;&lt;p&gt;Windows&amp;#xC5D0;&amp;#xC11C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xBC0F; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xACFC;&amp;#xC815;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;del&gt;(tip : &amp;#xC544;&amp;#xB798; &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xBCF4;&amp;#xBA74; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xC3D9;&amp;#xC3D9; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/1.png&#34; alt&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xC694;&amp;#xCCAD;&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &lt;code&gt;CoCreateInstance&lt;/code&gt;, &lt;code&gt;CoGetClassObject&lt;/code&gt; &amp;#xB4F1;&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xB97C; CLSID &amp;#xB610;&amp;#xB294; ProgID&amp;#xB97C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xC694;&amp;#xCCAD;&amp;#xC740; COM &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;(ole32.dll)&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;SCM(Service Control Manager)&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;COM &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB294; SCM&amp;#xC5D0;&amp;#xAC8C; &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; CLSID &amp;#xB610;&amp;#xB294; ProgID&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; COM &amp;#xC11C;&amp;#xBC84;(DLL &amp;#xB610;&amp;#xB294; EXE)&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xB2EC;&amp;#xB77C;&amp;#xACE0; &amp;#xC694;&amp;#xCCAD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;SCM&amp;#xC740; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;(&lt;code&gt;HKCR\CLSID&lt;/code&gt; &amp;#xB610;&amp;#xB294; &lt;code&gt;HKCR\ProgID&lt;/code&gt;)&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC5EC;, &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; CLSID &amp;#xB610;&amp;#xB294; ProgID&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; COM &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;COM &amp;#xC11C;&amp;#xBC84; &amp;#xB85C;&amp;#xB4DC;&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;SCM&amp;#xC740; &amp;#xD655;&amp;#xC778;&amp;#xB41C; COM &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0;, &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; CLSID &amp;#xB610;&amp;#xB294; ProgID&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; Class Factory&amp;#xC758; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;Class Factory&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC0DD;&amp;#xC131; &amp;#xBC0F; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;Class Factory&amp;#xB294; &lt;code&gt;CreateInstance&lt;/code&gt; &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; CLSID &amp;#xB610;&amp;#xB294; ProgID&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC0DD;&amp;#xC131;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC694;&amp;#xCCAD;&amp;#xD55C; &amp;#xD2B9;&amp;#xC815; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xBC18;&amp;#xD658;&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;Class Factory&amp;#xAC00; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xBA74;, &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; COM &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC5D0; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;COM &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB294; &amp;#xC774; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC804;&amp;#xB2EC;&amp;#xBC1B;&amp;#xC740; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&amp;#xC640; &amp;#xC18D;&amp;#xC131;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/ogu.jpg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB124;&amp;#x2026; &amp;#xCC9C;&amp;#xCC9C;&amp;#xD788; &amp;#xC77D;&amp;#xB2E4; &amp;#xBCF4;&amp;#xBA74; &amp;#xD06C;&amp;#xAC8C; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBA40;&amp;#xB9AC;&amp;#xC11C; &amp;#xBCF4;&amp;#xBA74; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD574; &amp;#xBCF4;&amp;#xC774;&amp;#xB124;&amp;#xC694;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB9B0; &amp;#xC774;&amp;#xC720;&amp;#xB294; Part1&amp;#xC5D0;&amp;#xC11C; COM &amp;#xD638;&amp;#xCD9C; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC548; &amp;#xB2E4;&amp;#xB918;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0;, COM &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; DLL &amp;#xB610;&amp;#xB294; EXE&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC838; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xB354; &amp;#xB098;&amp;#xC544;&amp;#xAC00;&amp;#xBA74; DCOM&amp;#xACFC; &amp;#xC5F0;&amp;#xAD00;&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;del&gt;(&amp;#xC0AC;&amp;#xC2E4; part1&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xB9D0;&amp;#xC500; &amp;#xB4DC;&amp;#xB9AC;&amp;#xB824; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC9C0;&amp;#xAE08; &amp;#xD55C; &amp;#xAC74; &amp;#xC548; &amp;#xBE44;&amp;#xBC00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;)&lt;/del&gt;&lt;/p&gt;
&lt;h1 id=&#34;COM-&amp;#xC11C;&amp;#xBC84;&amp;#xC758;-&amp;#xD65C;&amp;#xC131;&amp;#xD654;-&amp;#xC720;&amp;#xD615;&#34;&gt;&lt;a href=&#34;#COM-&amp;#xC11C;&amp;#xBC84;&amp;#xC758;-&amp;#xD65C;&amp;#xC131;&amp;#xD654;-&amp;#xC720;&amp;#xD615;&#34; class=&#34;headerlink&#34; title=&#34;COM &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC720;&amp;#xD615;&#34;&gt;&lt;/a&gt;COM &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC720;&amp;#xD615;&lt;/h1&gt;&lt;p&gt;&amp;#xAC01; COM &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB420; &amp;#xB54C; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xBA70;, &amp;#xD574;&amp;#xB2F9; &amp;#xC124;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xACB0;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC2EC;&amp;#xD638;&amp;#xD761; &amp;#xD55C; &amp;#xBC88; &amp;#xD558;&amp;#xACE0; &amp;#xB2E4;&amp;#xC74C; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;In-Process (InprocServer32)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;COM &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; DLL &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC5B4; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACF5;&amp;#xAC04;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xBA70; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;SCM&amp;#xC740; DLL&amp;#xC758; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xACE0;, &amp;#xD574;&amp;#xB2F9; DLL&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD55C; &amp;#xD6C4; Class Factory&amp;#xB97C; &amp;#xC694;&amp;#xCCAD;&amp;#xD574; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Out-of-Process / Local (LocalServer32)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;COM &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; EXE &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA70;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACF5;&amp;#xAC04;&amp;#xC744; &amp;#xAC00;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;SCM&amp;#xC740; EXE&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0;, EXE&amp;#xAC00; &amp;#xC790;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; Class Factory&amp;#xB97C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; Class Factory&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC5EC; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Out-of-Process / Remote (&amp;#xC6D0;&amp;#xACA9; COM, DCOM)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC6D0;&amp;#xACA9;&amp;#xC740; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; COM, DCOM(Distributed COM)&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xB85C;, &amp;#xC6D0;&amp;#xACA9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB85C;&amp;#xCEEC; SCM&amp;#xC740; &amp;#xC6D0;&amp;#xACA9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC758; SCM&amp;#xC5D0;&amp;#xC11C; Class Factory &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC640; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xC21C;&amp;#xC11C;&amp;#xC640; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xCC9C;&amp;#xCC9C;&amp;#xD788; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xB420; &amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..!&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC7A0;&amp;#xAE50;! &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xBB38;&amp;#xC81C;!&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;DCOM &amp;#xC11C;&amp;#xBC84; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; DLL&amp;#xC640; EXE &amp;#xC911; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/sphinx.jpg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB2F5;&amp;#xC740; &amp;#xC0C1;&amp;#xAD00;&amp;#xC5C6;&amp;#xB2E4;! &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC6D0;&amp;#xACA9;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xBA74; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xB2E4;&amp;#xB978; &amp;#xC8FC;&amp;#xC18C; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; EXE &amp;#xD30C;&amp;#xC77C;&amp;#xB9CC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;del&gt;(&amp;#xC0AC;&amp;#xC2E4; &amp;#xC81C;&amp;#xAC00; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;)&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, DLL Surrogate&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; DLL&amp;#xB85C; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xAD6C;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;DLL&amp;#xC740; &amp;#xC218;&amp;#xB3D9;&amp;#xC801;&amp;#xC778; &amp;#xBAA8;&amp;#xB4C8;&amp;#xB85C;, &amp;#xC790;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; Surrogate &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Surrogate &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; EXE&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74;, dllhost.exe&amp;#xAC00; Windows&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; DLL Surrogate &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; dllhost.exe&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; COM &amp;#xC11C;&amp;#xBC84; &amp;#xB610;&amp;#xD55C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;h1 id=&#34;Out-of-Process-&amp;#xC2E4;&amp;#xC2B5;-MMC-exe&#34;&gt;&lt;a href=&#34;#Out-of-Process-&amp;#xC2E4;&amp;#xC2B5;-MMC-exe&#34; class=&#34;headerlink&#34; title=&#34;Out-of-Process &amp;#xC2E4;&amp;#xC2B5;(MMC.exe)&#34;&gt;&lt;/a&gt;Out-of-Process &amp;#xC2E4;&amp;#xC2B5;(MMC.exe)&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC774;&amp;#xB860;&amp;#xC740; &amp;#xC7A0;&amp;#xC2DC; &amp;#xB4A4;&amp;#xB85C;&amp;#xD558;&amp;#xACE0;, &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xC81C; &amp;#xB3D9;&amp;#xC791; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; CLSID&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC5EC; COM &amp;#xC11C;&amp;#xBC84; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC720;&amp;#xD615;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xACE0;, &amp;#xC2E4;&amp;#xC81C; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xB4A4; ProcessHacker&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC5B4;&amp;#xB514;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs latex&#34;&gt;Get-ChildItem -Path &amp;quot;Registry::HKEY_LOCAL_MACHINE&lt;span class=&#34;hljs-tag&#34;&gt;\&lt;span class=&#34;hljs-name&#34;&gt;SOFTWARE&lt;/span&gt;&lt;/span&gt;&lt;span class=&#34;hljs-tag&#34;&gt;\&lt;span class=&#34;hljs-name&#34;&gt;Classes&lt;/span&gt;&lt;/span&gt;&lt;span class=&#34;hljs-tag&#34;&gt;\&lt;span class=&#34;hljs-name&#34;&gt;CLSID&lt;/span&gt;&lt;/span&gt;&lt;span class=&#34;hljs-tag&#34;&gt;\&lt;span class=&#34;hljs-name&#34;&gt;{&lt;/span&gt;&lt;/span&gt;49B2791A-B1AE-4C90-9B8E-E860BA07F889}&amp;quot;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; CLSID&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; COM &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC720;&amp;#xD615;&amp;#xC73C;&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA85;&amp;#xB839; &amp;#xC2E4;&amp;#xD589; &amp;#xACB0;&amp;#xACFC; &lt;code&gt;LocalServer32&lt;/code&gt; &amp;#xD0A4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB294; Out-of-Process(EXE)&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD568;&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs elixir&#34;&gt;&lt;span class=&#34;hljs-variable&#34;&gt;$comobj&lt;/span&gt; = [System.Activator]::CreateInstance([Type]::GetTypeFromCLSID(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;49B2791A-B1AE-4C90-9B8E-E860BA07F889&amp;quot;&lt;/span&gt;))
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; CLSID&amp;#xC758; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131; &amp;#xD6C4; ProcessHacker&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Out-of-Process(LocalServer) COM &amp;#xB610;&amp;#xB294; DCOM&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC740; svchost.exe &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; RPCSS &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C;, MMC.exe &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC18D;&amp;#xC131;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74;, Parent Process&amp;#xB85C; &lt;code&gt;svchost.exe&lt;/code&gt;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC2B5;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xC8E0;..? &amp;#xC0AC;&amp;#xC2E4; &amp;#xB208;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB294; &amp;#xAC8C; &amp;#xAC00;&amp;#xC7A5; &amp;#xC88B;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574; &amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xB4E4;&amp;#xB3C4; &amp;#xB530;&amp;#xB77C; &amp;#xD574;&amp;#xBCF4;&amp;#xC138;&amp;#xC6A9;!&lt;/p&gt;
&lt;h1 id=&#34;DCOM-&amp;#xAC1C;&amp;#xB150;&#34;&gt;&lt;a href=&#34;#DCOM-&amp;#xAC1C;&amp;#xB150;&#34; class=&#34;headerlink&#34; title=&#34;DCOM &amp;#xAC1C;&amp;#xB150;&#34;&gt;&lt;/a&gt;DCOM &amp;#xAC1C;&amp;#xB150;&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xB4DC;&amp;#xB514;&amp;#xC5B4; DCOM &amp;#xAC1C;&amp;#xB150;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! COM &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xC21C;&amp;#xC11C;, &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC720;&amp;#xD615;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xB2C8; &amp;#xAC00;&amp;#xBCCD;&amp;#xAC8C; &amp;#xC77D;&amp;#xC73C;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;DCOM&amp;#xC758; &amp;#xC8FC;&amp;#xC694; &amp;#xAE30;&amp;#xB2A5;&amp;#xC740; &amp;#xC6D0;&amp;#xACA9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC1D;&amp;#xCCB4; &amp;#xC790;&amp;#xCCB4;&amp;#xB294; &amp;#xC6D0;&amp;#xACA9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA70;, &amp;#xB85C;&amp;#xCEEC; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB294; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; DCOM&amp;#xC740; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;DCOM&amp;#xC740; &amp;#xC6D0;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Lateral Movement&amp;#xC5D0; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACFC;&amp;#xAC70;&amp;#xC5D0;&amp;#xB294; PowerShell Remoting&amp;#xC744; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC774; &amp;#xD65C;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;ShellWindows&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;ShellBrowserWindows&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;MMC20.Application&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Excel.Application&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;DDEInitiate&lt;/li&gt;
&lt;li&gt;RegisterXLL&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Outlook.Application&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;CreateObject-&amp;gt;Shell.Application&lt;/li&gt;
&lt;li&gt;CreateObject-&amp;gt;ScriptControl (office-32bit only)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Visio.InvisibleApp&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;Addons&lt;/li&gt;
&lt;li&gt;ExecuteLine&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Word.Application&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;RunAutoMacro&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;DCOM-&amp;#xAC1D;&amp;#xCCB4;&amp;#xC758;-&amp;#xC124;&amp;#xC815;-&amp;#xC870;&amp;#xAC74;&#34;&gt;&lt;a href=&#34;#DCOM-&amp;#xAC1D;&amp;#xCCB4;&amp;#xC758;-&amp;#xC124;&amp;#xC815;-&amp;#xC870;&amp;#xAC74;&#34; class=&#34;headerlink&#34; title=&#34;DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC124;&amp;#xC815; &amp;#xC870;&amp;#xAC74;&#34;&gt;&lt;/a&gt;DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC124;&amp;#xC815; &amp;#xC870;&amp;#xAC74;&lt;/h1&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; COM&amp;#xC5D0;&amp;#xB294; CLSID&amp;#xC640; ProgID &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; AppID&amp;#xB77C;&amp;#xB294; &amp;#xAC12;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows/win32/com/appid-key&#34;&gt;AppID&lt;/a&gt;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xC811;&amp;#xADFC; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xAC01;&amp;#xC885; &amp;#xAD6C;&amp;#xC131; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;,&lt;br&gt;&amp;#xD558;&amp;#xB098; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xD2B9;&amp;#xC815; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; AppID&amp;#xAC00; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC6D0;&amp;#xACA9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; DCOM&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB824;&amp;#xBA74; CLSID&amp;#xAC00; &amp;#xC801;&amp;#xC808;&amp;#xD55C; AppID&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xACE0;, AppID&amp;#xC5D0; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xACA9;&amp;#xC5D0;&amp;#xC11C; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB824;&amp;#xBA74;, AppID&amp;#xC5D0; &amp;#xB2E4;&amp;#xC74C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC815;&amp;#xC758;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;AccessPermissions&lt;/code&gt;: &amp;#xAC1D;&amp;#xCCB4; &amp;#xC811;&amp;#xADFC; &amp;#xAD8C;&amp;#xD55C;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;LaunchPermissions&lt;/code&gt;: &amp;#xAC1D;&amp;#xCCB4; &amp;#xC2E4;&amp;#xD589; &amp;#xAD8C;&amp;#xD55C;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC740; &amp;#xD2B9;&amp;#xC815; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xAC83;&amp;#xC774;&amp;#xACE0; Global Permissions&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC804;&amp;#xCCB4; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCD94;&amp;#xAC00;&amp;#xB85C; DCOM&amp;#xC740; DCE-RPC(Distributed Computing Environment Remote Procedure Call) &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA70;, &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; 135&amp;#xBC88; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C;, DCOM&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xD3EC;&amp;#xD2B8; &amp;#xD655;&amp;#xC778;, Global Permissions, COM AppID&amp;#x2026; &amp;#xC21C;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xD2B9;&amp;#xC815;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C;-&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C;-COM-&amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#&amp;#xD2B9;&amp;#xC815;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C;-&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C;-COM-&amp;#xCC3E;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;/a&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xCC3E;&amp;#xAE30;&lt;/h1&gt;&lt;p&gt;DCOM &amp;#xAC1C;&amp;#xB150;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;(Excel, Outlook &amp;#x2026;)&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C; &amp;#xC774;&amp;#xB7F0; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;~ Lateral Movement &amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC138;&amp;#xC694;~ &amp;#xB294; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xC544;&amp;#xB2C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xC74C; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;del&gt;(7KCA64qUIE1jQWZlZSBTY2Fu66W8IO2DgOqyn+ycvOuhnCDtlojsirXri4jri6Qu)&lt;/del&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC124;&amp;#xCE58;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4;&lt;/li&gt;
&lt;li&gt;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; Out-of-Process &amp;#xAC1D;&amp;#xCCB4;&lt;/li&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xCC28;&amp;#xB840;&amp;#xB300;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs pgsql&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;Set&lt;/span&gt;-ComDatabase -&lt;span class=&#34;hljs-type&#34;&gt;Path&lt;/span&gt; ComDb_old.db -&lt;span class=&#34;hljs-keyword&#34;&gt;Database&lt;/span&gt; (&lt;span class=&#34;hljs-keyword&#34;&gt;Get&lt;/span&gt;-ComDatabase -PassThru)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC124;&amp;#xCE58;&amp;#xD55C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xACE0; &amp;#xBA85;&amp;#xD655;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC124;&amp;#xCE58; &amp;#xC804;&amp;#xACFC; &amp;#xD6C4;&amp;#xC758; &amp;#xC2A4;&amp;#xB0C5;&amp;#xC0F7;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;ComDb_old.db&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xBC31;&amp;#xC5C5; &amp;#xD6C4; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC124;&amp;#xCE58;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs mathematica&#34;&gt;$comDiff = Compare-ComDatabase `
    -&lt;span class=&#34;hljs-keyword&#34;&gt;Left&lt;/span&gt; (&lt;span class=&#34;hljs-keyword&#34;&gt;Get&lt;/span&gt;-ComDatabase -&lt;span class=&#34;hljs-keyword&#34;&gt;Path&lt;/span&gt; ComDb_old.db -PassThru) `
    -&lt;span class=&#34;hljs-keyword&#34;&gt;Right&lt;/span&gt; (&lt;span class=&#34;hljs-keyword&#34;&gt;Get&lt;/span&gt;-ComDatabase -PassThru) `
    -DiffMode RightOnly
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC124;&amp;#xCE58;&amp;#xAC00; &amp;#xC644;&amp;#xB8CC;&amp;#xB418;&amp;#xBA74; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xC804; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC9D1;&amp;#xD55C; &amp;#xC2A4;&amp;#xB0C5;&amp;#xC0F7;&amp;#xACFC; &amp;#xBE44;&amp;#xAD50;&amp;#xD574; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xACB0;&amp;#xACFC; &lt;code&gt;$comDiff&lt;/code&gt; &amp;#xBCC0;&amp;#xC218;&amp;#xC5D0;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs powershell&#34;&gt;&lt;span class=&#34;hljs-variable&#34;&gt;$explorerId&lt;/span&gt; = (&lt;span class=&#34;hljs-built_in&#34;&gt;Get-Process&lt;/span&gt; &lt;span class=&#34;hljs-literal&#34;&gt;-Name&lt;/span&gt; explorer).Id

&lt;span class=&#34;hljs-variable&#34;&gt;$comsAsSystem&lt;/span&gt; = &lt;span class=&#34;hljs-variable&#34;&gt;$comDiff&lt;/span&gt;.AppIDs.Values |
    &lt;span class=&#34;hljs-built_in&#34;&gt;Where-Object&lt;/span&gt; {
        &lt;span class=&#34;hljs-variable&#34;&gt;$_&lt;/span&gt;.IsService &lt;span class=&#34;hljs-operator&#34;&gt;-eq&lt;/span&gt; &lt;span class=&#34;hljs-variable&#34;&gt;$true&lt;/span&gt; &lt;span class=&#34;hljs-operator&#34;&gt;-or&lt;/span&gt;
        &lt;span class=&#34;hljs-variable&#34;&gt;$_&lt;/span&gt;.RunAs &lt;span class=&#34;hljs-operator&#34;&gt;-ieq&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;nt authority\system&amp;quot;&lt;/span&gt;
    }
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Explorer &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; ID&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xACE0;, &lt;code&gt;$comDiff&lt;/code&gt;&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xC911; NT Authority\SYSTEM &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAC70;&amp;#xB098; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB9CC; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs routeros&#34;&gt;&lt;span class=&#34;hljs-variable&#34;&gt;$comsAsSystem&lt;/span&gt; |
Select-ComAccess -ProcessId &lt;span class=&#34;hljs-variable&#34;&gt;$explorerId&lt;/span&gt; -Principal S-1-5-18

Name                           AppID                                IsService  HasPermission
----                           -----                                ---------  -------------
PerceptionSimulation           1b162a5b-b67a-4468-9613-c3f9765b353b &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;       &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;
42CBFAA7-A4A7-47BB-B422-BD1&lt;span class=&#34;hljs-built_in&#34;&gt;..&lt;/span&gt;. 42cbfaa7-a4a7-47bb-b422-bd10e9d02700 &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;       &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;
Trusted Installer&lt;span class=&#34;hljs-built_in&#34;&gt; Service &lt;/span&gt;     752073a2-23f2-4396-85f0-8fdb879ed0ed &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;       &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;
Spectrum                       c0e1ce99-c981-44a2-ac4c-41036fac6593 &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;       &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Explorer &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;(&lt;code&gt;$explorerId&lt;/code&gt;)&amp;#xAC00; SYSTEM &amp;#xAD8C;&amp;#xD55C;(&lt;code&gt;S-1-5-18&lt;/code&gt;)&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74;, System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB9D0;&amp;#xC740; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xB9CC;&amp;#xB4E0; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &lt;code&gt;$explorerId&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC811;&amp;#xADFC;(Launch &amp;#xBC0F; Access) &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;! &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; Access&amp;#xB294; Launch &amp;#xBC0F; Access &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; &amp;#xC758;&amp;#xBBF8;&amp;#xB85C; &amp;#xB9CC;&amp;#xC57D;, Launch &amp;#xAD8C;&amp;#xD55C;&amp;#xB9CC; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;(Access=0&amp;#xC778; &amp;#xACBD;&amp;#xC6B0; &amp;#xB4F1;) &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xB098;&amp;#xC62C; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs angelscript&#34;&gt;$comsAsSystem |
Select-ComAccess `
         -ProcessId $explorerId `
         -Principal S&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-5&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-18&lt;/span&gt; `
         -LaunchAccess ActivateLocal, ExecuteLocal `
         -Access &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;

Name                           AppID                                IsService  HasPermission
----                           -----                                ---------  -------------
&lt;span class=&#34;hljs-number&#34;&gt;000&lt;/span&gt;C101C&lt;span class=&#34;hljs-number&#34;&gt;-0000&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-0000&lt;/span&gt;-C000&lt;span class=&#34;hljs-number&#34;&gt;-000.&lt;/span&gt;.. &lt;span class=&#34;hljs-number&#34;&gt;000&lt;/span&gt;c101c&lt;span class=&#34;hljs-number&#34;&gt;-0000&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-0000&lt;/span&gt;-c000&lt;span class=&#34;hljs-number&#34;&gt;-000000000046&lt;/span&gt; True       False
PerceptionSimulation           &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;b162a5b-b67a&lt;span class=&#34;hljs-number&#34;&gt;-4468&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-9613&lt;/span&gt;-c3f9765b353b True       True
&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;FCBE96C&lt;span class=&#34;hljs-number&#34;&gt;-1697&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-43&lt;/span&gt;AF&lt;span class=&#34;hljs-number&#34;&gt;-9140&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-289.&lt;/span&gt;.. &lt;span class=&#34;hljs-number&#34;&gt;1f&lt;/span&gt;cbe96c&lt;span class=&#34;hljs-number&#34;&gt;-1697&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-43&lt;/span&gt;af&lt;span class=&#34;hljs-number&#34;&gt;-9140&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-2897&lt;/span&gt;c7c69767 True       False
&lt;span class=&#34;hljs-number&#34;&gt;2781761E-28&lt;/span&gt;E2&lt;span class=&#34;hljs-number&#34;&gt;-4109&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-99&lt;/span&gt;FE-B9D... &lt;span class=&#34;hljs-number&#34;&gt;2781761e-28&lt;/span&gt;e2&lt;span class=&#34;hljs-number&#34;&gt;-4109&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-99f&lt;/span&gt;e-b9d127c57afe True       False
Windows Security Health Ser... &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;eb6d15c&lt;span class=&#34;hljs-number&#34;&gt;-5239&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-41&lt;/span&gt;cf&lt;span class=&#34;hljs-number&#34;&gt;-82f&lt;/span&gt;b&lt;span class=&#34;hljs-number&#34;&gt;-353&lt;/span&gt;d20b816cf True       True
&lt;span class=&#34;hljs-number&#34;&gt;42&lt;/span&gt;CBFAA7-A4A7&lt;span class=&#34;hljs-number&#34;&gt;-47&lt;/span&gt;BB-B422-BD1... &lt;span class=&#34;hljs-number&#34;&gt;42&lt;/span&gt;cbfaa7-a4a7&lt;span class=&#34;hljs-number&#34;&gt;-47&lt;/span&gt;bb-b422-bd10e9d02700 True       True
&lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;A0F9AA8-A71E&lt;span class=&#34;hljs-number&#34;&gt;-4&lt;/span&gt;CC3&lt;span class=&#34;hljs-number&#34;&gt;-891&lt;/span&gt;B&lt;span class=&#34;hljs-number&#34;&gt;-76&lt;/span&gt;C... &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;a0f9aa8-a71e&lt;span class=&#34;hljs-number&#34;&gt;-4&lt;/span&gt;cc3&lt;span class=&#34;hljs-number&#34;&gt;-891&lt;/span&gt;b&lt;span class=&#34;hljs-number&#34;&gt;-76&lt;/span&gt;cac67e67c0 True       False
&lt;span class=&#34;hljs-number&#34;&gt;521&lt;/span&gt;FDB42&lt;span class=&#34;hljs-number&#34;&gt;-7130&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-4806&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-822&lt;/span&gt;A-FC5... &lt;span class=&#34;hljs-number&#34;&gt;521f&lt;/span&gt;db42&lt;span class=&#34;hljs-number&#34;&gt;-7130&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-4806&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-822&lt;/span&gt;a-fc5163fad983 True       False
&lt;span class=&#34;hljs-number&#34;&gt;534&lt;/span&gt;F5323&lt;span class=&#34;hljs-number&#34;&gt;-3569&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-4&lt;/span&gt;F42&lt;span class=&#34;hljs-number&#34;&gt;-919&lt;/span&gt;D&lt;span class=&#34;hljs-number&#34;&gt;-1E1&lt;/span&gt;... &lt;span class=&#34;hljs-number&#34;&gt;534f&lt;/span&gt;5323&lt;span class=&#34;hljs-number&#34;&gt;-3569&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-4f&lt;/span&gt;42&lt;span class=&#34;hljs-number&#34;&gt;-919&lt;/span&gt;d&lt;span class=&#34;hljs-number&#34;&gt;-1e1&lt;/span&gt;cf93e5bf6 True       False
&lt;span class=&#34;hljs-number&#34;&gt;53&lt;/span&gt;A53FE9&lt;span class=&#34;hljs-number&#34;&gt;-0&lt;/span&gt;D1A&lt;span class=&#34;hljs-number&#34;&gt;-5&lt;/span&gt;CE1-A982&lt;span class=&#34;hljs-number&#34;&gt;-92&lt;/span&gt;E... &lt;span class=&#34;hljs-number&#34;&gt;53&lt;/span&gt;a53fe9&lt;span class=&#34;hljs-number&#34;&gt;-0&lt;/span&gt;d1a&lt;span class=&#34;hljs-number&#34;&gt;-5&lt;/span&gt;ce1-a982&lt;span class=&#34;hljs-number&#34;&gt;-92&lt;/span&gt;eca1cb48bc True       False
&lt;span class=&#34;hljs-number&#34;&gt;63&lt;/span&gt;A53A38&lt;span class=&#34;hljs-number&#34;&gt;-004&lt;/span&gt;F&lt;span class=&#34;hljs-number&#34;&gt;-489&lt;/span&gt;B-BD61&lt;span class=&#34;hljs-number&#34;&gt;-96&lt;/span&gt;B... &lt;span class=&#34;hljs-number&#34;&gt;63&lt;/span&gt;a53a38&lt;span class=&#34;hljs-number&#34;&gt;-004f&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-489&lt;/span&gt;b-bd61&lt;span class=&#34;hljs-number&#34;&gt;-96&lt;/span&gt;b5eefadc04 True       False
TieringEngineService           &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;df5bcf4&lt;span class=&#34;hljs-number&#34;&gt;-22e9&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-446&lt;/span&gt;d&lt;span class=&#34;hljs-number&#34;&gt;-8763&lt;/span&gt;-a2c7677ecf7d True       True
&lt;span class=&#34;hljs-number&#34;&gt;708860E0&lt;/span&gt;-F641&lt;span class=&#34;hljs-number&#34;&gt;-4611&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-8895&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-7&lt;/span&gt;D8... &lt;span class=&#34;hljs-number&#34;&gt;708860e0&lt;/span&gt;-f641&lt;span class=&#34;hljs-number&#34;&gt;-4611&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-8895&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-7&lt;/span&gt;d867dd3675b True       False
McComponentHostService         &lt;span class=&#34;hljs-number&#34;&gt;727&lt;/span&gt;b5bd4-fae7&lt;span class=&#34;hljs-number&#34;&gt;-4&lt;/span&gt;ea7&lt;span class=&#34;hljs-number&#34;&gt;-98&lt;/span&gt;bd&lt;span class=&#34;hljs-number&#34;&gt;-20&lt;/span&gt;ac6bc25d89 True       False
Trusted Installer Service      &lt;span class=&#34;hljs-number&#34;&gt;752073&lt;/span&gt;a2&lt;span class=&#34;hljs-number&#34;&gt;-23f&lt;/span&gt;2&lt;span class=&#34;hljs-number&#34;&gt;-4396&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-85f&lt;/span&gt;0&lt;span class=&#34;hljs-number&#34;&gt;-8f&lt;/span&gt;db879ed0ed True       True
&lt;span class=&#34;hljs-number&#34;&gt;8018&lt;/span&gt;F647-BF07&lt;span class=&#34;hljs-number&#34;&gt;-55&lt;/span&gt;BB&lt;span class=&#34;hljs-number&#34;&gt;-82&lt;/span&gt;BE-A2D... &lt;span class=&#34;hljs-number&#34;&gt;8018f&lt;/span&gt;647-bf07&lt;span class=&#34;hljs-number&#34;&gt;-55&lt;/span&gt;bb&lt;span class=&#34;hljs-number&#34;&gt;-82&lt;/span&gt;be-a2d7049f7ce4 True       False
&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;A1D4361&lt;span class=&#34;hljs-number&#34;&gt;-2&lt;/span&gt;C08&lt;span class=&#34;hljs-number&#34;&gt;-4700&lt;/span&gt;-A351&lt;span class=&#34;hljs-number&#34;&gt;-3&lt;/span&gt;EA... &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;a1d4361&lt;span class=&#34;hljs-number&#34;&gt;-2&lt;/span&gt;c08&lt;span class=&#34;hljs-number&#34;&gt;-4700&lt;/span&gt;-a351&lt;span class=&#34;hljs-number&#34;&gt;-3&lt;/span&gt;eaa9cbff5e4 True       False
&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;A2F4279&lt;span class=&#34;hljs-number&#34;&gt;-5&lt;/span&gt;AFC&lt;span class=&#34;hljs-number&#34;&gt;-549&lt;/span&gt;D-B352-F32... &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;a2f4279&lt;span class=&#34;hljs-number&#34;&gt;-5&lt;/span&gt;afc&lt;span class=&#34;hljs-number&#34;&gt;-549&lt;/span&gt;d-b352-f32e6dbac9df True       False
WSearch                        &lt;span class=&#34;hljs-number&#34;&gt;9e175&lt;/span&gt;b9c-f52a&lt;span class=&#34;hljs-number&#34;&gt;-11&lt;/span&gt;d8-b9a5&lt;span class=&#34;hljs-number&#34;&gt;-505054503030&lt;/span&gt; True       True
ServiceModule                  a6b716cb&lt;span class=&#34;hljs-number&#34;&gt;-028&lt;/span&gt;b&lt;span class=&#34;hljs-number&#34;&gt;-404&lt;/span&gt;d-b72c&lt;span class=&#34;hljs-number&#34;&gt;-50e153&lt;/span&gt;dd68da True       False
ABC01078-F197&lt;span class=&#34;hljs-number&#34;&gt;-4&lt;/span&gt;B0B-ADBC-CFE... abc01078-f197&lt;span class=&#34;hljs-number&#34;&gt;-4&lt;/span&gt;b0b-adbc-cfe684b39c82 True       False
Spectrum                       c0e1ce99-c981&lt;span class=&#34;hljs-number&#34;&gt;-44&lt;/span&gt;a2-ac4c&lt;span class=&#34;hljs-number&#34;&gt;-41036f&lt;/span&gt;ac6593 True       True
ServiceModule                  cecddd22&lt;span class=&#34;hljs-number&#34;&gt;-2e72&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-4832&lt;/span&gt;&lt;span class=&#34;hljs-number&#34;&gt;-9606&lt;/span&gt;-a9b0e5e344b2 True       False
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Launch &amp;#xAD8C;&amp;#xD55C;&amp;#xB9CC; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;, &amp;#xC774;&amp;#xC804;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; COM &amp;#xAC1D;&amp;#xCCB4; &amp;#xBAA9;&amp;#xB85D;&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xBA70;, &amp;#xADF8;&amp;#xC911;&amp;#xC5D0;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4;&amp;#xB85C;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xC740; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC65C;? &amp;#xC0AC;&amp;#xC6A9;&amp;#xC740; &amp;#xBABB; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xB3D9;&amp;#xC801;&amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xB9C9;&amp;#xC0C1; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xBA74;, HasPermission&amp;#xC774; True&amp;#xAC00; &amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; Part1&amp;#xC744; &amp;#xD1B5;&amp;#xD574;, COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC228;&amp;#xACA8;&amp;#xC9C4; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC7AC;&amp;#xADC0;&amp;#xC801; &amp;#xD0D0;&amp;#xC0C9;&amp;#xC73C;&amp;#xB85C; &amp;#xAC1D;&amp;#xCCB4; &amp;#xC548;&amp;#xC758; &amp;#xC228;&amp;#xACA8;&amp;#xC9C4; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; COM &amp;#xCC98;&amp;#xB9AC; &amp;#xC21C;&amp;#xC11C;, &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC720;&amp;#xD615;, DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xB418;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC870;&amp;#xAC74;&amp;#xACFC; &amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;DCOM&amp;#xBCF4;&amp;#xB2E4; COM &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB9CE;&amp;#xC9C0;&amp;#xB9CC;, DCOM&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xC9DA;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xC57C; &amp;#xD560; &amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xACE0; DCOM &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xD1B5;&amp;#xC2E0; &amp;#xACFC;&amp;#xC815;(marshaling, proxy, stub)&amp;#xC744; &amp;#xC81C;&amp;#xC678;&amp;#xD558;&amp;#xBA74; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; Part 1&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB358; &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC73C;&amp;#xB2C8;, Part 3&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC640; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xB4E4;&amp;#xACE0; &amp;#xC624;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xAE34; &amp;#xAE00; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2F9; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/22/ogu123/COM_Object_part2/ko/truman.gif&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h1&gt;&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://klezvirus.github.io/RedTeaming/LateralMovement/LateralMovementDCOM/&#34;&gt;https://klezvirus.github.io/RedTeaming/LateralMovement/LateralMovementDCOM/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.221bluestreet.com/offensive-security/windows-components-object-model/demystifying-windows-component-object-model-com&#34;&gt;https://www.221bluestreet.com/offensive-security/windows-components-object-model/demystifying-windows-component-object-model-com&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://the-deniss.github.io/posts/2021/05/17/discovering-and-exploiting-mcafee-com-objects.html&#34;&gt;https://the-deniss.github.io/posts/2021/05/17/discovering-and-exploiting-mcafee-com-objects.html&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://posts.specterops.io/lateral-movement-abuse-the-power-of-dcom-excel-application-3c016d0d9922&#34;&gt;https://posts.specterops.io/lateral-movement-abuse-the-power-of-dcom-excel-application-3c016d0d9922&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2024/12/22/ogu123/COM_Object_part2/ko/Part2.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2024/12/22/ogu123/com_object_part2/ko/">

  <title>[Research] COM Object - Part 2 (DCOM)(KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2024-12-22 19:00" pubdate>
      2024 12 22 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      79
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] COM Object - Part 2 (DCOM)(KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h1><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! ogu123&#xC785;&#xB2C8;&#xB2E4;!!</p>
<p>Part1&#xC744; &#xC791;&#xC131;&#xD558;&#xBA74;&#xC11C; COM&#xC5D0; &#xB300;&#xD55C; &#xBCBD;&#xC744; &#xB290;&#xAEF4;..? &#xB2E4;&#xB978; &#xBD84;&#xC57C;&#xB85C; &#xB3C4;&#xB9DD;&#xAC00;&#xB824;&#xB2E4; COM&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xC810; &#xCC3E;&#xC544;&#xC57C;&#xC9C0;?&#xB77C;&#xB294; &#xB9D0;&#xC5D0; &#xC194;&#xAE43;&#xD574; Part2&#xB85C; &#xB3CC;&#xC544;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;.. &#xD558;&#xD558;</p>
<p>&#xADF8;&#xB798;&#xC11C;! Part2&#xB294; Red Team&#xC774;&#xB098; &#xB0B4;&#xBD80; &#xCE68;&#xD22C; &#xD14C;&#xC2A4;&#xD2B8; &#xC911; Lateral Movement&#xC5D0; &#xD65C;&#xC6A9;&#xD558;&#xB294; DCOM&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xC798;&#xBABB;&#xB41C; DCOM &#xAC1D;&#xCCB4;&#xAC00; &#xC874;&#xC7AC;&#xD560; &#xACBD;&#xC6B0; RCE, LPE &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xC774;&#xC5B4;&#xC9C4;&#xB2E4;&#xACE0; &#xD558;&#xB2C8; &#xC2E0;&#xB098;&#xAC8C; &#xACF5;&#xBD80;&#xD558;&#xB7EC; &#xAC00;&#xBCF4;&#xC8E0;!</p>
<p><del>(&#xC8FC;&#xC758; : Part2&#xB294; &#xC2E4;&#xC2B5;&#xBCF4;&#xB2E4; &#xC774;&#xB860;&#xC774; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;.)</del></p>
<p><img src="/2024/12/22/ogu123/COM_Object_part2/ko/Part2.jpg" srcset="/img/loading.gif" alt></p>
<h1 id="DCOM"><a href="#DCOM" class="headerlink" title="DCOM"></a>DCOM</h1><p>COM&#xACFC; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; DCOM(Distributed Component Object Model) &#xB610;&#xD55C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/openspecs/windows_protocols/ms-dcom/86b9cf84-df2e-4f0b-ac22-1b957627e1ca">Microsoft &#xAE30;&#xC220;</a>&#xB85C; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xC124;&#xBA85;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>DCOM(&#xBD84;&#xC0B0; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8; &#xAC1D;&#xCCB4; &#xBAA8;&#xB378;) &#xC6D0;&#xACA9; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC740; &#xAC1D;&#xCCB4;&#xB97C; &#xC0DD;&#xC131; &#xBC0F; &#xD65C;&#xC131;&#xD654;&#xD558;&#xACE0; &#xAC1D;&#xCCB4; &#xCC38;&#xC870;, &#xAC1D;&#xCCB4; &#xC218;&#xBA85; &#xBC0F; &#xAC1D;&#xCCB4; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xCFFC;&#xB9AC;&#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xD1B5;&#xD574; COM(&#xCEF4;&#xD3EC;&#xB10C;&#xD2B8; &#xAC1D;&#xCCB4; &#xBAA8;&#xB378;)&#xC744; &#xD655;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p>&#xB124;&#x2026; &#xC5ED;&#xC2DC; &#xC554;&#xD638;&#xD654;&#xAC00; &#xB418;&#xC5B4; &#xC788;&#xB124;&#xC694;&#x2026;</p>
<p>&#xC27D;&#xAC8C;! DCOM&#xC740; COM&#xC758; &#xD655;&#xC7A5;&#xC73C;&#xB85C;, &#xC6D0;&#xACA9; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xC788;&#xB294; COM &#xAC1D;&#xCCB4;&#xB97C; &#xB9C8;&#xCE58; &#xB85C;&#xCEEC;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xCC98;&#xB7FC; &#xD574;&#xC8FC;&#xB294; &#xAE30;&#xC220;&#xC785;&#xB2C8;&#xB2E4;!</p>
<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xC6D0;&#xACA9;&#xC5D0; &#xC788;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB85C;&#xBD80;&#xD130; COM &#xAC1D;&#xCCB4; &#xC694;&#xCCAD;&#xC774; &#xB4E4;&#xC5B4;&#xC624;&#xBA74; &#xC11C;&#xBC84; &#xCEF4;&#xD4E8;&#xD130; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; COM &#xAC1D;&#xCCB4;&#xB97C; &#xB85C;&#xB4DC;&#xD558;&#xACE0;, &#xC6D0;&#xACA9; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xD1B5;&#xD574; &#xC811;&#xADFC;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;!</p>
<p>&#xC6B0;&#xC120; COM&#xC758; &#xD638;&#xCD9C;&#xACFC; &#xD65C;&#xC131;&#xD654; &#xC720;&#xD615;&#xC5D0; &#xB530;&#xB978; &#xCC28;&#xC774;&#xC810;&#xC744; &#xC9DA;&#xACE0; DCOM&#xC744; &#xD655;&#xC778;&#xD574; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h1 id="COM-&#xAC1D;&#xCCB4;-&#xC694;&#xCCAD;-&#xCC98;&#xB9AC;-&#xC21C;&#xC11C;"><a href="#COM-&#xAC1D;&#xCCB4;-&#xC694;&#xCCAD;-&#xCC98;&#xB9AC;-&#xC21C;&#xC11C;" class="headerlink" title="COM &#xAC1D;&#xCCB4; &#xC694;&#xCCAD; &#xCC98;&#xB9AC; &#xC21C;&#xC11C;"></a>COM &#xAC1D;&#xCCB4; &#xC694;&#xCCAD; &#xCC98;&#xB9AC; &#xC21C;&#xC11C;</h1><p>Windows&#xC5D0;&#xC11C; COM &#xAC1D;&#xCCB4;&#xC758; &#xC694;&#xCCAD; &#xCC98;&#xB9AC; &#xBC0F; &#xD65C;&#xC131;&#xD654; &#xACFC;&#xC815;&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xC21C;&#xC11C;&#xB85C; &#xC9C4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;!</p>
<p><del>(tip : &#xC544;&#xB798; &#xADF8;&#xB9BC;&#xACFC; &#xAC19;&#xC774; &#xBCF4;&#xBA74; &#xC774;&#xD574;&#xAC00; &#xC3D9;&#xC3D9; &#xB429;&#xB2C8;&#xB2E4;.)</del></p>
<p><img src="/2024/12/22/ogu123/COM_Object_part2/ko/1.png" srcset="/img/loading.gif" alt></p>
<ol>
<li><strong>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xC694;&#xCCAD;</strong><ul>
<li>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; COM &#xAC1D;&#xCCB4;&#xC758; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xC694;&#xCCAD;&#xD558;&#xAE30; &#xC704;&#xD574; <code>CoCreateInstance</code>, <code>CoGetClassObject</code> &#xB4F1;&#xC758; &#xD568;&#xC218;&#xB97C; CLSID &#xB610;&#xB294; ProgID&#xB97C; &#xC778;&#xC790;&#xB85C; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xD574;&#xB2F9; &#xC694;&#xCCAD;&#xC740; COM &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;(ole32.dll)&#xB85C; &#xC804;&#xB2EC;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><strong>SCM(Service Control Manager)&#xC640; &#xC0C1;&#xD638;&#xC791;&#xC6A9;</strong><ul>
<li>COM &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB294; SCM&#xC5D0;&#xAC8C; &#xC694;&#xCCAD;&#xB41C; CLSID &#xB610;&#xB294; ProgID&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; COM &#xC11C;&#xBC84;(DLL &#xB610;&#xB294; EXE)&#xB97C; &#xCC3E;&#xC544;&#xB2EC;&#xB77C;&#xACE0; &#xC694;&#xCCAD;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>SCM&#xC740; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC;(<code>HKCR\CLSID</code> &#xB610;&#xB294; <code>HKCR\ProgID</code>)&#xB97C; &#xD655;&#xC778;&#xD558;&#xC5EC;, &#xC694;&#xCCAD;&#xB41C; CLSID &#xB610;&#xB294; ProgID&#xC640; &#xC5F0;&#xACB0;&#xB41C; COM &#xC11C;&#xBC84;&#xC758; &#xC704;&#xCE58;&#xB97C; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><strong>COM &#xC11C;&#xBC84; &#xB85C;&#xB4DC;</strong><ul>
<li>SCM&#xC740; &#xD655;&#xC778;&#xB41C; COM &#xC11C;&#xBC84;&#xB97C; &#xB85C;&#xB4DC;&#xD558;&#xACE0;, &#xC694;&#xCCAD;&#xB41C; CLSID &#xB610;&#xB294; ProgID&#xC640; &#xC5F0;&#xACB0;&#xB41C; Class Factory&#xC758; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.<ul>
<li>Class Factory&#xB294; COM &#xAC1D;&#xCCB4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xCD08;&#xAE30;&#xD654;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ul>
</li>
<li><strong>COM &#xAC1D;&#xCCB4; &#xC0DD;&#xC131; &#xBC0F; &#xCD08;&#xAE30;&#xD654;</strong><ul>
<li>Class Factory&#xB294; <code>CreateInstance</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC5EC; &#xC694;&#xCCAD;&#xB41C; CLSID &#xB610;&#xB294; ProgID&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; COM &#xAC1D;&#xCCB4;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC0DD;&#xC131;&#xB41C; COM &#xAC1D;&#xCCB4;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC694;&#xCCAD;&#xD55C; &#xD2B9;&#xC815; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xAE30; &#xC704;&#xD574; &#xCD08;&#xAE30;&#xD654;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><strong>&#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xD3EC;&#xC778;&#xD130; &#xBC18;&#xD658;</strong><ul>
<li>Class Factory&#xAC00; COM &#xAC1D;&#xCCB4;&#xB97C; &#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; &#xC0DD;&#xC131;&#xD558;&#xBA74;, &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xD3EC;&#xC778;&#xD130;&#xB97C; COM &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC5D0; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>COM &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB294; &#xC774; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xAC8C; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xC804;&#xB2EC;&#xBC1B;&#xC740; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC0DD;&#xC131;&#xB41C; COM &#xAC1D;&#xCCB4;&#xC758; &#xBA54;&#xC11C;&#xB4DC;&#xC640; &#xC18D;&#xC131;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ol>
<p><img src="/2024/12/22/ogu123/COM_Object_part2/ko/ogu.jpg" srcset="/img/loading.gif" alt></p>
<p>&#xB124;&#x2026; &#xCC9C;&#xCC9C;&#xD788; &#xC77D;&#xB2E4; &#xBCF4;&#xBA74; &#xD06C;&#xAC8C; &#xC5B4;&#xB824;&#xC6B4; &#xBD80;&#xBD84;&#xC774; &#xC5C6;&#xC9C0;&#xB9CC; &#xBA40;&#xB9AC;&#xC11C; &#xBCF4;&#xBA74; &#xBCF5;&#xC7A1;&#xD574; &#xBCF4;&#xC774;&#xB124;&#xC694;</p>
<p>&#xC704; &#xACFC;&#xC815;&#xC744; &#xB9D0;&#xC500;&#xB4DC;&#xB9B0; &#xC774;&#xC720;&#xB294; Part1&#xC5D0;&#xC11C; COM &#xD638;&#xCD9C; &#xACFC;&#xC815;&#xC744; &#xC548; &#xB2E4;&#xB918;&#xAE30;&#xB3C4; &#xD558;&#xACE0;, COM &#xC11C;&#xBC84;&#xAC00; DLL &#xB610;&#xB294; EXE&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC838; &#xC788;&#xB294;&#xB370;, &#xB354; &#xB098;&#xC544;&#xAC00;&#xBA74; DCOM&#xACFC; &#xC5F0;&#xAD00;&#xC774; &#xB418;&#xC5B4;&#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;!</p>
<p><del>(&#xC0AC;&#xC2E4; part1&#xC5D0;&#xC11C; &#xD574;&#xB2F9; &#xB0B4;&#xC6A9;&#xC744; &#xB9D0;&#xC500; &#xB4DC;&#xB9AC;&#xB824; &#xD588;&#xB294;&#xB370; &#xC9C0;&#xAE08; &#xD55C; &#xAC74; &#xC548; &#xBE44;&#xBC00;&#xC785;&#xB2C8;&#xB2E4;)</del></p>
<h1 id="COM-&#xC11C;&#xBC84;&#xC758;-&#xD65C;&#xC131;&#xD654;-&#xC720;&#xD615;"><a href="#COM-&#xC11C;&#xBC84;&#xC758;-&#xD65C;&#xC131;&#xD654;-&#xC720;&#xD615;" class="headerlink" title="COM &#xC11C;&#xBC84;&#xC758; &#xD65C;&#xC131;&#xD654; &#xC720;&#xD615;"></a>COM &#xC11C;&#xBC84;&#xC758; &#xD65C;&#xC131;&#xD654; &#xC720;&#xD615;</h1><p>&#xAC01; COM &#xC11C;&#xBC84;&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC;&#xC5D0; &#xB4F1;&#xB85D;&#xB420; &#xB54C; &#xD65C;&#xC131;&#xD654; &#xBC29;&#xC2DD;&#xC744; &#xC124;&#xC815;&#xD558;&#xBA70;, &#xD574;&#xB2F9; &#xC124;&#xC815;&#xC73C;&#xB85C; &#xC2DC;&#xC2A4;&#xD15C;&#xC774; &#xAC1D;&#xCCB4;&#xB97C; &#xB85C;&#xB4DC;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC744; &#xACB0;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xC2EC;&#xD638;&#xD761; &#xD55C; &#xBC88; &#xD558;&#xACE0; &#xB2E4;&#xC74C; &#xC138; &#xAC00;&#xC9C0; &#xD65C;&#xC131;&#xD654; &#xBC29;&#xC2DD;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<ol>
<li><strong>In-Process (InprocServer32)</strong><ul>
<li>COM &#xC11C;&#xBC84;&#xAC00; DLL &#xD30C;&#xC77C;&#xB85C; &#xAD6C;&#xD604;&#xB41C; &#xACBD;&#xC6B0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD65C;&#xC131;&#xD654; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xB0B4;&#xBD80;&#xC5D0; &#xB85C;&#xB4DC;&#xB418;&#xC5B4; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xBA54;&#xBAA8;&#xB9AC; &#xACF5;&#xAC04;&#xC744; &#xACF5;&#xC720;&#xD558;&#xBA70; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>SCM&#xC740; DLL&#xC758; &#xACBD;&#xB85C;&#xB97C; &#xBC18;&#xD658;&#xD558;&#xACE0;, &#xD574;&#xB2F9; DLL&#xC744; &#xB85C;&#xB4DC;&#xD55C; &#xD6C4; Class Factory&#xB97C; &#xC694;&#xCCAD;&#xD574; &#xAC1D;&#xCCB4;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><strong>Out-of-Process / Local (LocalServer32)</strong><ul>
<li>COM &#xC11C;&#xBC84;&#xAC00; EXE &#xD30C;&#xC77C;&#xB85C; &#xAD6C;&#xD604;&#xB41C; &#xACBD;&#xC6B0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD65C;&#xC131;&#xD654; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>&#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xBA70;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xBA54;&#xBAA8;&#xB9AC; &#xACF5;&#xAC04;&#xC744; &#xAC00;&#xC9D1;&#xB2C8;&#xB2E4;.</li>
<li>SCM&#xC740; EXE&#xC744; &#xC2E4;&#xD589;&#xD558;&#xACE0;, EXE&#xAC00; &#xC790;&#xCCB4;&#xC801;&#xC73C;&#xB85C; Class Factory&#xB97C; &#xB4F1;&#xB85D;&#xD574; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; Class Factory&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xC5EC; &#xAC1D;&#xCCB4;&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><strong>Out-of-Process / Remote (&#xC6D0;&#xACA9; COM, DCOM)</strong><ul>
<li>&#xC5EC;&#xAE30;&#xC11C; &#xC6D0;&#xACA9;&#xC740; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xD1B5;&#xD55C; COM, DCOM(Distributed COM)&#xC744; &#xC758;&#xBBF8;&#xB85C;, &#xC6D0;&#xACA9; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xC788;&#xB294; COM &#xAC1D;&#xCCB4;&#xB97C; &#xD65C;&#xC131;&#xD654;&#xD558;&#xAC70;&#xB098; &#xC811;&#xADFC;&#xD558;&#xB294; &#xAE30;&#xC220;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>&#xB85C;&#xCEEC; SCM&#xC740; &#xC6D0;&#xACA9; &#xCEF4;&#xD4E8;&#xD130;&#xC758; SCM&#xC5D0;&#xC11C; Class Factory &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xAC00;&#xC838;&#xC640; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xD1B5;&#xD574; &#xAC1D;&#xCCB4;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ol>
<p>&#xC55E;&#xC11C; COM &#xAC1D;&#xCCB4; &#xC694;&#xCCAD; &#xCC98;&#xB9AC; &#xC21C;&#xC11C;&#xC640; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xCC9C;&#xCC9C;&#xD788; &#xBCF4;&#xC2DC;&#xBA74; &#xB420; &#xAC70; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;..!</p>
<p><strong>&#xC7A0;&#xAE50;! &#xC5EC;&#xAE30;&#xC11C; &#xBB38;&#xC81C;!</strong></p>
<p>DCOM &#xC11C;&#xBC84; &#xC5ED;&#xD560;&#xC744; &#xD558;&#xB294; COM &#xAC1D;&#xCCB4;&#xB294; DLL&#xC640; EXE &#xC911; &#xC5B4;&#xB5A4; &#xD30C;&#xC77C;&#xB85C; &#xD574;&#xC57C; &#xD560;&#xAE4C;&#xC694;?</p>
<p><img src="/2024/12/22/ogu123/COM_Object_part2/ko/sphinx.jpg" srcset="/img/loading.gif" alt></p>
<p>&#xC815;&#xB2F5;&#xC740; &#xC0C1;&#xAD00;&#xC5C6;&#xB2E4;! &#xC785;&#xB2C8;&#xB2E4;. </p>
<p>&#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC6D0;&#xACA9;&#xC774;&#xB77C;&#xACE0; &#xD558;&#xBA74; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xB2E4;&#xB978; &#xC8FC;&#xC18C; &#xACF5;&#xAC04;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; EXE &#xD30C;&#xC77C;&#xB9CC; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xB429;&#xB2C8;&#xB2E4;. <del>(&#xC0AC;&#xC2E4; &#xC81C;&#xAC00; &#xADF8;&#xB807;&#xAC8C; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;)</del></p>
<p>&#xD558;&#xC9C0;&#xB9CC;, DLL Surrogate&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; DLL&#xB85C; DCOM &#xAC1D;&#xCCB4;&#xB97C; &#xAD6C;&#xD604;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>DLL&#xC740; &#xC218;&#xB3D9;&#xC801;&#xC778; &#xBAA8;&#xB4C8;&#xB85C;, &#xC790;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC5C6;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB97C; &#xC2E4;&#xD589;&#xD560; Surrogate &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Surrogate &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xB2F9;&#xC5F0;&#xD788; EXE&#xACA0;&#xC8E0;?</p>
<p><img src="/2024/12/22/ogu123/COM_Object_part2/ko/2.png" srcset="/img/loading.gif" alt></p>
<p>&#xC704; &#xADF8;&#xB9BC;&#xC744; &#xD655;&#xC778;&#xD558;&#xBA74;, dllhost.exe&#xAC00; Windows&#xC758; &#xAE30;&#xBCF8; DLL Surrogate &#xC5ED;&#xD560;&#xC744; &#xC218;&#xD589;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD94;&#xAC00;&#xB85C; dllhost.exe&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; COM &#xC11C;&#xBC84; &#xB610;&#xD55C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB124;&#xC694;.</p>
<h1 id="Out-of-Process-&#xC2E4;&#xC2B5;-MMC-exe"><a href="#Out-of-Process-&#xC2E4;&#xC2B5;-MMC-exe" class="headerlink" title="Out-of-Process &#xC2E4;&#xC2B5;(MMC.exe)"></a>Out-of-Process &#xC2E4;&#xC2B5;(MMC.exe)</h1><p>&#xC774;&#xC81C; &#xC774;&#xB860;&#xC740; &#xC7A0;&#xC2DC; &#xB4A4;&#xB85C;&#xD558;&#xACE0;, &#xAC04;&#xB2E8;&#xD55C; &#xC2E4;&#xC2B5;&#xC744; &#xD1B5;&#xD574; &#xC2E4;&#xC81C; &#xB3D9;&#xC791; &#xACFC;&#xC815;&#xC744; &#xD655;&#xC778;&#xD574; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xBC88; &#xC2E4;&#xC2B5;&#xC5D0;&#xC11C;&#xB294; &#xD2B9;&#xC815; CLSID&#xB97C; &#xD655;&#xC778;&#xD558;&#xC5EC; COM &#xC11C;&#xBC84; &#xD65C;&#xC131;&#xD654; &#xC720;&#xD615;&#xC744; &#xD30C;&#xC545;&#xD558;&#xACE0;, &#xC2E4;&#xC81C; &#xAC1D;&#xCCB4;&#xB97C; &#xC0DD;&#xC131;&#xD55C; &#xB4A4; ProcessHacker&#xB97C; &#xD1B5;&#xD574; &#xC5B4;&#xB514;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xB294;&#xC9C0; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs latex">Get-ChildItem -Path &quot;Registry::HKEY_LOCAL_MACHINE<span class="hljs-tag">\<span class="hljs-name">SOFTWARE</span></span><span class="hljs-tag">\<span class="hljs-name">Classes</span></span><span class="hljs-tag">\<span class="hljs-name">CLSID</span></span><span class="hljs-tag">\<span class="hljs-name">{</span></span>49B2791A-B1AE-4C90-9B8E-E860BA07F889}&quot;
</code></pre>
<p>&#xC704; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xD1B5;&#xD574; CLSID&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; COM &#xC11C;&#xBC84;&#xAC00; &#xC5B4;&#xB5A4; &#xD65C;&#xC131;&#xD654; &#xC720;&#xD615;&#xC73C;&#xB85C; &#xB4F1;&#xB85D;&#xB418;&#xC5B4; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/12/22/ogu123/COM_Object_part2/ko/3.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA85;&#xB839; &#xC2E4;&#xD589; &#xACB0;&#xACFC; <code>LocalServer32</code> &#xD0A4;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370;, &#xC774;&#xB294; Out-of-Process(EXE)&#xB85C; &#xB3D9;&#xC791;&#xD568;&#xC744; &#xB73B;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs elixir"><span class="hljs-variable">$comobj</span> = [System.Activator]::CreateInstance([Type]::GetTypeFromCLSID(<span class="hljs-string">&quot;49B2791A-B1AE-4C90-9B8E-E860BA07F889&quot;</span>))
</code></pre>
<p>&#xC704; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xD1B5;&#xD574; &#xD574;&#xB2F9; CLSID&#xC758; COM &#xAC1D;&#xCCB4;&#xB97C; &#xC0DD;&#xC131; &#xD6C4; ProcessHacker&#xB97C; &#xD1B5;&#xD574; &#xD655;&#xC778;&#xD574; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/12/22/ogu123/COM_Object_part2/ko/4.png" srcset="/img/loading.gif" alt></p>
<p>Out-of-Process(LocalServer) COM &#xB610;&#xB294; DCOM&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xACBD;&#xC6B0; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84; &#xD1B5;&#xC2E0;&#xC740; svchost.exe &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; RPCSS &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xD1B5;&#xD574; &#xD1B5;&#xC2E0;&#xC744; &#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C;, MMC.exe &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xC18D;&#xC131;&#xC744; &#xD655;&#xC778;&#xD558;&#xBA74;, Parent Process&#xB85C; <code>svchost.exe</code>&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC2E4;&#xC2B5;&#xC740; &#xAC04;&#xB2E8;&#xD558;&#xC8E0;..? &#xC0AC;&#xC2E4; &#xB208;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xD558;&#xBA74;&#xC11C; &#xACF5;&#xBD80;&#xD558;&#xB294; &#xAC8C; &#xAC00;&#xC7A5; &#xC88B;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD574; &#xC5EC;&#xB7EC;&#xBD84;&#xB4E4;&#xB3C4; &#xB530;&#xB77C; &#xD574;&#xBCF4;&#xC138;&#xC6A9;!</p>
<h1 id="DCOM-&#xAC1C;&#xB150;"><a href="#DCOM-&#xAC1C;&#xB150;" class="headerlink" title="DCOM &#xAC1C;&#xB150;"></a>DCOM &#xAC1C;&#xB150;</h1><p>&#xC774;&#xC81C; &#xB4DC;&#xB514;&#xC5B4; DCOM &#xAC1C;&#xB150;&#xC785;&#xB2C8;&#xB2E4;! COM &#xC694;&#xCCAD; &#xCC98;&#xB9AC; &#xC21C;&#xC11C;, &#xD65C;&#xC131;&#xD654; &#xC720;&#xD615;&#xCC98;&#xB7FC; &#xBCF5;&#xC7A1;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xB2C8; &#xAC00;&#xBCCD;&#xAC8C; &#xC77D;&#xC73C;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>DCOM&#xC758; &#xC8FC;&#xC694; &#xAE30;&#xB2A5;&#xC740; &#xC6D0;&#xACA9; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0;&#xC11C; COM &#xAC1D;&#xCCB4;&#xB97C; &#xD65C;&#xC131;&#xD654;&#xD558;&#xACE0; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xAE30;&#xC220;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC1D;&#xCCB4; &#xC790;&#xCCB4;&#xB294; &#xC6D0;&#xACA9; &#xCEF4;&#xD4E8;&#xD130;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xBA70;, &#xB85C;&#xCEEC; &#xCEF4;&#xD4E8;&#xD130;&#xB294; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xD1B5;&#xD574; &#xAC1D;&#xCCB4;&#xC5D0; &#xC811;&#xADFC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7FC; DCOM&#xC740; &#xC5B4;&#xB514;&#xC5D0;&#xC11C; &#xC5B4;&#xB5BB;&#xAC8C; &#xD65C;&#xC6A9;&#xD560;&#xAE4C;&#xC694;?</p>
<p>DCOM&#xC740; &#xC6D0;&#xACA9;&#xC73C;&#xB85C; COM &#xAC1D;&#xCCB4;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xD2B9;&#xC131;&#xC744; &#xD1B5;&#xD574; Lateral Movement&#xC5D0; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xB41C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xACFC;&#xAC70;&#xC5D0;&#xB294; PowerShell Remoting&#xC744; &#xC8FC;&#xB85C; &#xC0AC;&#xC6A9;&#xD588;&#xC9C0;&#xB9CC;, &#xCD5C;&#xADFC;&#xC5D0;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; DCOM &#xAC1D;&#xCCB4;&#xB4E4;&#xC774; &#xD65C;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><strong>ShellWindows</strong></li>
<li><strong>ShellBrowserWindows</strong></li>
<li><strong>MMC20.Application</strong></li>
<li><strong>Excel.Application</strong><ul>
<li>DDEInitiate</li>
<li>RegisterXLL</li>
</ul>
</li>
<li><strong>Outlook.Application</strong><ul>
<li>CreateObject-&gt;Shell.Application</li>
<li>CreateObject-&gt;ScriptControl (office-32bit only)</li>
</ul>
</li>
<li><strong>Visio.InvisibleApp</strong><ul>
<li>Addons</li>
<li>ExecuteLine</li>
</ul>
</li>
<li><strong>Word.Application</strong><ul>
<li>RunAutoMacro</li>
</ul>
</li>
</ul>
<h1 id="DCOM-&#xAC1D;&#xCCB4;&#xC758;-&#xC124;&#xC815;-&#xC870;&#xAC74;"><a href="#DCOM-&#xAC1D;&#xCCB4;&#xC758;-&#xC124;&#xC815;-&#xC870;&#xAC74;" class="headerlink" title="DCOM &#xAC1D;&#xCCB4;&#xC758; &#xC124;&#xC815; &#xC870;&#xAC74;"></a>DCOM &#xAC1D;&#xCCB4;&#xC758; &#xC124;&#xC815; &#xC870;&#xAC74;</h1><p>&#xC0AC;&#xC2E4; COM&#xC5D0;&#xB294; CLSID&#xC640; ProgID &#xC678;&#xC5D0;&#xB3C4; AppID&#xB77C;&#xB294; &#xAC12;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/windows/win32/com/appid-key">AppID</a>&#xB294; COM &#xAC1D;&#xCCB4;&#xB97C; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xD654;&#xD558;&#xACE0; &#xC811;&#xADFC; &#xAD8C;&#xD55C;&#xC744; &#xAD00;&#xB9AC;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xAC01;&#xC885; &#xAD6C;&#xC131; &#xC815;&#xBCF4;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70;,<br>&#xD558;&#xB098; &#xC774;&#xC0C1;&#xC758; COM &#xAC1D;&#xCCB4;&#xC640; &#xC5F0;&#xACB0;&#xB418;&#xC5B4; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9CC;&#xC57D; &#xD2B9;&#xC815; COM &#xAC1D;&#xCCB4;&#xC5D0; AppID&#xAC00; &#xC124;&#xC815;&#xB418;&#xC5B4; &#xC788;&#xC9C0; &#xC54A;&#xB2E4;&#xBA74;, &#xC6D0;&#xACA9; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0;&#xC11C; &#xD574;&#xB2F9; &#xAC1D;&#xCCB4;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; DCOM&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xB824;&#xBA74; CLSID&#xAC00; &#xC801;&#xC808;&#xD55C; AppID&#xC640; &#xC5F0;&#xACB0;&#xB418;&#xACE0;, AppID&#xC5D0; &#xC801;&#xC808;&#xD55C; &#xAD8C;&#xD55C;&#xC774; &#xC124;&#xC815;&#xB418;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2024/12/22/ogu123/COM_Object_part2/ko/5.png" srcset="/img/loading.gif" alt></p>
<p>&#xC6D0;&#xACA9;&#xC5D0;&#xC11C; DCOM &#xAC1D;&#xCCB4;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB824;&#xBA74;, AppID&#xC5D0; &#xB2E4;&#xC74C; &#xAD8C;&#xD55C;&#xC774; &#xC815;&#xC758;&#xB418;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;!</p>
<ul>
<li><code>AccessPermissions</code>: &#xAC1D;&#xCCB4; &#xC811;&#xADFC; &#xAD8C;&#xD55C;</li>
<li><code>LaunchPermissions</code>: &#xAC1D;&#xCCB4; &#xC2E4;&#xD589; &#xAD8C;&#xD55C;</li>
</ul>
<p>&#xC704; &#xADF8;&#xB9BC;&#xC758; &#xAD8C;&#xD55C;&#xC740; &#xD2B9;&#xC815; DCOM &#xAC1D;&#xCCB4;&#xC5D0;&#xB9CC; &#xC801;&#xC6A9;&#xB41C; &#xAC83;&#xC774;&#xACE0; Global Permissions&#xB97C; &#xD1B5;&#xD574; &#xC2DC;&#xC2A4;&#xD15C; &#xC804;&#xCCB4; DCOM &#xAC1D;&#xCCB4;&#xC5D0; &#xB300;&#xD55C; &#xAD8C;&#xD55C;&#xC744; &#xC124;&#xC815;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xCD94;&#xAC00;&#xB85C; DCOM&#xC740; DCE-RPC(Distributed Computing Environment Remote Procedure Call) &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA70;, &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; 135&#xBC88; &#xD3EC;&#xD2B8;&#xB97C; &#xD1B5;&#xD574; &#xD1B5;&#xC2E0;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xB530;&#xB77C;&#xC11C;, DCOM&#xC774; &#xB3D9;&#xC791;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; &#xD3EC;&#xD2B8; &#xD655;&#xC778;, Global Permissions, COM AppID&#x2026; &#xC21C;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;!</p>
<h1 id="&#xD2B9;&#xC815;-&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C;-&#xCDE8;&#xC57D;&#xD55C;-COM-&#xCC3E;&#xAE30;"><a href="#&#xD2B9;&#xC815;-&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C;-&#xCDE8;&#xC57D;&#xD55C;-COM-&#xCC3E;&#xAE30;" class="headerlink" title="&#xD2B9;&#xC815; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xD55C; COM &#xCC3E;&#xAE30;"></a>&#xD2B9;&#xC815; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xD55C; COM &#xCC3E;&#xAE30;</h1><p>DCOM &#xAC1C;&#xB150;&#xC5D0;&#xC11C; &#xD2B9;&#xC815; &#xD504;&#xB85C;&#xADF8;&#xB7A8;(Excel, Outlook &#x2026;)&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; COM &#xAC1D;&#xCCB4;&#xB97C; &#xD655;&#xC778;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xD76C; &#xC774;&#xB7F0; COM &#xAC1D;&#xCCB4; &#xC788;&#xC5B4;&#xC694;~ Lateral Movement &#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xD558;&#xC138;&#xC694;~ &#xB294; &#xB2F9;&#xC5F0;&#xD788; &#xC544;&#xB2C8;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xC774;&#xBC88;&#xC5D0;&#xB294; &#xD2B9;&#xC815; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xD55C; COM &#xAC1D;&#xCCB4; &#xCC3E;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xB2E4;&#xB904;&#xBCF4;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xCDE8;&#xC57D;&#xD55C; COM &#xAC1D;&#xCCB4;&#xB97C; &#xCC3E;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xB2E4;&#xC74C; &#xC138; &#xAC00;&#xC9C0; &#xD2B9;&#xC9D5;&#xC744; &#xB9CC;&#xC871;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.<br><del>(7KCA64qUIE1jQWZlZSBTY2Fu66W8IO2DgOqyn+ycvOuhnCDtlojsirXri4jri6Qu)</del></p>
<ol>
<li>&#xD2B9;&#xC815; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC758;&#xD574; &#xC124;&#xCE58;&#xB41C; COM &#xAC1D;&#xCCB4;</li>
<li>&#xC2DC;&#xC2A4;&#xD15C; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294; Out-of-Process &#xAC1D;&#xCCB4;</li>
<li>&#xC0AC;&#xC6A9;&#xC790; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC811;&#xADFC; &#xAC00;&#xB2A5;&#xD55C; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;</li>
</ol>
<p>&#xADF8;&#xB7FC; &#xCC28;&#xB840;&#xB300;&#xB85C; &#xD655;&#xC778;&#xD574; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<pre><code class="hljs pgsql"><span class="hljs-keyword">Set</span>-ComDatabase -<span class="hljs-type">Path</span> ComDb_old.db -<span class="hljs-keyword">Database</span> (<span class="hljs-keyword">Get</span>-ComDatabase -PassThru)</code></pre>
<p>&#xD2B9;&#xC815; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC124;&#xCE58;&#xD55C; COM &#xAC1D;&#xCCB4;&#xB97C; &#xCC3E;&#xB294; &#xAC04;&#xB2E8;&#xD558;&#xACE0; &#xBA85;&#xD655;&#xD55C; &#xBC29;&#xBC95;&#xC740; &#xC124;&#xCE58; &#xC804;&#xACFC; &#xD6C4;&#xC758; &#xC2A4;&#xB0C5;&#xC0F7;&#xC744; &#xD1B5;&#xD574; &#xBE44;&#xAD50;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;!</p>
<p>&#xC704; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xD1B5;&#xD574; &#xAE30;&#xC874;&#xC5D0; &#xB4F1;&#xB85D;&#xB41C; COM &#xAC1D;&#xCCB4; &#xC815;&#xBCF4;&#xB97C; &#xC218;&#xC9D1;&#xD558;&#xC5EC; <code>ComDb_old.db</code> &#xD30C;&#xC77C;&#xB85C; &#xBC31;&#xC5C5; &#xD6C4; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC124;&#xCE58;&#xD569;&#xB2C8;&#xB2E4;!</p>
<pre><code class="hljs mathematica">$comDiff = Compare-ComDatabase `
    -<span class="hljs-keyword">Left</span> (<span class="hljs-keyword">Get</span>-ComDatabase -<span class="hljs-keyword">Path</span> ComDb_old.db -PassThru) `
    -<span class="hljs-keyword">Right</span> (<span class="hljs-keyword">Get</span>-ComDatabase -PassThru) `
    -DiffMode RightOnly
</code></pre>
<p>&#xC124;&#xCE58;&#xAC00; &#xC644;&#xB8CC;&#xB418;&#xBA74; &#xB2E4;&#xC2DC; &#xB4F1;&#xB85D;&#xB41C; COM &#xAC1D;&#xCCB4; &#xC815;&#xBCF4;&#xB97C; &#xC218;&#xC9D1;&#xD558;&#xACE0;, &#xC774;&#xC804; &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xC218;&#xC9D1;&#xD55C; &#xC2A4;&#xB0C5;&#xC0F7;&#xACFC; &#xBE44;&#xAD50;&#xD574; &#xCC28;&#xC774;&#xC810;&#xC744; &#xCC3E;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8; &#xACB0;&#xACFC; <code>$comDiff</code> &#xBCC0;&#xC218;&#xC5D0;&#xB294; &#xC0C8;&#xB85C; &#xCD94;&#xAC00;&#xB41C; COM &#xAC1D;&#xCCB4;&#xB4E4;&#xC758; &#xC815;&#xBCF4;&#xAC00; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;!</p>
<pre><code class="hljs powershell"><span class="hljs-variable">$explorerId</span> = (<span class="hljs-built_in">Get-Process</span> <span class="hljs-literal">-Name</span> explorer).Id

<span class="hljs-variable">$comsAsSystem</span> = <span class="hljs-variable">$comDiff</span>.AppIDs.Values |
    <span class="hljs-built_in">Where-Object</span> {
        <span class="hljs-variable">$_</span>.IsService <span class="hljs-operator">-eq</span> <span class="hljs-variable">$true</span> <span class="hljs-operator">-or</span>
        <span class="hljs-variable">$_</span>.RunAs <span class="hljs-operator">-ieq</span> <span class="hljs-string">&quot;nt authority\system&quot;</span>
    }
</code></pre>
<p>Explorer &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; ID&#xB97C; &#xAC00;&#xC838;&#xC624;&#xACE0;, <code>$comDiff</code>&#xC5D0; &#xC0C8;&#xB85C; &#xCD94;&#xAC00;&#xB41C; COM &#xAC1D;&#xCCB4; &#xC911; NT Authority\SYSTEM &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xAC70;&#xB098; &#xC11C;&#xBE44;&#xC2A4;&#xB85C; &#xB4F1;&#xB85D;&#xB41C; &#xAC1D;&#xCCB4;&#xB9CC; &#xD544;&#xD130;&#xB9C1;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs routeros"><span class="hljs-variable">$comsAsSystem</span> |
Select-ComAccess -ProcessId <span class="hljs-variable">$explorerId</span> -Principal S-1-5-18

Name                           AppID                                IsService  HasPermission
----                           -----                                ---------  -------------
PerceptionSimulation           1b162a5b-b67a-4468-9613-c3f9765b353b <span class="hljs-literal">True</span>       <span class="hljs-literal">True</span>
42CBFAA7-A4A7-47BB-B422-BD1<span class="hljs-built_in">..</span>. 42cbfaa7-a4a7-47bb-b422-bd10e9d02700 <span class="hljs-literal">True</span>       <span class="hljs-literal">True</span>
Trusted Installer<span class="hljs-built_in"> Service </span>     752073a2-23f2-4396-85f0-8fdb879ed0ed <span class="hljs-literal">True</span>       <span class="hljs-literal">True</span>
Spectrum                       c0e1ce99-c981-44a2-ac4c-41036fac6593 <span class="hljs-literal">True</span>       <span class="hljs-literal">True</span>
</code></pre>
<p>Explorer &#xD504;&#xB85C;&#xC138;&#xC2A4;(<code>$explorerId</code>)&#xAC00; SYSTEM &#xAD8C;&#xD55C;(<code>S-1-5-18</code>)&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294; COM &#xAC1D;&#xCCB4;&#xB4E4;&#xC5D0; &#xC811;&#xADFC; &#xAC00;&#xB2A5;&#xD55C;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA85;&#xB839;&#xC5B4; &#xACB0;&#xACFC;&#xB97C; &#xD655;&#xC778;&#xD558;&#xBA74;, System &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xACE0; &#xC811;&#xADFC; &#xAC00;&#xB2A5;&#xD558;&#xC9C0;&#xB9CC; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; COM &#xAC1D;&#xCCB4;&#xB294; &#xD655;&#xC778;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026;</p>
<p>&#xC774; &#xB9D0;&#xC740; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xB9CC;&#xB4E0; COM &#xAC1D;&#xCCB4;&#xAC00; <code>$explorerId</code> &#xAD8C;&#xD55C;&#xC5D0;&#xC11C; &#xC811;&#xADFC;(Launch &#xBC0F; Access) &#xAC00;&#xB2A5;&#xD55C; &#xC0C1;&#xD0DC;&#xB85C; &#xB4F1;&#xB85D;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xB73B;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD558;&#xC9C0;&#xB9CC;! &#xC5EC;&#xAE30;&#xC11C; Access&#xB294; Launch &#xBC0F; Access &#xAD8C;&#xD55C;&#xC744; &#xBAA8;&#xB450; &#xD3EC;&#xD568;&#xD558;&#xB294; &#xC758;&#xBBF8;&#xB85C; &#xB9CC;&#xC57D;, Launch &#xAD8C;&#xD55C;&#xB9CC; &#xD655;&#xC778;&#xD560; &#xACBD;&#xC6B0;(Access=0&#xC778; &#xACBD;&#xC6B0; &#xB4F1;) &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; COM &#xAC1D;&#xCCB4;&#xAC00; &#xB098;&#xC62C; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<pre><code class="hljs angelscript">$comsAsSystem |
Select-ComAccess `
         -ProcessId $explorerId `
         -Principal S<span class="hljs-number">-1</span><span class="hljs-number">-5</span><span class="hljs-number">-18</span> `
         -LaunchAccess ActivateLocal, ExecuteLocal `
         -Access <span class="hljs-number">0</span>

Name                           AppID                                IsService  HasPermission
----                           -----                                ---------  -------------
<span class="hljs-number">000</span>C101C<span class="hljs-number">-0000</span><span class="hljs-number">-0000</span>-C000<span class="hljs-number">-000.</span>.. <span class="hljs-number">000</span>c101c<span class="hljs-number">-0000</span><span class="hljs-number">-0000</span>-c000<span class="hljs-number">-000000000046</span> True       False
PerceptionSimulation           <span class="hljs-number">1</span>b162a5b-b67a<span class="hljs-number">-4468</span><span class="hljs-number">-9613</span>-c3f9765b353b True       True
<span class="hljs-number">1</span>FCBE96C<span class="hljs-number">-1697</span><span class="hljs-number">-43</span>AF<span class="hljs-number">-9140</span><span class="hljs-number">-289.</span>.. <span class="hljs-number">1f</span>cbe96c<span class="hljs-number">-1697</span><span class="hljs-number">-43</span>af<span class="hljs-number">-9140</span><span class="hljs-number">-2897</span>c7c69767 True       False
<span class="hljs-number">2781761E-28</span>E2<span class="hljs-number">-4109</span><span class="hljs-number">-99</span>FE-B9D... <span class="hljs-number">2781761e-28</span>e2<span class="hljs-number">-4109</span><span class="hljs-number">-99f</span>e-b9d127c57afe True       False
Windows Security Health Ser... <span class="hljs-number">2</span>eb6d15c<span class="hljs-number">-5239</span><span class="hljs-number">-41</span>cf<span class="hljs-number">-82f</span>b<span class="hljs-number">-353</span>d20b816cf True       True
<span class="hljs-number">42</span>CBFAA7-A4A7<span class="hljs-number">-47</span>BB-B422-BD1... <span class="hljs-number">42</span>cbfaa7-a4a7<span class="hljs-number">-47</span>bb-b422-bd10e9d02700 True       True
<span class="hljs-number">4</span>A0F9AA8-A71E<span class="hljs-number">-4</span>CC3<span class="hljs-number">-891</span>B<span class="hljs-number">-76</span>C... <span class="hljs-number">4</span>a0f9aa8-a71e<span class="hljs-number">-4</span>cc3<span class="hljs-number">-891</span>b<span class="hljs-number">-76</span>cac67e67c0 True       False
<span class="hljs-number">521</span>FDB42<span class="hljs-number">-7130</span><span class="hljs-number">-4806</span><span class="hljs-number">-822</span>A-FC5... <span class="hljs-number">521f</span>db42<span class="hljs-number">-7130</span><span class="hljs-number">-4806</span><span class="hljs-number">-822</span>a-fc5163fad983 True       False
<span class="hljs-number">534</span>F5323<span class="hljs-number">-3569</span><span class="hljs-number">-4</span>F42<span class="hljs-number">-919</span>D<span class="hljs-number">-1E1</span>... <span class="hljs-number">534f</span>5323<span class="hljs-number">-3569</span><span class="hljs-number">-4f</span>42<span class="hljs-number">-919</span>d<span class="hljs-number">-1e1</span>cf93e5bf6 True       False
<span class="hljs-number">53</span>A53FE9<span class="hljs-number">-0</span>D1A<span class="hljs-number">-5</span>CE1-A982<span class="hljs-number">-92</span>E... <span class="hljs-number">53</span>a53fe9<span class="hljs-number">-0</span>d1a<span class="hljs-number">-5</span>ce1-a982<span class="hljs-number">-92</span>eca1cb48bc True       False
<span class="hljs-number">63</span>A53A38<span class="hljs-number">-004</span>F<span class="hljs-number">-489</span>B-BD61<span class="hljs-number">-96</span>B... <span class="hljs-number">63</span>a53a38<span class="hljs-number">-004f</span><span class="hljs-number">-489</span>b-bd61<span class="hljs-number">-96</span>b5eefadc04 True       False
TieringEngineService           <span class="hljs-number">6</span>df5bcf4<span class="hljs-number">-22e9</span><span class="hljs-number">-446</span>d<span class="hljs-number">-8763</span>-a2c7677ecf7d True       True
<span class="hljs-number">708860E0</span>-F641<span class="hljs-number">-4611</span><span class="hljs-number">-8895</span><span class="hljs-number">-7</span>D8... <span class="hljs-number">708860e0</span>-f641<span class="hljs-number">-4611</span><span class="hljs-number">-8895</span><span class="hljs-number">-7</span>d867dd3675b True       False
McComponentHostService         <span class="hljs-number">727</span>b5bd4-fae7<span class="hljs-number">-4</span>ea7<span class="hljs-number">-98</span>bd<span class="hljs-number">-20</span>ac6bc25d89 True       False
Trusted Installer Service      <span class="hljs-number">752073</span>a2<span class="hljs-number">-23f</span>2<span class="hljs-number">-4396</span><span class="hljs-number">-85f</span>0<span class="hljs-number">-8f</span>db879ed0ed True       True
<span class="hljs-number">8018</span>F647-BF07<span class="hljs-number">-55</span>BB<span class="hljs-number">-82</span>BE-A2D... <span class="hljs-number">8018f</span>647-bf07<span class="hljs-number">-55</span>bb<span class="hljs-number">-82</span>be-a2d7049f7ce4 True       False
<span class="hljs-number">8</span>A1D4361<span class="hljs-number">-2</span>C08<span class="hljs-number">-4700</span>-A351<span class="hljs-number">-3</span>EA... <span class="hljs-number">8</span>a1d4361<span class="hljs-number">-2</span>c08<span class="hljs-number">-4700</span>-a351<span class="hljs-number">-3</span>eaa9cbff5e4 True       False
<span class="hljs-number">8</span>A2F4279<span class="hljs-number">-5</span>AFC<span class="hljs-number">-549</span>D-B352-F32... <span class="hljs-number">8</span>a2f4279<span class="hljs-number">-5</span>afc<span class="hljs-number">-549</span>d-b352-f32e6dbac9df True       False
WSearch                        <span class="hljs-number">9e175</span>b9c-f52a<span class="hljs-number">-11</span>d8-b9a5<span class="hljs-number">-505054503030</span> True       True
ServiceModule                  a6b716cb<span class="hljs-number">-028</span>b<span class="hljs-number">-404</span>d-b72c<span class="hljs-number">-50e153</span>dd68da True       False
ABC01078-F197<span class="hljs-number">-4</span>B0B-ADBC-CFE... abc01078-f197<span class="hljs-number">-4</span>b0b-adbc-cfe684b39c82 True       False
Spectrum                       c0e1ce99-c981<span class="hljs-number">-44</span>a2-ac4c<span class="hljs-number">-41036f</span>ac6593 True       True
ServiceModule                  cecddd22<span class="hljs-number">-2e72</span><span class="hljs-number">-4832</span><span class="hljs-number">-9606</span>-a9b0e5e344b2 True       False
</code></pre>
<p>Launch &#xAD8C;&#xD55C;&#xB9CC; &#xD655;&#xC778;&#xD55C; &#xACB0;&#xACFC;, &#xC774;&#xC804;&#xBCF4;&#xB2E4; &#xB354; &#xB9CE;&#xC740; COM &#xAC1D;&#xCCB4; &#xBAA9;&#xB85D;&#xC774; &#xB098;&#xD0C0;&#xB098;&#xBA70;, &#xADF8;&#xC911;&#xC5D0;&#xB294; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC774;&#xB294; COM &#xAC1D;&#xCCB4;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;..!</p>
<p>&#xC774;&#xD6C4;&#xB85C;&#xB294; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8; COM &#xAC1D;&#xCCB4;&#xAC00; &#xC0DD;&#xC131;&#xC740; &#xAC00;&#xB2A5;&#xD558;&#xC9C0;&#xB9CC; &#xC65C;? &#xC0AC;&#xC6A9;&#xC740; &#xBABB; &#xD558;&#xB294;&#xC9C0; &#xB3D9;&#xC801;&#xBD84;&#xC11D;&#xC744; &#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;!</p>
<p>&#xB9C9;&#xC0C1; &#xAC1D;&#xCCB4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xBA74;, HasPermission&#xC774; True&#xAC00; &#xB418;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xC8E0;.</p>
<p>&#xC800;&#xD76C;&#xB294; Part1&#xC744; &#xD1B5;&#xD574;, COM &#xAC1D;&#xCCB4;&#xC758; &#xC228;&#xACA8;&#xC9C4; &#xBA54;&#xC18C;&#xB4DC;&#xAC00; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C;&#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xC7AC;&#xADC0;&#xC801; &#xD0D0;&#xC0C9;&#xC73C;&#xB85C; &#xAC1D;&#xCCB4; &#xC548;&#xC758; &#xC228;&#xACA8;&#xC9C4; &#xBA54;&#xC18C;&#xB4DC;&#xB97C; &#xCC3E;&#xC73C;&#xBA74;&#xC11C; &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;!</p>
<h1 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h1><p>&#xC774;&#xBC88; &#xAE00;&#xC744; &#xD1B5;&#xD574; COM &#xCC98;&#xB9AC; &#xC21C;&#xC11C;, &#xD65C;&#xC131;&#xD654; &#xC720;&#xD615;, DCOM &#xAC1D;&#xCCB4;&#xAC00; &#xB418;&#xAE30; &#xC704;&#xD55C; &#xC870;&#xAC74;&#xACFC; &#xD2B9;&#xC815; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xD55C; COM &#xAC1D;&#xCCB4;&#xB97C; &#xCC3E;&#xB294; &#xBC29;&#xBC95;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>DCOM&#xBCF4;&#xB2E4; COM &#xB0B4;&#xC6A9;&#xC774; &#xB9CE;&#xC9C0;&#xB9CC;, DCOM&#xC744; &#xC774;&#xD574;&#xD558;&#xB824;&#xBA74; &#xC9DA;&#xACE0; &#xB118;&#xC5B4;&#xAC00;&#xC57C; &#xD560; &#xBD80;&#xBD84;&#xC774;&#xACE0; DCOM &#xC790;&#xCCB4;&#xAC00; &#xD1B5;&#xC2E0; &#xACFC;&#xC815;(marshaling, proxy, stub)&#xC744; &#xC81C;&#xC678;&#xD558;&#xBA74; &#xBE44;&#xAD50;&#xC801; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; Part 1&#xC5D0;&#xC11C; &#xB2E4;&#xB8E8;&#xC9C0; &#xC54A;&#xC558;&#xB358; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xD55C; COM &#xAC1D;&#xCCB4;&#xB97C; &#xCC3E;&#xB294; &#xBC29;&#xBC95;&#xAE4C;&#xC9C0; &#xD655;&#xC778;&#xD588;&#xC73C;&#xB2C8;, Part 3&#xC5D0;&#xC11C;&#xB294; COM &#xAC1D;&#xCCB4;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xB3C4;&#xAD6C;&#xC640; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xB4E4;&#xACE0; &#xC624;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xAE34; &#xAE00; &#xC77D;&#xC5B4;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2F9; &#x314E;&#x314E;</p>
<p><img src="/2024/12/22/ogu123/COM_Object_part2/ko/truman.gif" srcset="/img/loading.gif" alt></p>
<h1 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h1><ul>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://klezvirus.github.io/RedTeaming/LateralMovement/LateralMovementDCOM/">https://klezvirus.github.io/RedTeaming/LateralMovement/LateralMovementDCOM/</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.221bluestreet.com/offensive-security/windows-components-object-model/demystifying-windows-component-object-model-com">https://www.221bluestreet.com/offensive-security/windows-components-object-model/demystifying-windows-component-object-model-com</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://the-deniss.github.io/posts/2021/05/17/discovering-and-exploiting-mcafee-com-objects.html">https://the-deniss.github.io/posts/2021/05/17/discovering-and-exploiting-mcafee-com-objects.html</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://posts.specterops.io/lateral-movement-abuse-the-power-of-dcom-excel-application-3c016d0d9922">https://posts.specterops.io/lateral-movement-abuse-the-power-of-dcom-excel-application-3c016d0d9922</a></p>
</li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/ogu123/">ogu123</a>
                  
                  <a class="hover-with-bg" href="/tags/COM-Object/">COM Object</a>
                  
                  <a class="hover-with-bg" href="/tags/DCOM/">DCOM</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_ogu123.jpg" srcset="/img/loading.gif" alt="ogu123">
                  </div>

                  <div class="link-text">
                    <div class="link-title">ogu123</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/ogu123">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2024/12/22/ogu123/COM_Object_part2/en/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] COM Object - Part 2 (DCOM)(EN)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2024/12/21/hunjison/CVE-2024-7029/">
                    <span class="hidden-mobile">[] CVE-2024-7029: AVTECH IP  Command Injection  RCE </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2024/12/22/ogu123/COM_Object_part2/ko/';
        this.page.identifier = '/2024/12/22/ogu123/COM_Object_part2/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] COM Object - Part 2 (DCOM)(KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
