

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/logo_window.png&#34; alt&gt;&lt;/p&gt;
&lt;h2 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB4E4; &amp;#xC0C8;&amp;#xD574; &amp;#xC798; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC168;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;! &amp;#xC800;&amp;#xC758; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC774;&amp;#xC790; &amp;#xB9C9;&amp;#xB0B4;&amp;#xC988;&amp;#xC758; Part 2 &amp;#xAE00;&amp;#xC744; &amp;#xB9E1;&amp;#xAC8C; &amp;#xB41C; gongjae &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F600; &amp;#xC55E;&amp;#xC11C; banda&amp;#xB2D8;&amp;#xC774; &lt;a href=&#34;https://hackyboiz.github.io/2025/12/28/banda/WHS3-bughunting/ko/&#34;&gt;Part 1&lt;/a&gt;&amp;#xC744; &amp;#xC57C;&amp;#xBB34;&amp;#xC9C0;&amp;#xAC8C; &amp;#xC368;&amp;#xC8FC;&amp;#xC2E0; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; &amp;#xC81C;&amp;#xAC00; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xAC8C; &amp;#xB0A8;&amp;#xC544;&amp;#xC788;&amp;#xC744;&amp;#xAE4C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC9C1;&amp;#xC811; &amp;#xCC3E;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC124;&amp;#xBA85;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC5D0; &amp;#xAD00;&amp;#xC2EC; &amp;#xC788;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC870;&amp;#xAE08;&amp;#xC774;&amp;#xB098;&amp;#xB9C8; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xACE0; &amp;#xC2F6;&amp;#xB124;&amp;#xC694;..&amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xC81C;&amp;#xAC00; Part 2&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xCC3E;&amp;#xC740; Named Pipe&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; LPE &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA70; &amp;#x2018;&amp;#xC774;&amp;#xB7F0; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C;&amp;#xB3C4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAD6C;&amp;#xB098;&amp;#x2019;&amp;#xB97C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xC790;, &amp;#xC6B0;&amp;#xC120; &amp;#xC81C;&amp;#xAC00; &amp;#xCC3E;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC548;&amp;#xD2F0;&amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; Named Pipe &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778;&amp;#xB370;&amp;#xC694;, &amp;#xD604;&amp;#xC7AC;&amp;#xB294; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xC0C1;&amp;#xD669;&amp;#xC774;&amp;#xACE0; ZDI&amp;#xC5D0; &amp;#xC81C;&amp;#xBCF4;&amp;#xD558;&amp;#xC5EC; CVE&amp;#xAE4C;&amp;#xC9C0; &amp;#xBC1C;&amp;#xAE09;&amp;#xC774; &amp;#xB41C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xC624;&amp;#xB298; &amp;#xC81C;&amp;#xAC00; &amp;#xBCF4;&amp;#xC5EC;&amp;#xB4DC;&amp;#xB9B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; File &amp;#xAD00;&amp;#xB828;, Registry &amp;#xAD00;&amp;#xB828;, Service &amp;#xAD00;&amp;#xB828;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xB258;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;! Named Pipe&amp;#xB97C; &amp;#xACFC;&amp;#xB3C4;&amp;#xD558;&amp;#xAC8C; &amp;#xAC1C;&amp;#xBC29;&amp;#xB41C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; IPC&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xC9C0;, Case &amp;#xBCC4;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;!&lt;/p&gt;
&lt;h2 id=&#34;0-Attack-Surface&#34;&gt;&lt;a href=&#34;#0-Attack-Surface&#34; class=&#34;headerlink&#34; title=&#34;0. Attack Surface&#34;&gt;&lt;/a&gt;0. Attack Surface&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0;, &amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Everyone &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; System &amp;#xC218;&amp;#xC900;&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xCCAB; &amp;#xAC78;&amp;#xC74C;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;! Part 1 &amp;#xB54C;&amp;#xC640; &amp;#xAC70;&amp;#xC758; &amp;#xC720;&amp;#xC0AC;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;! &lt;del&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xBCF4;&amp;#xC5EC;&amp;#xB4DC;&amp;#xB9AC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC778;&amp;#xC9C0;&amp;#xC0C1;&amp;#xC815;&lt;/del&gt; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xAC19;&amp;#xC774; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC124;&amp;#xCE58;&amp;#xD588;&amp;#xC744; &amp;#xB54C; Process Explorer&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; SASCore64.exe &amp;#xB77C;&amp;#xB294; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; Process&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;! &amp;#xAC70;&amp;#xAE30;&amp;#xB2E4; Handles &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; Named Pipe &amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83; &amp;#xAE4C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC70;&amp;#xAE30;&amp;#xB2E4; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xAD00;&amp;#xBB38;&amp;#xC778; ACL &amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xC8E0;..!! SysinternalsSuite&amp;#xC758; accesschk&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; Everyone RW &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;~ &amp;#xB530;&amp;#xB77C;&amp;#xC11C; medium user&amp;#xAC00; &amp;#xD2B9;&amp;#xBCC4;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xBBF8;&amp;#xACA0;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&amp;#xC790; &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xC81C; &amp;#xC9C1;&amp;#xC811; SASCore64.exe &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; IDA&amp;#xB85C; &amp;#xC5F4;&amp;#xC5B4;&amp;#xBCF8; &amp;#xB4A4;, Imports&amp;#xC5D0;&amp;#xC11C; Named Pipe &amp;#xAD00;&amp;#xB828; api&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;CreateNamedPipe api&amp;#xAC00; &amp;#xC788;&amp;#xB294; sub_140013F60 &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xAC00;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; CreateNamedPipeA &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; named pipe&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0;, Connect &amp;#xD558;&amp;#xB294; &amp;#xAC78; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xD575;&amp;#xC2EC;&amp;#xC740; Named Pipe&amp;#xC6A9; SECURITY_ATTRIBUTES &amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xB85C;&amp;#xCEEC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC644;&amp;#xC804; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;! StartAddress &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xAC00;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;StartAddress &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; 1&amp;#xAC1C;&amp;#xB2F9; Named Pipe &amp;#xC138;&amp;#xC158;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xC804;&amp;#xC6A9; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB85C;, sub_14000F7E0 &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xD574;&amp;#xC11D;&amp;#xD558;&amp;#xC5EC; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; sub_14000F7E0 &amp;#xB85C; &amp;#xAC00;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;v6&amp;#xC5D0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; input &amp;#xAC12;&amp;#xC744; &amp;#xB123;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; case&amp;#xB85C; &amp;#xB098;&amp;#xB258;&amp;#xC5B4;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC544;&amp;#xB798; 0x103A &amp;#xBD84;&amp;#xAE30;&amp;#xB97C; &amp;#xD1B5;&amp;#xD558;&amp;#xC5EC; Token&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xD68D;&amp;#xB4DD;&amp;#xD574;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x103A&lt;/span&gt;:
{
  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xC785;&amp;#xB825;/&amp;#xC2DC;&amp;#xAC04; &amp;#xAC80;&amp;#xC99D; &amp;#xBC0F; &amp;#xAE30;&amp;#xD0C0; &amp;#xBD80;&amp;#xC218; &amp;#xB85C;&amp;#xC9C1;)&lt;/span&gt;

  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (ImpersonateNamedPipeClient(a3))
  {
    &lt;span class=&#34;hljs-comment&#34;&gt;// ... (TLS&amp;#xC5D0; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC800;&amp;#xC7A5; &amp;#xB4F1;)&lt;/span&gt;

    HANDLE hProc = OpenProcess(PROCESS_ALL_ACCESS, FALSE, *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;));
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (hProc)
    {
      HANDLE hToken = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (OpenProcessToken(hProc, TOKEN_ALL_ACCESS, &amp;amp;hToken) &amp;amp;&amp;amp; hToken)
      {
        &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xB0B4;&amp;#xBD80; &amp;#xC138;&amp;#xC158;/&amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;)&lt;/span&gt;
        CloseHandle(hToken);
      }
      CloseHandle(hProc);
    }

    RevertToSelf();
    FileSize = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;; &lt;span class=&#34;hljs-comment&#34;&gt;// session established&lt;/span&gt;
  }

  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xC751;&amp;#xB2F5; &amp;#xAD6C;&amp;#xC131;)&lt;/span&gt;
  WriteFile(a3, Buffer, &lt;span class=&#34;hljs-number&#34;&gt;0x10018&lt;/span&gt;u, &amp;amp;written, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;ImpersonateNamedPipeClient, OpenProcessToken(&amp;#x2026;Pid&amp;#x2026;) &amp;#xC131;&amp;#xACF5; &amp;#xC2DC; &amp;#xB0B4;&amp;#xBD80; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;(a1 + 0x68)&amp;#xC5D0; &amp;#xC0C8; &lt;strong&gt;&amp;#xB178;&amp;#xB4DC; + &amp;#xD1A0;&amp;#xD070;&lt;/strong&gt; &amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC751;&amp;#xB2F5; 0x10018 &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xC911; &amp;#xC624;&amp;#xD504;&amp;#xC14B; 0x04 &amp;#xC5D0; &amp;#xD1A0;&amp;#xD070; &amp;#xAC12;&amp;#xC744; &amp;#xB3CC;&amp;#xB824;&amp;#xC8FC;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774; Token&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xC5BB;&amp;#xC740; &amp;#xD6C4;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xC81C;&amp;#xAC00; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB9B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBCA1;&amp;#xD130;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;1-File-&amp;#xAD00;&amp;#xB828;-API&amp;#xB97C;-&amp;#xD65C;&amp;#xC6A9;&amp;#xD55C;-LPE&#34;&gt;&lt;a href=&#34;#1-File-&amp;#xAD00;&amp;#xB828;-API&amp;#xB97C;-&amp;#xD65C;&amp;#xC6A9;&amp;#xD55C;-LPE&#34; class=&#34;headerlink&#34; title=&#34;1. File &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; LPE&#34;&gt;&lt;/a&gt;1. File &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; LPE&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; File &amp;#xAD00;&amp;#xB828; API&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xBA3C;&amp;#xC800; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;? Windows&amp;#xC5D0;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC;&amp;#xAC00;&amp;#xC9C0; API&amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0;, &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xAC74;&amp;#xB4E4;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9D0;&amp;#xC774;&amp;#xC8E0;.. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9CC;&amp;#xC57D; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;? &lt;/p&gt;
&lt;h3 id=&#34;1-1-CopyFileW&#34;&gt;&lt;a href=&#34;#1-1-CopyFileW&#34; class=&#34;headerlink&#34; title=&#34;1-1. CopyFileW()&#34;&gt;&lt;/a&gt;1-1. CopyFileW()&lt;/h3&gt;&lt;p&gt;MS&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CopyFileW()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74;, &amp;#xAE30;&amp;#xC874; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;BOOL &lt;span class=&#34;hljs-title&#34;&gt;CopyFileW&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in] LPCWSTR lpExistingFileName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in] LPCWSTR lpNewFileName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in] BOOL    bFailIfExists&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74;, System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFC0; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC774; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x100D&lt;/span&gt;:
{
  &lt;span class=&#34;hljs-comment&#34;&gt;// ...&lt;/span&gt;
  BOOL ok = CopyFileW(
      (LPCWSTR)(input + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;),       &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled: src&lt;/span&gt;
      (LPCWSTR)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x1048&lt;/span&gt;),  &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled: dst&lt;/span&gt;
      *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x2088&lt;/span&gt;)  &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled: bFailIfExists&lt;/span&gt;
  );

  DWORD err = GetLastError();
  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xC751;&amp;#xB2F5; Buffer&amp;#xC5D0; ok/err &amp;#xB2F4;&amp;#xC544;&amp;#xC11C; &amp;#xBC18;&amp;#xD658;)&lt;/span&gt;
  WriteFile(a3, Buffer, &lt;span class=&#34;hljs-number&#34;&gt;0x10018&lt;/span&gt;u, &amp;amp;written, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Token&amp;#xC744; &amp;#xC5BB;&amp;#xC740; &amp;#xB4A4; case 0x100D &amp;#xB85C; &amp;#xBD84;&amp;#xAE30;&amp;#xD558;&amp;#xBA74; input+8&amp;#xC5D0; Copy&amp;#xD560; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C;, &amp;#xB36E;&amp;#xC5B4; &amp;#xC4F8; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; input+0x1048 &amp;#xC5D0; &amp;#xB123;&amp;#xC5B4; API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xAC8C; &amp;#xC65C; LPE&amp;#xB0D0;&amp;#xAD6C;&amp;#xC694;..? &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xBC14;&amp;#xAFB8;&amp;#xAC70;&amp;#xB098; &amp;#xC0AD;&amp;#xC81C;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xC8E0;. &amp;#xAC70;&amp;#xAE30;&amp;#xB2E4;&amp;#xAC00; &amp;#xBA87; &amp;#xCD08;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74;? &amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; cmd&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC545;&amp;#xC131;&amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFBC;&amp;#xB2E4;&amp;#xBA74; &amp;#xB9D0;&amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xBA87; &amp;#xCD08;&amp;#xB9C8;&amp;#xB2E4; System &amp;#xAD8C;&amp;#xD55C; cmd&amp;#xAC00; &amp;#xCF1C;&amp;#xC9C0;&amp;#xACA0;&amp;#xC8E0;!! &amp;#xADF8;&amp;#xB7F0; &amp;#xC6D0;&amp;#xB9AC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F47D;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC9C1;&amp;#xC811; Process Monitor&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;? &amp;#xC774;&amp;#xAC74; Chrome updater &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC774;&amp;#xACE0;, &amp;#xBA87; &amp;#xCD08;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0;, &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xB192;&amp;#xC544; &amp;#xC77C;&amp;#xBC18; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC704; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFBC;&amp;#xB2E4;&amp;#xBA74;!?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; System cmd&amp;#xAC00; &amp;#xCF1C;&amp;#xC9C0;&amp;#xB294; &amp;#xAC78; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;! &amp;#x1F44F;&lt;/p&gt;
&lt;p&gt;&amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xD655;&amp;#xC2E4;&amp;#xD558;&amp;#xAC8C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Windbg&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; Process&amp;#xC5D0; Attach&amp;#xB97C; &amp;#xD55C; &amp;#xD6C4; lm &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; base &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD558;&amp;#xACE0;, IDA&amp;#xC5D0;&amp;#xC11C; base &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; CopyFileW() &amp;#xD568;&amp;#xC218; &amp;#xBD80;&amp;#xADFC;&amp;#xC5D0; bp&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; Dst &amp;#xC5D0;&amp;#xB294; &amp;#xC55E;&amp;#xC11C; &amp;#xB9D0;&amp;#xD55C; updater &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xC368;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; Src&amp;#xC5D0;&amp;#xB294; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD560; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC00;&amp;#xC9DC; updater.exe &amp;#xB294; System &amp;#xD1A0;&amp;#xD070;&amp;#xC73C;&amp;#xB85C; cmd&amp;#xB97C; &amp;#xCF1C;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C;&amp;#xC774;&amp;#xACE0;, &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xAC00; &amp;#xB418;&amp;#xBA74;&amp;#xC11C; LPE&amp;#xC5D0; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xAC83;&amp;#xC774;&amp;#xC8E0;!&lt;/p&gt;
&lt;h2 id=&#34;2-Registry-&amp;#xAD00;&amp;#xB828;-API&amp;#xB97C;-&amp;#xD65C;&amp;#xC6A9;&amp;#xD55C;-LPE&#34;&gt;&lt;a href=&#34;#2-Registry-&amp;#xAD00;&amp;#xB828;-API&amp;#xB97C;-&amp;#xD65C;&amp;#xC6A9;&amp;#xD55C;-LPE&#34; class=&#34;headerlink&#34; title=&#34;2. Registry &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; LPE&#34;&gt;&lt;/a&gt;2. Registry &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; LPE&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xC790;, &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; Registry &amp;#xAD00;&amp;#xB828; API&amp;#xB4E4;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;! &lt;/p&gt;
&lt;h3 id=&#34;2-1-SHSetValueW&#34;&gt;&lt;a href=&#34;#2-1-SHSetValueW&#34; class=&#34;headerlink&#34; title=&#34;2-1. SHSetValueW()&#34;&gt;&lt;/a&gt;2-1. SHSetValueW()&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;LSTATUS &lt;span class=&#34;hljs-title&#34;&gt;SHSetValueW&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           HKEY    hkey,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPCWSTR pszSubKey,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPCWSTR pszValue,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD   dwType,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPCVOID pvData,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD   cbData&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;SHSetValueW()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xC774; &amp;#xC778;&amp;#xC790; &amp;#xC138;&amp;#xD305;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; SubKey&amp;#xC640; ValueName &amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD574;&amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC8C; &amp;#xBB34;&amp;#xC2A8; &amp;#xB9D0;&amp;#xC774;&amp;#xB0D0;, &amp;#xC774; &amp;#xC778;&amp;#xC790;&amp;#xB4E4;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xC758; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xC758; Value &amp;#xAC12;&amp;#xC744; &amp;#xB9C8;&amp;#xC74C;&amp;#xB300;&amp;#xB85C; &amp;#xBC14;&amp;#xAFC0; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC774;&amp;#xACA0;&amp;#xC8E0;!! &amp;#xC9C1;&amp;#xC811; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x102C&lt;/span&gt;:
{
  &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *SubKey    = (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *)(input + &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;);    &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *ValueName = (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *)(input + &lt;span class=&#34;hljs-number&#34;&gt;4176&lt;/span&gt;);  &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  HKEY RootKey           = *(HKEY *)(input + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;);           &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  DWORD Type             = *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0xA094&lt;/span&gt;);     &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  LPCVOID Data           = (LPCVOID)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x2090&lt;/span&gt;);      &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  DWORD DataSize         = *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0xA090&lt;/span&gt;);     &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;

  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (RootKey == HKCR &amp;#xB798;&amp;#xD551; / HKCU TLS &amp;#xCE58;&amp;#xD658; / &amp;#xD14C;&amp;#xC774;&amp;#xBE14; &amp;#xD578;&amp;#xB4E4; &amp;#xB85C;&amp;#xC9C1; &amp;#xB4F1;)&lt;/span&gt;

  LSTATUS st = SHSetValueW(
      RootKey,
      SubKey,
      ValueName,
      Type,
      Data,
      DataSize
  );

  DWORD err = GetLastError();
  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xC751;&amp;#xB2F5; Buffer&amp;#xC5D0; st/err &amp;#xB2F4;&amp;#xC544;&amp;#xC11C; &amp;#xBC18;&amp;#xD658;)&lt;/span&gt;
  WriteFile(a3, Buffer, &lt;span class=&#34;hljs-number&#34;&gt;0x10018&lt;/span&gt;u, &amp;amp;written, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;case 0x102C &amp;#xBD84;&amp;#xAE30;&amp;#xB85C; &amp;#xAC00;&amp;#xBA74; &amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; SHSetValueW &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xAC12;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD574; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;offset +&lt;span class=&#34;hljs-number&#34;&gt;0x0008&lt;/span&gt; &amp;#x2192; &lt;span class=&#34;hljs-function&#34;&gt;HKEY &lt;span class=&#34;hljs-title&#34;&gt;Root&lt;/span&gt; &lt;span class=&#34;hljs-params&#34;&gt;(&amp;#xC608;: HKEY_LOCAL_MACHINE)&lt;/span&gt;&lt;/span&gt;
offset +0x0010 &amp;#x2192; SubKey
offset +&lt;span class=&#34;hljs-number&#34;&gt;0x1050&lt;/span&gt; &amp;#x2192; ValueName
offset +&lt;span class=&#34;hljs-number&#34;&gt;0xA068&lt;/span&gt; &amp;#x2192; Type (REG_SZ &amp;#xB4F1;)
offset +&lt;span class=&#34;hljs-number&#34;&gt;0x2090&lt;/span&gt; &amp;#x2192; Buffer (&amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xAC12;)
offset +&lt;span class=&#34;hljs-number&#34;&gt;0xA064&lt;/span&gt; &amp;#x2192; Buffer size&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC785;&amp;#xB825; &amp;#xAD6C;&amp;#xC870;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (RootKey == HKEY_CLASSES_ROOT)
{
  &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xB0B4;&amp;#xBD80; &amp;#xD074;&amp;#xB798;&amp;#xC2A4;&amp;#xB85C; &amp;#xB798;&amp;#xD551;&lt;/span&gt;
  CClassesRoot ctx;
  ctx.h1 = TlsGetValue(...);
  ctx.h2 = TlsGetValue(...);
  SHSetValueW(ctx.h1 &lt;span class=&#34;hljs-keyword&#34;&gt;or&lt;/span&gt; h2, SubKey, ValueName, Type, Data, Size);
}
&lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (RootKey &amp;amp; &lt;span class=&#34;hljs-number&#34;&gt;0x80000000&lt;/span&gt;)  &lt;span class=&#34;hljs-comment&#34;&gt;// e.g., HKEY_LOCAL_MACHINE, HKEY_USERS &amp;#xB4F1;&lt;/span&gt;
{
  keyctx = get_handle_from_table(RootKey);
  SHSetValueW(keyctx, SubKey, ValueName, Type, Data, Size);
}
&lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
{
  &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xC77C;&amp;#xBC18; HKEY_CURRENT_USER &amp;#xC77C; &amp;#xACBD;&amp;#xC6B0; TLS &amp;#xAE30;&amp;#xBC18; &amp;#xD0A4;&amp;#xB85C; &amp;#xCE58;&amp;#xD658;&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (RootKey == HKEY_CURRENT_USER)
    RootKey = TlsGetValue(...);

  SHSetValueW(RootKey, SubKey, ValueName, Type, Data, Size);
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD575;&amp;#xC2EC; &amp;#xCDE8;&amp;#xC57D; &amp;#xB85C;&amp;#xC9C1;&amp;#xC740; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC740;&amp;#xB370;, &amp;#xACB0;&amp;#xAD6D; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xD55C; &amp;#xC784;&amp;#xC758; HKEY + SubKey + Value + Data&amp;#xAC00; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; SHSetValueW &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB3C4; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; Registry&amp;#xC5D0; ImagePath&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC73C;&amp;#xB85C; MicrosoftEdgeElevationService &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC120;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Process Monitor &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;, Edge&amp;#xB97C; &amp;#xCF30;&amp;#xC744; &amp;#xB54C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; Load &amp;#xB418;&amp;#xB294;&amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xD6C4; &amp;#xC774; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB290; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294;&amp;#xC9C0;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC640; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD3B8;&amp;#xC9D1;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image17.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image18.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; MicroSoftEdgeElevationService &amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, ImagePath &amp;#xAC00; &amp;#x201C;C:\Program Files (x86)\Microsoft\Edge\Application\138.0.3351.77\elevation_service.exe&amp;#x201D; &amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xD55C; &amp;#xB4A4; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image19.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image20.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; Path&amp;#xC640; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xC758; ImagePath&amp;#xAC00; &amp;#xBC14;&amp;#xB010; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!! &amp;#xC774;&amp;#xC81C; MicrosoftEdge&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xBA74; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; cmd&amp;#xAC00; &amp;#xCF1C;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC548; &amp;#xD574;&amp;#xBCFC; &amp;#xC218; &amp;#xC5C6;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image21.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image22.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Value &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; ImagePath &amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC04; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image23.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;SubKey &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9D0;&amp;#xD55C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC04; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image24.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; key&amp;#xB294; HKEY_LOCAL_MACHINE &amp;#xB97C; &amp;#xC758;&amp;#xBBF8;&amp;#xD558;&amp;#xB294; 0x80000002 &amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC04; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC81C;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB192;&amp;#xC740; &amp;#xACBD;&amp;#xB85C;&amp;#xC758; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; Image Path&amp;#xB97C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFC0; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;!&lt;/p&gt;
&lt;h2 id=&#34;3-Service-&amp;#xAD00;&amp;#xB828;-API&amp;#xB97C;-&amp;#xD65C;&amp;#xC6A9;&amp;#xD55C;-LPE&#34;&gt;&lt;a href=&#34;#3-Service-&amp;#xAD00;&amp;#xB828;-API&amp;#xB97C;-&amp;#xD65C;&amp;#xC6A9;&amp;#xD55C;-LPE&#34; class=&#34;headerlink&#34; title=&#34;3. Service &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; LPE&#34;&gt;&lt;/a&gt;3. Service &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; LPE&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; Service &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;! &amp;#xC774;&amp;#xBC88;&amp;#xC5D4; 3&amp;#xAC00;&amp;#xC9C0;&amp;#xC758; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; LPE&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2EC;&amp;#xC131; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;h3 id=&#34;3-1-OpenSCManagerW&#34;&gt;&lt;a href=&#34;#3-1-OpenSCManagerW&#34; class=&#34;headerlink&#34; title=&#34;3.1 OpenSCManagerW()&#34;&gt;&lt;/a&gt;3.1 OpenSCManagerW()&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;SC_HANDLE &lt;span class=&#34;hljs-title&#34;&gt;OpenSCManagerW&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPCWSTR lpMachineName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPCWSTR lpDatabaseName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD   dwDesiredAccess&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &lt;code&gt;OpenSCManagerW()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB4A4;&amp;#xC5D0; &amp;#xB098;&amp;#xC62C; CreateService&amp;#xB098; StartService&amp;#xB294; &amp;#xB418;&amp;#xAC8C; &amp;#xC9C1;&amp;#xAD00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBB34;&amp;#xC2A8; &amp;#xAE30;&amp;#xB2A5;&amp;#xC778;&amp;#xC9C0; &amp;#xC54C; &amp;#xAC83; &amp;#xAC19;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774; &lt;code&gt;OpenSCManagerW()&lt;/code&gt; API&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xC57C;&amp;#xB9CC; &amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#x2018;SCM &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#x2019;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB418;&amp;#xB294; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB77C;&amp;#xC11C;, &amp;#xADF8; DB&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD578;&amp;#xB4E4;(&amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;)&amp;#xC774; &amp;#xBA3C;&amp;#xC800; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xC774;&amp;#xD6C4; &amp;#xC791;&amp;#xC5C5;(&amp;#xC0DD;&amp;#xC131;/&amp;#xC218;&amp;#xC815;/&amp;#xC2DC;&amp;#xC791;)&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC5F4;&amp;#xACE0; &amp;#xBC18;&amp;#xD658;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xC774; API&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x103B&lt;/span&gt;:
{
  &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *Machine  = (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *)(input + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;);      &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled (optional)&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *Database = (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x1048&lt;/span&gt;); &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled (optional)&lt;/span&gt;
  DWORD Access          = *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x2088&lt;/span&gt;);      &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;

  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (empty string -&amp;gt; NULL &amp;#xCC98;&amp;#xB9AC; &amp;#xB4F1;)&lt;/span&gt;

  SC_HANDLE hScm = OpenSCManagerW(Machine, Database, Access);

  DWORD err = GetLastError();
  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xC751;&amp;#xB2F5;&amp;#xC5D0; hScm/err &amp;#xBC18;&amp;#xD658;)&lt;/span&gt;
  WriteFile(a3, Buffer, &lt;span class=&#34;hljs-number&#34;&gt;0x10018&lt;/span&gt;u, &amp;amp;written, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;case 0x103B &amp;#xBD84;&amp;#xAE30;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;,&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;input + 8 &amp;#x2192; lpMachineName&lt;/li&gt;
&lt;li&gt;input + 0x1048 &amp;#x2192; lpDatabaseName&lt;/li&gt;
&lt;li&gt;input + 0x2088 &amp;#x2192; dwDesiredAccess&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xAC83;&amp;#xC740; dwDesiredAccess &amp;#xB85C;, SC_MANAGER_ALL_ACCESS(0xF003F) &amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD574;&amp;#xC918;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294;&amp;#xAC83;!&lt;/p&gt;
&lt;h3 id=&#34;3-2-CreateServiceW&#34;&gt;&lt;a href=&#34;#3-2-CreateServiceW&#34; class=&#34;headerlink&#34; title=&#34;3.2 CreateServiceW()&#34;&gt;&lt;/a&gt;3.2 &lt;strong&gt;CreateServiceW()&lt;/strong&gt;&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;SC_HANDLE &lt;span class=&#34;hljs-title&#34;&gt;CreateServiceW&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]            SC_HANDLE hSCManager,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]            LPCWSTR   lpServiceName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]  LPCWSTR   lpDisplayName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]            DWORD     dwDesiredAccess,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]            DWORD     dwServiceType,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]            DWORD     dwStartType,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]            DWORD     dwErrorControl,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]  LPCWSTR   lpBinaryPathName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]  LPCWSTR   lpLoadOrderGroup,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [out, optional] LPDWORD   lpdwTagId,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]  LPCWSTR   lpDependencies,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]  LPCWSTR   lpServiceStartName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]  LPCWSTR   lpPassword&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xD578;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC5BB;&amp;#xC5C8;&amp;#xC73C;&amp;#xB2C8;, Service&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x103F&lt;/span&gt;:
{
  SC_HANDLE hScm = *(SC_HANDLE *)(input + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;);

  &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *SvcName    = (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *)(input + &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;);     &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *DispName   = (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *)(input + &lt;span class=&#34;hljs-number&#34;&gt;4176&lt;/span&gt;);   &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *BinPath    = (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *)(input + &lt;span class=&#34;hljs-number&#34;&gt;8352&lt;/span&gt;);   &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;

  DWORD DesiredAccess     = *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x2090&lt;/span&gt;);      &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  DWORD ServiceType       = *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x2094&lt;/span&gt;);      &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  DWORD StartType         = *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x2098&lt;/span&gt;);      &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  DWORD ErrorControl      = *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x209C&lt;/span&gt;);      &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;

  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (Group/Deps/StartName/Password &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xC815;&amp;#xB9AC; &amp;#xBC0F; NULL &amp;#xCC98;&amp;#xB9AC;)&lt;/span&gt;

  SC_HANDLE hSvc = CreateServiceW(
      hScm,
      SvcName,
      DispName,
      DesiredAccess,
      ServiceType,
      StartType,
      ErrorControl,
      BinPath,
      &lt;span class=&#34;hljs-comment&#34;&gt;/* ... */&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
  );

  DWORD err = GetLastError();
  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xC751;&amp;#xB2F5;&amp;#xC5D0; hSvc/err &amp;#xBC18;&amp;#xD658;)&lt;/span&gt;
  WriteFile(a3, Buffer, &lt;span class=&#34;hljs-number&#34;&gt;0x10018&lt;/span&gt;u, &amp;amp;written, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;case 0x103F &amp;#xBD84;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; CreateServiceW() &amp;#xB85C; &amp;#xC9C1;&amp;#xC811; &amp;#xC784;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;input + 0x08 &amp;#x2192; &lt;code&gt;hSCManager&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;SC_HANDLE&lt;/code&gt; (&amp;#xC774;&amp;#xC804; &lt;code&gt;0x103B&lt;/code&gt; &amp;#xD638;&amp;#xCD9C;&amp;#xB85C; &amp;#xC5BB;&amp;#xC740; SCM &amp;#xD578;&amp;#xB4E4;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x10 &amp;#x2192; &lt;code&gt;lpServiceName&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;LPCWSTR&lt;/code&gt; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xB0B4;&amp;#xBD80; &amp;#xC774;&amp;#xB984; (&amp;#xC608;: L&amp;#x201D;LPE&amp;#x201D;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x1050 &amp;#x2192; &lt;code&gt;lpDisplayName&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;LPCWSTR&lt;/code&gt; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBCF4;&amp;#xC77C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC774;&amp;#xB984; (&amp;#xC608;: L&amp;#x201D;My Payload Service&amp;#x201D;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x2090 &amp;#x2192; &lt;code&gt;dwDesiredAccess&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;DWORD&lt;/code&gt; &amp;#xC811;&amp;#xADFC;&amp;#xAD8C;&amp;#xD55C; &amp;#xD50C;&amp;#xB798;&amp;#xADF8; (&amp;#xC608;: &lt;code&gt;SERVICE_ALL_ACCESS&lt;/code&gt; = 0xF01FF)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x2094 &amp;#x2192; &lt;code&gt;dwServiceType&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;DWORD&lt;/code&gt; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD0C0;&amp;#xC785; (&amp;#xC608;: &lt;code&gt;SERVICE_WIN32_OWN_PROCESS&lt;/code&gt; = 0x10)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x2098 &amp;#x2192; &lt;code&gt;dwStartType&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;DWORD&lt;/code&gt; &amp;#xC2DC;&amp;#xC791; &amp;#xC720;&amp;#xD615; (&amp;#xC608;: &lt;code&gt;SERVICE_DEMAND_START&lt;/code&gt; = 0x3)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x209C &amp;#x2192; &lt;code&gt;dwErrorControl&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;DWORD&lt;/code&gt; &amp;#xC624;&amp;#xB958; &amp;#xC81C;&amp;#xC5B4; (&amp;#xC608;: &lt;code&gt;SERVICE_ERROR_NORMAL&lt;/code&gt; = 0x1)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x20A0 &amp;#x2192; &lt;code&gt;lpBinaryPathName&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;LPCWSTR&lt;/code&gt; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C; (&amp;#xC608;: L&amp;#x201D;C:\Temp\poc.exe&amp;#x201D;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x30E0 &amp;#x2192; &lt;code&gt;lpLoadOrderGroup&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;LPCWSTR&lt;/code&gt; &amp;#xB85C;&amp;#xB4DC; &amp;#xC21C;&amp;#xC11C; &amp;#xADF8;&amp;#xB8F9; (&amp;#xC608;: L&amp;#x201D;Base&amp;#x201D;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x4120 &amp;#x2192; &lt;code&gt;lpDependencies&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;LPCWSTR&lt;/code&gt; &amp;#xC758;&amp;#xC874; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x5160 &amp;#x2192; &lt;code&gt;lpServiceStartName&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;LPCWSTR&lt;/code&gt; &amp;#xB85C;&amp;#xADF8;&amp;#xC628; &amp;#xACC4;&amp;#xC815; (&amp;#xC608;: L&amp;#x201D;NT AUTHORITY\System&amp;#x201D;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x61A0 &amp;#x2192; &lt;code&gt;lpPassword&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;LPCWSTR&lt;/code&gt; &amp;#xD574;&amp;#xB2F9; &amp;#xACC4;&amp;#xC815; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638; (&amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; NULL)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC0DD;&amp;#xC131;&amp;#xB9CC; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC11C; &amp;#xC644;&amp;#xBCBD;&amp;#xD55C; LPE&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xC21C; &amp;#xC5C6;&amp;#xACA0;&amp;#xC8E0;? &amp;#xC774;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; API &amp;#xB610;&amp;#xD55C; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;3-3-StartServiceW&#34;&gt;&lt;a href=&#34;#3-3-StartServiceW&#34; class=&#34;headerlink&#34; title=&#34;3.3 StartServiceW()&#34;&gt;&lt;/a&gt;3.3 &lt;strong&gt;StartServiceW()&lt;/strong&gt;&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;BOOL &lt;span class=&#34;hljs-title&#34;&gt;StartServiceW&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           SC_HANDLE hService,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD     dwNumServiceArgs,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPCWSTR   *lpServiceArgVectors&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x1040&lt;/span&gt;:
{
  SC_HANDLE hSvc = *(SC_HANDLE *)(input + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;);  &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled (handle from prior call)&lt;/span&gt;

  BOOL ok = StartServiceW(hSvc, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;);

  DWORD err = GetLastError();
  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xC751;&amp;#xB2F5; Buffer&amp;#xC5D0; ok/err &amp;#xB2F4;&amp;#xC544;&amp;#xC11C; &amp;#xBC18;&amp;#xD658;)&lt;/span&gt;
  WriteFile(a3, Buffer, &lt;span class=&#34;hljs-number&#34;&gt;0x10018&lt;/span&gt;u, &amp;amp;written, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; Start &amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; case 0x1040 &amp;#xBD84;&amp;#xAE30;&amp;#xB85C; StartServiceW() &amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;input + 8 &amp;#x2192; &lt;code&gt;hService&lt;/code&gt; (&lt;code&gt;SC_HANDLE&lt;/code&gt;)&lt;/li&gt;
&lt;li&gt;dwNumServiceArgs &amp;#x2192; &lt;code&gt;0&lt;/code&gt; (&amp;#xACE0;&amp;#xC815;)&lt;/li&gt;
&lt;li&gt;lpServiceArgVectors &amp;#x2192; &lt;code&gt;NULL&lt;/code&gt; (&amp;#xACE0;&amp;#xC815;)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; CreateServiceW() &amp;#xC758; &amp;#xBC18;&amp;#xD658; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1B;&amp;#xC740; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; input + 8&amp;#xC5D0; &amp;#xB123;&amp;#xC5B4; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC5D4; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC73C;&amp;#xB85C; &amp;#xBA3C;&amp;#xC800; &amp;#xD55C; &amp;#xB2E8;&amp;#xACC4; &amp;#xD55C; &amp;#xB2E8;&amp;#xACC4; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image25.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; OpenSCManagerW() &amp;#xD568;&amp;#xC218; &amp;#xBD80;&amp;#xADFC;&amp;#xC5D0; bp&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image26.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;dwDesiredAccess &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC9D1;&amp;#xC5B4;&amp;#xB123;&amp;#xC740; SC_MANAGER_ALL_ACCESS(0xf003f) &amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC04; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image27.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &amp;#xCD9C;&amp;#xB825; &amp;#xD654;&amp;#xBA74;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; hSCM &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xBC1B;&amp;#xC544;&amp;#xC624;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image28.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; CreateServiceW() &amp;#xBD80;&amp;#xADFC;&amp;#xC5D0; bp&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image29.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;lpServiceStartName &amp;#xC5D0;&amp;#xB294; System &amp;#xC744; &amp;#xC801;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image30.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; lpBinaryPathName &amp;#xC5D0; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xD654; &amp;#xC2DC;&amp;#xD0AC; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xC368;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image31.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &amp;#xCD9C;&amp;#xB825; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xC774; &amp;#xB418;&amp;#xACE0;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD578;&amp;#xB4E4; &amp;#xAC12;&amp;#xB3C4; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC62C; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC78; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image32.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image33.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; LPE &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC0DD;&amp;#xACBC;&amp;#xACE0;, &amp;#xACBD;&amp;#xB85C;&amp;#xB3C4; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; StartServiceW() &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589;&amp;#xB9CC; &amp;#xC2DC;&amp;#xD0A8;&amp;#xB2E4;&amp;#xBA74;? System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC545;&amp;#xC131; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACA0;&amp;#xC8E0;!!&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image34.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; Part 2&amp;#xC758; Named Pipe &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC5EC;&amp;#xB7EC; LPE &amp;#xBCA1;&amp;#xD130;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC124;&amp;#xBA85;&amp;#xC774; &amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xC5D0;&amp;#xAC8C; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC168;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xB294;&amp;#xB370;&amp;#xC694;!! Named Pipe&amp;#xC758; &amp;#xAD8C;&amp;#xD55C; &amp;#xC124;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; medium &amp;#xC720;&amp;#xC800;&amp;#xAC00; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;! &amp;#xC4F0;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8; &amp;#xB108;&amp;#xBB34; &amp;#xACE0;&amp;#xBD09;&amp;#xBC25;&amp;#xCC98;&amp;#xB7FC; &amp;#xC4F4; &amp;#xAC83; &amp;#xAC19;&amp;#xC544; &amp;#xBD84;&amp;#xB7C9; &amp;#xC870;&amp;#xC808;&amp;#xC5D0; &amp;#xC2E4;&amp;#x2026;&amp;#xD328; &amp;#xD55C; &amp;#xAC83; &amp;#xAC19;&amp;#xC9C0;&amp;#xB9CC;!! &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC774;&amp;#xB7F0; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C;&amp;#xB3C4; LPE&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAD6C;&amp;#xB098;!! &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBD10;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xAC10;&amp;#xC0AC;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F609; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; Windows LPE&amp;#xC758; &amp;#xAF43;&amp;#xC774;&amp;#xC790; Kernel Driver&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;~ &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-openscmanagerw&#34;&gt;https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-openscmanagerw&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows/win32/services/service-security-and-access-rights&#34;&gt;https://learn.microsoft.com/ko-kr/windows/win32/services/service-security-and-access-rights&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-createservicew&#34;&gt;https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-createservicew&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-startservicew&#34;&gt;https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-startservicew&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows/win32/api/shlwapi/nf-shlwapi-shsetvaluew&#34;&gt;https://learn.microsoft.com/ko-kr/windows/win32/api/shlwapi/nf-shlwapi-shsetvaluew&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows/win32/api/winbase/nf-winbase-copyfilew&#34;&gt;https://learn.microsoft.com/ko-kr/windows/win32/api/winbase/nf-winbase-copyfilew&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research]    Windows LPE   Part 2 (KR) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/logo_window.png&#34; alt&gt;&lt;/p&gt;
&lt;h2 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB4E4; &amp;#xC0C8;&amp;#xD574; &amp;#xC798; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC168;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;! &amp;#xC800;&amp;#xC758; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC774;&amp;#xC790; &amp;#xB9C9;&amp;#xB0B4;&amp;#xC988;&amp;#xC758; Part 2 &amp;#xAE00;&amp;#xC744; &amp;#xB9E1;&amp;#xAC8C; &amp;#xB41C; gongjae &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F600; &amp;#xC55E;&amp;#xC11C; banda&amp;#xB2D8;&amp;#xC774; &lt;a href=&#34;https://hackyboiz.github.io/2025/12/28/banda/WHS3-bughunting/ko/&#34;&gt;Part 1&lt;/a&gt;&amp;#xC744; &amp;#xC57C;&amp;#xBB34;&amp;#xC9C0;&amp;#xAC8C; &amp;#xC368;&amp;#xC8FC;&amp;#xC2E0; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; &amp;#xC81C;&amp;#xAC00; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xAC8C; &amp;#xB0A8;&amp;#xC544;&amp;#xC788;&amp;#xC744;&amp;#xAE4C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC9C1;&amp;#xC811; &amp;#xCC3E;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC124;&amp;#xBA85;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC5D0; &amp;#xAD00;&amp;#xC2EC; &amp;#xC788;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC870;&amp;#xAE08;&amp;#xC774;&amp;#xB098;&amp;#xB9C8; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xACE0; &amp;#xC2F6;&amp;#xB124;&amp;#xC694;..&amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xC81C;&amp;#xAC00; Part 2&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xCC3E;&amp;#xC740; Named Pipe&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; LPE &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA70; &amp;#x2018;&amp;#xC774;&amp;#xB7F0; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C;&amp;#xB3C4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAD6C;&amp;#xB098;&amp;#x2019;&amp;#xB97C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xC790;, &amp;#xC6B0;&amp;#xC120; &amp;#xC81C;&amp;#xAC00; &amp;#xCC3E;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC548;&amp;#xD2F0;&amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; Named Pipe &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778;&amp;#xB370;&amp;#xC694;, &amp;#xD604;&amp;#xC7AC;&amp;#xB294; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xC0C1;&amp;#xD669;&amp;#xC774;&amp;#xACE0; ZDI&amp;#xC5D0; &amp;#xC81C;&amp;#xBCF4;&amp;#xD558;&amp;#xC5EC; CVE&amp;#xAE4C;&amp;#xC9C0; &amp;#xBC1C;&amp;#xAE09;&amp;#xC774; &amp;#xB41C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xC624;&amp;#xB298; &amp;#xC81C;&amp;#xAC00; &amp;#xBCF4;&amp;#xC5EC;&amp;#xB4DC;&amp;#xB9B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; File &amp;#xAD00;&amp;#xB828;, Registry &amp;#xAD00;&amp;#xB828;, Service &amp;#xAD00;&amp;#xB828;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xB258;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;! Named Pipe&amp;#xB97C; &amp;#xACFC;&amp;#xB3C4;&amp;#xD558;&amp;#xAC8C; &amp;#xAC1C;&amp;#xBC29;&amp;#xB41C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; IPC&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xC9C0;, Case &amp;#xBCC4;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;!&lt;/p&gt;
&lt;h2 id=&#34;0-Attack-Surface&#34;&gt;&lt;a href=&#34;#0-Attack-Surface&#34; class=&#34;headerlink&#34; title=&#34;0. Attack Surface&#34;&gt;&lt;/a&gt;0. Attack Surface&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0;, &amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Everyone &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; System &amp;#xC218;&amp;#xC900;&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xCCAB; &amp;#xAC78;&amp;#xC74C;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;! Part 1 &amp;#xB54C;&amp;#xC640; &amp;#xAC70;&amp;#xC758; &amp;#xC720;&amp;#xC0AC;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;! &lt;del&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xBCF4;&amp;#xC5EC;&amp;#xB4DC;&amp;#xB9AC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC778;&amp;#xC9C0;&amp;#xC0C1;&amp;#xC815;&lt;/del&gt; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xAC19;&amp;#xC774; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC124;&amp;#xCE58;&amp;#xD588;&amp;#xC744; &amp;#xB54C; Process Explorer&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; SASCore64.exe &amp;#xB77C;&amp;#xB294; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; Process&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;! &amp;#xAC70;&amp;#xAE30;&amp;#xB2E4; Handles &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; Named Pipe &amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83; &amp;#xAE4C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC70;&amp;#xAE30;&amp;#xB2E4; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xAD00;&amp;#xBB38;&amp;#xC778; ACL &amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xC8E0;..!! SysinternalsSuite&amp;#xC758; accesschk&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; Everyone RW &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;~ &amp;#xB530;&amp;#xB77C;&amp;#xC11C; medium user&amp;#xAC00; &amp;#xD2B9;&amp;#xBCC4;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xBBF8;&amp;#xACA0;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&amp;#xC790; &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xC81C; &amp;#xC9C1;&amp;#xC811; SASCore64.exe &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; IDA&amp;#xB85C; &amp;#xC5F4;&amp;#xC5B4;&amp;#xBCF8; &amp;#xB4A4;, Imports&amp;#xC5D0;&amp;#xC11C; Named Pipe &amp;#xAD00;&amp;#xB828; api&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;CreateNamedPipe api&amp;#xAC00; &amp;#xC788;&amp;#xB294; sub_140013F60 &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xAC00;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; CreateNamedPipeA &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; named pipe&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0;, Connect &amp;#xD558;&amp;#xB294; &amp;#xAC78; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xD575;&amp;#xC2EC;&amp;#xC740; Named Pipe&amp;#xC6A9; SECURITY_ATTRIBUTES &amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xB85C;&amp;#xCEEC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC644;&amp;#xC804; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;! StartAddress &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xAC00;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;StartAddress &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; 1&amp;#xAC1C;&amp;#xB2F9; Named Pipe &amp;#xC138;&amp;#xC158;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xC804;&amp;#xC6A9; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB85C;, sub_14000F7E0 &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xD574;&amp;#xC11D;&amp;#xD558;&amp;#xC5EC; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; sub_14000F7E0 &amp;#xB85C; &amp;#xAC00;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;v6&amp;#xC5D0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; input &amp;#xAC12;&amp;#xC744; &amp;#xB123;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; case&amp;#xB85C; &amp;#xB098;&amp;#xB258;&amp;#xC5B4;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC544;&amp;#xB798; 0x103A &amp;#xBD84;&amp;#xAE30;&amp;#xB97C; &amp;#xD1B5;&amp;#xD558;&amp;#xC5EC; Token&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xD68D;&amp;#xB4DD;&amp;#xD574;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x103A&lt;/span&gt;:
{
  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xC785;&amp;#xB825;/&amp;#xC2DC;&amp;#xAC04; &amp;#xAC80;&amp;#xC99D; &amp;#xBC0F; &amp;#xAE30;&amp;#xD0C0; &amp;#xBD80;&amp;#xC218; &amp;#xB85C;&amp;#xC9C1;)&lt;/span&gt;

  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (ImpersonateNamedPipeClient(a3))
  {
    &lt;span class=&#34;hljs-comment&#34;&gt;// ... (TLS&amp;#xC5D0; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC800;&amp;#xC7A5; &amp;#xB4F1;)&lt;/span&gt;

    HANDLE hProc = OpenProcess(PROCESS_ALL_ACCESS, FALSE, *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;));
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (hProc)
    {
      HANDLE hToken = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (OpenProcessToken(hProc, TOKEN_ALL_ACCESS, &amp;amp;hToken) &amp;amp;&amp;amp; hToken)
      {
        &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xB0B4;&amp;#xBD80; &amp;#xC138;&amp;#xC158;/&amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;)&lt;/span&gt;
        CloseHandle(hToken);
      }
      CloseHandle(hProc);
    }

    RevertToSelf();
    FileSize = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;; &lt;span class=&#34;hljs-comment&#34;&gt;// session established&lt;/span&gt;
  }

  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xC751;&amp;#xB2F5; &amp;#xAD6C;&amp;#xC131;)&lt;/span&gt;
  WriteFile(a3, Buffer, &lt;span class=&#34;hljs-number&#34;&gt;0x10018&lt;/span&gt;u, &amp;amp;written, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;ImpersonateNamedPipeClient, OpenProcessToken(&amp;#x2026;Pid&amp;#x2026;) &amp;#xC131;&amp;#xACF5; &amp;#xC2DC; &amp;#xB0B4;&amp;#xBD80; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;(a1 + 0x68)&amp;#xC5D0; &amp;#xC0C8; &lt;strong&gt;&amp;#xB178;&amp;#xB4DC; + &amp;#xD1A0;&amp;#xD070;&lt;/strong&gt; &amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC751;&amp;#xB2F5; 0x10018 &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xC911; &amp;#xC624;&amp;#xD504;&amp;#xC14B; 0x04 &amp;#xC5D0; &amp;#xD1A0;&amp;#xD070; &amp;#xAC12;&amp;#xC744; &amp;#xB3CC;&amp;#xB824;&amp;#xC8FC;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774; Token&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xC5BB;&amp;#xC740; &amp;#xD6C4;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xC81C;&amp;#xAC00; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB9B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBCA1;&amp;#xD130;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;1-File-&amp;#xAD00;&amp;#xB828;-API&amp;#xB97C;-&amp;#xD65C;&amp;#xC6A9;&amp;#xD55C;-LPE&#34;&gt;&lt;a href=&#34;#1-File-&amp;#xAD00;&amp;#xB828;-API&amp;#xB97C;-&amp;#xD65C;&amp;#xC6A9;&amp;#xD55C;-LPE&#34; class=&#34;headerlink&#34; title=&#34;1. File &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; LPE&#34;&gt;&lt;/a&gt;1. File &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; LPE&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; File &amp;#xAD00;&amp;#xB828; API&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xBA3C;&amp;#xC800; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;? Windows&amp;#xC5D0;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC;&amp;#xAC00;&amp;#xC9C0; API&amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0;, &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xAC74;&amp;#xB4E4;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9D0;&amp;#xC774;&amp;#xC8E0;.. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9CC;&amp;#xC57D; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;? &lt;/p&gt;
&lt;h3 id=&#34;1-1-CopyFileW&#34;&gt;&lt;a href=&#34;#1-1-CopyFileW&#34; class=&#34;headerlink&#34; title=&#34;1-1. CopyFileW()&#34;&gt;&lt;/a&gt;1-1. CopyFileW()&lt;/h3&gt;&lt;p&gt;MS&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CopyFileW()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74;, &amp;#xAE30;&amp;#xC874; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;BOOL &lt;span class=&#34;hljs-title&#34;&gt;CopyFileW&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in] LPCWSTR lpExistingFileName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in] LPCWSTR lpNewFileName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in] BOOL    bFailIfExists&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74;, System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFC0; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC774; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x100D&lt;/span&gt;:
{
  &lt;span class=&#34;hljs-comment&#34;&gt;// ...&lt;/span&gt;
  BOOL ok = CopyFileW(
      (LPCWSTR)(input + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;),       &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled: src&lt;/span&gt;
      (LPCWSTR)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x1048&lt;/span&gt;),  &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled: dst&lt;/span&gt;
      *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x2088&lt;/span&gt;)  &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled: bFailIfExists&lt;/span&gt;
  );

  DWORD err = GetLastError();
  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xC751;&amp;#xB2F5; Buffer&amp;#xC5D0; ok/err &amp;#xB2F4;&amp;#xC544;&amp;#xC11C; &amp;#xBC18;&amp;#xD658;)&lt;/span&gt;
  WriteFile(a3, Buffer, &lt;span class=&#34;hljs-number&#34;&gt;0x10018&lt;/span&gt;u, &amp;amp;written, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Token&amp;#xC744; &amp;#xC5BB;&amp;#xC740; &amp;#xB4A4; case 0x100D &amp;#xB85C; &amp;#xBD84;&amp;#xAE30;&amp;#xD558;&amp;#xBA74; input+8&amp;#xC5D0; Copy&amp;#xD560; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C;, &amp;#xB36E;&amp;#xC5B4; &amp;#xC4F8; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; input+0x1048 &amp;#xC5D0; &amp;#xB123;&amp;#xC5B4; API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xAC8C; &amp;#xC65C; LPE&amp;#xB0D0;&amp;#xAD6C;&amp;#xC694;..? &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xBC14;&amp;#xAFB8;&amp;#xAC70;&amp;#xB098; &amp;#xC0AD;&amp;#xC81C;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xC8E0;. &amp;#xAC70;&amp;#xAE30;&amp;#xB2E4;&amp;#xAC00; &amp;#xBA87; &amp;#xCD08;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74;? &amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; cmd&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC545;&amp;#xC131;&amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFBC;&amp;#xB2E4;&amp;#xBA74; &amp;#xB9D0;&amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xBA87; &amp;#xCD08;&amp;#xB9C8;&amp;#xB2E4; System &amp;#xAD8C;&amp;#xD55C; cmd&amp;#xAC00; &amp;#xCF1C;&amp;#xC9C0;&amp;#xACA0;&amp;#xC8E0;!! &amp;#xADF8;&amp;#xB7F0; &amp;#xC6D0;&amp;#xB9AC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F47D;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC9C1;&amp;#xC811; Process Monitor&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;? &amp;#xC774;&amp;#xAC74; Chrome updater &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC774;&amp;#xACE0;, &amp;#xBA87; &amp;#xCD08;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0;, &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xB192;&amp;#xC544; &amp;#xC77C;&amp;#xBC18; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC704; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFBC;&amp;#xB2E4;&amp;#xBA74;!?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; System cmd&amp;#xAC00; &amp;#xCF1C;&amp;#xC9C0;&amp;#xB294; &amp;#xAC78; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;! &amp;#x1F44F;&lt;/p&gt;
&lt;p&gt;&amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xD655;&amp;#xC2E4;&amp;#xD558;&amp;#xAC8C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Windbg&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; Process&amp;#xC5D0; Attach&amp;#xB97C; &amp;#xD55C; &amp;#xD6C4; lm &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; base &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD558;&amp;#xACE0;, IDA&amp;#xC5D0;&amp;#xC11C; base &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; CopyFileW() &amp;#xD568;&amp;#xC218; &amp;#xBD80;&amp;#xADFC;&amp;#xC5D0; bp&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; Dst &amp;#xC5D0;&amp;#xB294; &amp;#xC55E;&amp;#xC11C; &amp;#xB9D0;&amp;#xD55C; updater &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xC368;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; Src&amp;#xC5D0;&amp;#xB294; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD560; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC00;&amp;#xC9DC; updater.exe &amp;#xB294; System &amp;#xD1A0;&amp;#xD070;&amp;#xC73C;&amp;#xB85C; cmd&amp;#xB97C; &amp;#xCF1C;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C;&amp;#xC774;&amp;#xACE0;, &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xAC00; &amp;#xB418;&amp;#xBA74;&amp;#xC11C; LPE&amp;#xC5D0; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xAC83;&amp;#xC774;&amp;#xC8E0;!&lt;/p&gt;
&lt;h2 id=&#34;2-Registry-&amp;#xAD00;&amp;#xB828;-API&amp;#xB97C;-&amp;#xD65C;&amp;#xC6A9;&amp;#xD55C;-LPE&#34;&gt;&lt;a href=&#34;#2-Registry-&amp;#xAD00;&amp;#xB828;-API&amp;#xB97C;-&amp;#xD65C;&amp;#xC6A9;&amp;#xD55C;-LPE&#34; class=&#34;headerlink&#34; title=&#34;2. Registry &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; LPE&#34;&gt;&lt;/a&gt;2. Registry &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; LPE&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xC790;, &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; Registry &amp;#xAD00;&amp;#xB828; API&amp;#xB4E4;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;! &lt;/p&gt;
&lt;h3 id=&#34;2-1-SHSetValueW&#34;&gt;&lt;a href=&#34;#2-1-SHSetValueW&#34; class=&#34;headerlink&#34; title=&#34;2-1. SHSetValueW()&#34;&gt;&lt;/a&gt;2-1. SHSetValueW()&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;LSTATUS &lt;span class=&#34;hljs-title&#34;&gt;SHSetValueW&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           HKEY    hkey,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPCWSTR pszSubKey,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPCWSTR pszValue,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD   dwType,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPCVOID pvData,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD   cbData&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;SHSetValueW()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xC774; &amp;#xC778;&amp;#xC790; &amp;#xC138;&amp;#xD305;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; SubKey&amp;#xC640; ValueName &amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD574;&amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC8C; &amp;#xBB34;&amp;#xC2A8; &amp;#xB9D0;&amp;#xC774;&amp;#xB0D0;, &amp;#xC774; &amp;#xC778;&amp;#xC790;&amp;#xB4E4;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xC758; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xC758; Value &amp;#xAC12;&amp;#xC744; &amp;#xB9C8;&amp;#xC74C;&amp;#xB300;&amp;#xB85C; &amp;#xBC14;&amp;#xAFC0; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC774;&amp;#xACA0;&amp;#xC8E0;!! &amp;#xC9C1;&amp;#xC811; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x102C&lt;/span&gt;:
{
  &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *SubKey    = (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *)(input + &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;);    &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *ValueName = (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *)(input + &lt;span class=&#34;hljs-number&#34;&gt;4176&lt;/span&gt;);  &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  HKEY RootKey           = *(HKEY *)(input + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;);           &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  DWORD Type             = *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0xA094&lt;/span&gt;);     &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  LPCVOID Data           = (LPCVOID)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x2090&lt;/span&gt;);      &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  DWORD DataSize         = *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0xA090&lt;/span&gt;);     &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;

  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (RootKey == HKCR &amp;#xB798;&amp;#xD551; / HKCU TLS &amp;#xCE58;&amp;#xD658; / &amp;#xD14C;&amp;#xC774;&amp;#xBE14; &amp;#xD578;&amp;#xB4E4; &amp;#xB85C;&amp;#xC9C1; &amp;#xB4F1;)&lt;/span&gt;

  LSTATUS st = SHSetValueW(
      RootKey,
      SubKey,
      ValueName,
      Type,
      Data,
      DataSize
  );

  DWORD err = GetLastError();
  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xC751;&amp;#xB2F5; Buffer&amp;#xC5D0; st/err &amp;#xB2F4;&amp;#xC544;&amp;#xC11C; &amp;#xBC18;&amp;#xD658;)&lt;/span&gt;
  WriteFile(a3, Buffer, &lt;span class=&#34;hljs-number&#34;&gt;0x10018&lt;/span&gt;u, &amp;amp;written, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;case 0x102C &amp;#xBD84;&amp;#xAE30;&amp;#xB85C; &amp;#xAC00;&amp;#xBA74; &amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; SHSetValueW &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xAC12;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD574; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;offset +&lt;span class=&#34;hljs-number&#34;&gt;0x0008&lt;/span&gt; &amp;#x2192; &lt;span class=&#34;hljs-function&#34;&gt;HKEY &lt;span class=&#34;hljs-title&#34;&gt;Root&lt;/span&gt; &lt;span class=&#34;hljs-params&#34;&gt;(&amp;#xC608;: HKEY_LOCAL_MACHINE)&lt;/span&gt;&lt;/span&gt;
offset +0x0010 &amp;#x2192; SubKey
offset +&lt;span class=&#34;hljs-number&#34;&gt;0x1050&lt;/span&gt; &amp;#x2192; ValueName
offset +&lt;span class=&#34;hljs-number&#34;&gt;0xA068&lt;/span&gt; &amp;#x2192; Type (REG_SZ &amp;#xB4F1;)
offset +&lt;span class=&#34;hljs-number&#34;&gt;0x2090&lt;/span&gt; &amp;#x2192; Buffer (&amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xAC12;)
offset +&lt;span class=&#34;hljs-number&#34;&gt;0xA064&lt;/span&gt; &amp;#x2192; Buffer size&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC785;&amp;#xB825; &amp;#xAD6C;&amp;#xC870;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (RootKey == HKEY_CLASSES_ROOT)
{
  &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xB0B4;&amp;#xBD80; &amp;#xD074;&amp;#xB798;&amp;#xC2A4;&amp;#xB85C; &amp;#xB798;&amp;#xD551;&lt;/span&gt;
  CClassesRoot ctx;
  ctx.h1 = TlsGetValue(...);
  ctx.h2 = TlsGetValue(...);
  SHSetValueW(ctx.h1 &lt;span class=&#34;hljs-keyword&#34;&gt;or&lt;/span&gt; h2, SubKey, ValueName, Type, Data, Size);
}
&lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (RootKey &amp;amp; &lt;span class=&#34;hljs-number&#34;&gt;0x80000000&lt;/span&gt;)  &lt;span class=&#34;hljs-comment&#34;&gt;// e.g., HKEY_LOCAL_MACHINE, HKEY_USERS &amp;#xB4F1;&lt;/span&gt;
{
  keyctx = get_handle_from_table(RootKey);
  SHSetValueW(keyctx, SubKey, ValueName, Type, Data, Size);
}
&lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
{
  &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xC77C;&amp;#xBC18; HKEY_CURRENT_USER &amp;#xC77C; &amp;#xACBD;&amp;#xC6B0; TLS &amp;#xAE30;&amp;#xBC18; &amp;#xD0A4;&amp;#xB85C; &amp;#xCE58;&amp;#xD658;&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (RootKey == HKEY_CURRENT_USER)
    RootKey = TlsGetValue(...);

  SHSetValueW(RootKey, SubKey, ValueName, Type, Data, Size);
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD575;&amp;#xC2EC; &amp;#xCDE8;&amp;#xC57D; &amp;#xB85C;&amp;#xC9C1;&amp;#xC740; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC740;&amp;#xB370;, &amp;#xACB0;&amp;#xAD6D; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xD55C; &amp;#xC784;&amp;#xC758; HKEY + SubKey + Value + Data&amp;#xAC00; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; SHSetValueW &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB3C4; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; Registry&amp;#xC5D0; ImagePath&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC73C;&amp;#xB85C; MicrosoftEdgeElevationService &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC120;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Process Monitor &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;, Edge&amp;#xB97C; &amp;#xCF30;&amp;#xC744; &amp;#xB54C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; Load &amp;#xB418;&amp;#xB294;&amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xD6C4; &amp;#xC774; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB290; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294;&amp;#xC9C0;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC640; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD3B8;&amp;#xC9D1;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image17.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image18.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; MicroSoftEdgeElevationService &amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, ImagePath &amp;#xAC00; &amp;#x201C;C:\Program Files (x86)\Microsoft\Edge\Application\138.0.3351.77\elevation_service.exe&amp;#x201D; &amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xD55C; &amp;#xB4A4; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image19.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image20.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; Path&amp;#xC640; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xC758; ImagePath&amp;#xAC00; &amp;#xBC14;&amp;#xB010; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!! &amp;#xC774;&amp;#xC81C; MicrosoftEdge&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xBA74; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; cmd&amp;#xAC00; &amp;#xCF1C;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC548; &amp;#xD574;&amp;#xBCFC; &amp;#xC218; &amp;#xC5C6;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image21.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image22.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Value &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; ImagePath &amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC04; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image23.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;SubKey &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9D0;&amp;#xD55C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC04; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image24.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; key&amp;#xB294; HKEY_LOCAL_MACHINE &amp;#xB97C; &amp;#xC758;&amp;#xBBF8;&amp;#xD558;&amp;#xB294; 0x80000002 &amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC04; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC81C;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB192;&amp;#xC740; &amp;#xACBD;&amp;#xB85C;&amp;#xC758; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; Image Path&amp;#xB97C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFC0; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;!&lt;/p&gt;
&lt;h2 id=&#34;3-Service-&amp;#xAD00;&amp;#xB828;-API&amp;#xB97C;-&amp;#xD65C;&amp;#xC6A9;&amp;#xD55C;-LPE&#34;&gt;&lt;a href=&#34;#3-Service-&amp;#xAD00;&amp;#xB828;-API&amp;#xB97C;-&amp;#xD65C;&amp;#xC6A9;&amp;#xD55C;-LPE&#34; class=&#34;headerlink&#34; title=&#34;3. Service &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; LPE&#34;&gt;&lt;/a&gt;3. Service &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; LPE&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; Service &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;! &amp;#xC774;&amp;#xBC88;&amp;#xC5D4; 3&amp;#xAC00;&amp;#xC9C0;&amp;#xC758; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; LPE&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2EC;&amp;#xC131; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;h3 id=&#34;3-1-OpenSCManagerW&#34;&gt;&lt;a href=&#34;#3-1-OpenSCManagerW&#34; class=&#34;headerlink&#34; title=&#34;3.1 OpenSCManagerW()&#34;&gt;&lt;/a&gt;3.1 OpenSCManagerW()&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;SC_HANDLE &lt;span class=&#34;hljs-title&#34;&gt;OpenSCManagerW&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPCWSTR lpMachineName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPCWSTR lpDatabaseName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD   dwDesiredAccess&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &lt;code&gt;OpenSCManagerW()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB4A4;&amp;#xC5D0; &amp;#xB098;&amp;#xC62C; CreateService&amp;#xB098; StartService&amp;#xB294; &amp;#xB418;&amp;#xAC8C; &amp;#xC9C1;&amp;#xAD00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBB34;&amp;#xC2A8; &amp;#xAE30;&amp;#xB2A5;&amp;#xC778;&amp;#xC9C0; &amp;#xC54C; &amp;#xAC83; &amp;#xAC19;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774; &lt;code&gt;OpenSCManagerW()&lt;/code&gt; API&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xC57C;&amp;#xB9CC; &amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#x2018;SCM &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#x2019;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB418;&amp;#xB294; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB77C;&amp;#xC11C;, &amp;#xADF8; DB&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD578;&amp;#xB4E4;(&amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;)&amp;#xC774; &amp;#xBA3C;&amp;#xC800; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xC774;&amp;#xD6C4; &amp;#xC791;&amp;#xC5C5;(&amp;#xC0DD;&amp;#xC131;/&amp;#xC218;&amp;#xC815;/&amp;#xC2DC;&amp;#xC791;)&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC5F4;&amp;#xACE0; &amp;#xBC18;&amp;#xD658;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xC774; API&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x103B&lt;/span&gt;:
{
  &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *Machine  = (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *)(input + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;);      &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled (optional)&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *Database = (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x1048&lt;/span&gt;); &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled (optional)&lt;/span&gt;
  DWORD Access          = *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x2088&lt;/span&gt;);      &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;

  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (empty string -&amp;gt; NULL &amp;#xCC98;&amp;#xB9AC; &amp;#xB4F1;)&lt;/span&gt;

  SC_HANDLE hScm = OpenSCManagerW(Machine, Database, Access);

  DWORD err = GetLastError();
  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xC751;&amp;#xB2F5;&amp;#xC5D0; hScm/err &amp;#xBC18;&amp;#xD658;)&lt;/span&gt;
  WriteFile(a3, Buffer, &lt;span class=&#34;hljs-number&#34;&gt;0x10018&lt;/span&gt;u, &amp;amp;written, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;case 0x103B &amp;#xBD84;&amp;#xAE30;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;,&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;input + 8 &amp;#x2192; lpMachineName&lt;/li&gt;
&lt;li&gt;input + 0x1048 &amp;#x2192; lpDatabaseName&lt;/li&gt;
&lt;li&gt;input + 0x2088 &amp;#x2192; dwDesiredAccess&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xAC83;&amp;#xC740; dwDesiredAccess &amp;#xB85C;, SC_MANAGER_ALL_ACCESS(0xF003F) &amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD574;&amp;#xC918;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294;&amp;#xAC83;!&lt;/p&gt;
&lt;h3 id=&#34;3-2-CreateServiceW&#34;&gt;&lt;a href=&#34;#3-2-CreateServiceW&#34; class=&#34;headerlink&#34; title=&#34;3.2 CreateServiceW()&#34;&gt;&lt;/a&gt;3.2 &lt;strong&gt;CreateServiceW()&lt;/strong&gt;&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;SC_HANDLE &lt;span class=&#34;hljs-title&#34;&gt;CreateServiceW&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]            SC_HANDLE hSCManager,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]            LPCWSTR   lpServiceName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]  LPCWSTR   lpDisplayName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]            DWORD     dwDesiredAccess,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]            DWORD     dwServiceType,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]            DWORD     dwStartType,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]            DWORD     dwErrorControl,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]  LPCWSTR   lpBinaryPathName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]  LPCWSTR   lpLoadOrderGroup,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [out, optional] LPDWORD   lpdwTagId,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]  LPCWSTR   lpDependencies,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]  LPCWSTR   lpServiceStartName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]  LPCWSTR   lpPassword&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xD578;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC5BB;&amp;#xC5C8;&amp;#xC73C;&amp;#xB2C8;, Service&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x103F&lt;/span&gt;:
{
  SC_HANDLE hScm = *(SC_HANDLE *)(input + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;);

  &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *SvcName    = (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *)(input + &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;);     &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *DispName   = (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *)(input + &lt;span class=&#34;hljs-number&#34;&gt;4176&lt;/span&gt;);   &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *BinPath    = (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; WCHAR *)(input + &lt;span class=&#34;hljs-number&#34;&gt;8352&lt;/span&gt;);   &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;

  DWORD DesiredAccess     = *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x2090&lt;/span&gt;);      &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  DWORD ServiceType       = *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x2094&lt;/span&gt;);      &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  DWORD StartType         = *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x2098&lt;/span&gt;);      &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;
  DWORD ErrorControl      = *(DWORD *)(input + &lt;span class=&#34;hljs-number&#34;&gt;0x209C&lt;/span&gt;);      &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled&lt;/span&gt;

  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (Group/Deps/StartName/Password &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xC815;&amp;#xB9AC; &amp;#xBC0F; NULL &amp;#xCC98;&amp;#xB9AC;)&lt;/span&gt;

  SC_HANDLE hSvc = CreateServiceW(
      hScm,
      SvcName,
      DispName,
      DesiredAccess,
      ServiceType,
      StartType,
      ErrorControl,
      BinPath,
      &lt;span class=&#34;hljs-comment&#34;&gt;/* ... */&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
  );

  DWORD err = GetLastError();
  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xC751;&amp;#xB2F5;&amp;#xC5D0; hSvc/err &amp;#xBC18;&amp;#xD658;)&lt;/span&gt;
  WriteFile(a3, Buffer, &lt;span class=&#34;hljs-number&#34;&gt;0x10018&lt;/span&gt;u, &amp;amp;written, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;case 0x103F &amp;#xBD84;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; CreateServiceW() &amp;#xB85C; &amp;#xC9C1;&amp;#xC811; &amp;#xC784;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;input + 0x08 &amp;#x2192; &lt;code&gt;hSCManager&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;SC_HANDLE&lt;/code&gt; (&amp;#xC774;&amp;#xC804; &lt;code&gt;0x103B&lt;/code&gt; &amp;#xD638;&amp;#xCD9C;&amp;#xB85C; &amp;#xC5BB;&amp;#xC740; SCM &amp;#xD578;&amp;#xB4E4;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x10 &amp;#x2192; &lt;code&gt;lpServiceName&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;LPCWSTR&lt;/code&gt; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xB0B4;&amp;#xBD80; &amp;#xC774;&amp;#xB984; (&amp;#xC608;: L&amp;#x201D;LPE&amp;#x201D;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x1050 &amp;#x2192; &lt;code&gt;lpDisplayName&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;LPCWSTR&lt;/code&gt; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBCF4;&amp;#xC77C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC774;&amp;#xB984; (&amp;#xC608;: L&amp;#x201D;My Payload Service&amp;#x201D;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x2090 &amp;#x2192; &lt;code&gt;dwDesiredAccess&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;DWORD&lt;/code&gt; &amp;#xC811;&amp;#xADFC;&amp;#xAD8C;&amp;#xD55C; &amp;#xD50C;&amp;#xB798;&amp;#xADF8; (&amp;#xC608;: &lt;code&gt;SERVICE_ALL_ACCESS&lt;/code&gt; = 0xF01FF)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x2094 &amp;#x2192; &lt;code&gt;dwServiceType&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;DWORD&lt;/code&gt; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD0C0;&amp;#xC785; (&amp;#xC608;: &lt;code&gt;SERVICE_WIN32_OWN_PROCESS&lt;/code&gt; = 0x10)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x2098 &amp;#x2192; &lt;code&gt;dwStartType&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;DWORD&lt;/code&gt; &amp;#xC2DC;&amp;#xC791; &amp;#xC720;&amp;#xD615; (&amp;#xC608;: &lt;code&gt;SERVICE_DEMAND_START&lt;/code&gt; = 0x3)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x209C &amp;#x2192; &lt;code&gt;dwErrorControl&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;DWORD&lt;/code&gt; &amp;#xC624;&amp;#xB958; &amp;#xC81C;&amp;#xC5B4; (&amp;#xC608;: &lt;code&gt;SERVICE_ERROR_NORMAL&lt;/code&gt; = 0x1)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x20A0 &amp;#x2192; &lt;code&gt;lpBinaryPathName&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;LPCWSTR&lt;/code&gt; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C; (&amp;#xC608;: L&amp;#x201D;C:\Temp\poc.exe&amp;#x201D;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x30E0 &amp;#x2192; &lt;code&gt;lpLoadOrderGroup&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;LPCWSTR&lt;/code&gt; &amp;#xB85C;&amp;#xB4DC; &amp;#xC21C;&amp;#xC11C; &amp;#xADF8;&amp;#xB8F9; (&amp;#xC608;: L&amp;#x201D;Base&amp;#x201D;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x4120 &amp;#x2192; &lt;code&gt;lpDependencies&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;LPCWSTR&lt;/code&gt; &amp;#xC758;&amp;#xC874; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x5160 &amp;#x2192; &lt;code&gt;lpServiceStartName&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;LPCWSTR&lt;/code&gt; &amp;#xB85C;&amp;#xADF8;&amp;#xC628; &amp;#xACC4;&amp;#xC815; (&amp;#xC608;: L&amp;#x201D;NT AUTHORITY\System&amp;#x201D;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;input + 0x61A0 &amp;#x2192; &lt;code&gt;lpPassword&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;LPCWSTR&lt;/code&gt; &amp;#xD574;&amp;#xB2F9; &amp;#xACC4;&amp;#xC815; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638; (&amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; NULL)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC0DD;&amp;#xC131;&amp;#xB9CC; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC11C; &amp;#xC644;&amp;#xBCBD;&amp;#xD55C; LPE&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xC21C; &amp;#xC5C6;&amp;#xACA0;&amp;#xC8E0;? &amp;#xC774;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; API &amp;#xB610;&amp;#xD55C; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;3-3-StartServiceW&#34;&gt;&lt;a href=&#34;#3-3-StartServiceW&#34; class=&#34;headerlink&#34; title=&#34;3.3 StartServiceW()&#34;&gt;&lt;/a&gt;3.3 &lt;strong&gt;StartServiceW()&lt;/strong&gt;&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;BOOL &lt;span class=&#34;hljs-title&#34;&gt;StartServiceW&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           SC_HANDLE hService,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD     dwNumServiceArgs,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPCWSTR   *lpServiceArgVectors&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x1040&lt;/span&gt;:
{
  SC_HANDLE hSvc = *(SC_HANDLE *)(input + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;);  &lt;span class=&#34;hljs-comment&#34;&gt;// attacker-controlled (handle from prior call)&lt;/span&gt;

  BOOL ok = StartServiceW(hSvc, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;);

  DWORD err = GetLastError();
  &lt;span class=&#34;hljs-comment&#34;&gt;// ... (&amp;#xC751;&amp;#xB2F5; Buffer&amp;#xC5D0; ok/err &amp;#xB2F4;&amp;#xC544;&amp;#xC11C; &amp;#xBC18;&amp;#xD658;)&lt;/span&gt;
  WriteFile(a3, Buffer, &lt;span class=&#34;hljs-number&#34;&gt;0x10018&lt;/span&gt;u, &amp;amp;written, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; Start &amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; case 0x1040 &amp;#xBD84;&amp;#xAE30;&amp;#xB85C; StartServiceW() &amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;input + 8 &amp;#x2192; &lt;code&gt;hService&lt;/code&gt; (&lt;code&gt;SC_HANDLE&lt;/code&gt;)&lt;/li&gt;
&lt;li&gt;dwNumServiceArgs &amp;#x2192; &lt;code&gt;0&lt;/code&gt; (&amp;#xACE0;&amp;#xC815;)&lt;/li&gt;
&lt;li&gt;lpServiceArgVectors &amp;#x2192; &lt;code&gt;NULL&lt;/code&gt; (&amp;#xACE0;&amp;#xC815;)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; CreateServiceW() &amp;#xC758; &amp;#xBC18;&amp;#xD658; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1B;&amp;#xC740; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; input + 8&amp;#xC5D0; &amp;#xB123;&amp;#xC5B4; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC5D4; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC73C;&amp;#xB85C; &amp;#xBA3C;&amp;#xC800; &amp;#xD55C; &amp;#xB2E8;&amp;#xACC4; &amp;#xD55C; &amp;#xB2E8;&amp;#xACC4; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image25.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; OpenSCManagerW() &amp;#xD568;&amp;#xC218; &amp;#xBD80;&amp;#xADFC;&amp;#xC5D0; bp&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image26.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;dwDesiredAccess &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC9D1;&amp;#xC5B4;&amp;#xB123;&amp;#xC740; SC_MANAGER_ALL_ACCESS(0xf003f) &amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC04; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image27.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &amp;#xCD9C;&amp;#xB825; &amp;#xD654;&amp;#xBA74;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; hSCM &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xBC1B;&amp;#xC544;&amp;#xC624;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image28.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; CreateServiceW() &amp;#xBD80;&amp;#xADFC;&amp;#xC5D0; bp&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image29.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;lpServiceStartName &amp;#xC5D0;&amp;#xB294; System &amp;#xC744; &amp;#xC801;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image30.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; lpBinaryPathName &amp;#xC5D0; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xD654; &amp;#xC2DC;&amp;#xD0AC; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xC368;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image31.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &amp;#xCD9C;&amp;#xB825; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xC774; &amp;#xB418;&amp;#xACE0;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD578;&amp;#xB4E4; &amp;#xAC12;&amp;#xB3C4; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC62C; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC78; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image32.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image33.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; LPE &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC0DD;&amp;#xACBC;&amp;#xACE0;, &amp;#xACBD;&amp;#xB85C;&amp;#xB3C4; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; StartServiceW() &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589;&amp;#xB9CC; &amp;#xC2DC;&amp;#xD0A8;&amp;#xB2E4;&amp;#xBA74;? System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC545;&amp;#xC131; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACA0;&amp;#xC8E0;!!&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/18/gongjae/WHS3-bughunting2/KR/image34.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; Part 2&amp;#xC758; Named Pipe &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC5EC;&amp;#xB7EC; LPE &amp;#xBCA1;&amp;#xD130;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC124;&amp;#xBA85;&amp;#xC774; &amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xC5D0;&amp;#xAC8C; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC168;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xB294;&amp;#xB370;&amp;#xC694;!! Named Pipe&amp;#xC758; &amp;#xAD8C;&amp;#xD55C; &amp;#xC124;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; medium &amp;#xC720;&amp;#xC800;&amp;#xAC00; System &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;! &amp;#xC4F0;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8; &amp;#xB108;&amp;#xBB34; &amp;#xACE0;&amp;#xBD09;&amp;#xBC25;&amp;#xCC98;&amp;#xB7FC; &amp;#xC4F4; &amp;#xAC83; &amp;#xAC19;&amp;#xC544; &amp;#xBD84;&amp;#xB7C9; &amp;#xC870;&amp;#xC808;&amp;#xC5D0; &amp;#xC2E4;&amp;#x2026;&amp;#xD328; &amp;#xD55C; &amp;#xAC83; &amp;#xAC19;&amp;#xC9C0;&amp;#xB9CC;!! &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC774;&amp;#xB7F0; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C;&amp;#xB3C4; LPE&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAD6C;&amp;#xB098;!! &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBD10;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xAC10;&amp;#xC0AC;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F609; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; Windows LPE&amp;#xC758; &amp;#xAF43;&amp;#xC774;&amp;#xC790; Kernel Driver&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;~ &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-openscmanagerw&#34;&gt;https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-openscmanagerw&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows/win32/services/service-security-and-access-rights&#34;&gt;https://learn.microsoft.com/ko-kr/windows/win32/services/service-security-and-access-rights&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-createservicew&#34;&gt;https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-createservicew&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-startservicew&#34;&gt;https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-startservicew&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows/win32/api/shlwapi/nf-shlwapi-shsetvaluew&#34;&gt;https://learn.microsoft.com/ko-kr/windows/win32/api/shlwapi/nf-shlwapi-shsetvaluew&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows/win32/api/winbase/nf-winbase-copyfilew&#34;&gt;https://learn.microsoft.com/ko-kr/windows/win32/api/winbase/nf-winbase-copyfilew&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2026/01/18/gongjae/WHS3-bughunting2/KR/logo_window.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2026/01/18/gongjae/whs3-bughunting2/kr/">

  <title>[Research]    Windows LPE   Part 2 (KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2026-01-18 17:00" pubdate>
      2026 1 18 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3.9k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      78
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research]    Windows LPE   Part 2 (KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/logo_window.png" srcset="/img/loading.gif" alt></p>
<h2 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h2><hr>
<p>&#xB2E4;&#xB4E4; &#xC0C8;&#xD574; &#xC798; &#xBCF4;&#xB0B4;&#xC168;&#xC744;&#xAE4C;&#xC694;! &#xC800;&#xC758; &#xB450; &#xBC88;&#xC9F8; &#xC5F0;&#xAD6C;&#xAE00;&#xC774;&#xC790; &#xB9C9;&#xB0B4;&#xC988;&#xC758; Part 2 &#xAE00;&#xC744; &#xB9E1;&#xAC8C; &#xB41C; gongjae &#xC785;&#xB2C8;&#xB2E4; &#x1F600; &#xC55E;&#xC11C; banda&#xB2D8;&#xC774; <a href="https://hackyboiz.github.io/2025/12/28/banda/WHS3-bughunting/ko/">Part 1</a>&#xC744; &#xC57C;&#xBB34;&#xC9C0;&#xAC8C; &#xC368;&#xC8FC;&#xC2E0; &#xB098;&#xBA38;&#xC9C0; &#xC81C;&#xAC00; &#xC124;&#xBA85;&#xD560; &#xAC8C; &#xB0A8;&#xC544;&#xC788;&#xC744;&#xAE4C; &#xD558;&#xC9C0;&#xB9CC;&#x2026; &#xADF8;&#xB798;&#xB3C4; &#xC9C1;&#xC811; &#xCC3E;&#xC740; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xB300;&#xD55C; &#xC124;&#xBA85;&#xACFC; &#xD568;&#xAED8; &#xBC84;&#xADF8;&#xD5CC;&#xD305;&#xC5D0; &#xAD00;&#xC2EC; &#xC788;&#xC73C;&#xC2E0; &#xBD84;&#xB4E4;&#xC5D0;&#xAC8C; &#xC870;&#xAE08;&#xC774;&#xB098;&#xB9C8; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xACE0; &#xC2F6;&#xB124;&#xC694;..&#x314E;&#x314E;</p>
<p>&#xC624;&#xB298;&#xC740; &#xC81C;&#xAC00; Part 2&#xC5D0;&#xC11C; &#xC9C1;&#xC811; &#xCC3E;&#xC740; Named Pipe&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xB294; LPE &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA70; &#x2018;&#xC774;&#xB7F0; &#xBC29;&#xC2DD;&#xC73C;&#xB85C;&#xB3C4; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xAD6C;&#xB098;&#x2019;&#xB97C; &#xC18C;&#xAC1C;&#xD558;&#xACE0;&#xC790; &#xD569;&#xB2C8;&#xB2E4;!</p>
<h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><hr>
<p>&#xC790;, &#xC6B0;&#xC120; &#xC81C;&#xAC00; &#xCC3E;&#xC740; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC548;&#xD2F0;&#xBC14;&#xC774;&#xB7EC;&#xC2A4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD55C; Named Pipe &#xCDE8;&#xC57D;&#xC810;&#xC778;&#xB370;&#xC694;, &#xD604;&#xC7AC;&#xB294; &#xD328;&#xCE58;&#xB41C; &#xC0C1;&#xD669;&#xC774;&#xACE0; ZDI&#xC5D0; &#xC81C;&#xBCF4;&#xD558;&#xC5EC; CVE&#xAE4C;&#xC9C0; &#xBC1C;&#xAE09;&#xC774; &#xB41C; &#xC0C1;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image1.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8; &#xC911;&#xC5D0;&#xC11C; &#xC624;&#xB298; &#xC81C;&#xAC00; &#xBCF4;&#xC5EC;&#xB4DC;&#xB9B4; &#xCDE8;&#xC57D;&#xC810;&#xC740; File &#xAD00;&#xB828;, Registry &#xAD00;&#xB828;, Service &#xAD00;&#xB828;&#xC73C;&#xB85C; &#xB098;&#xB258;&#xC5B4; &#xC788;&#xB294;&#xB370;&#xC694;! Named Pipe&#xB97C; &#xACFC;&#xB3C4;&#xD558;&#xAC8C; &#xAC1C;&#xBC29;&#xB41C; &#xC0C1;&#xD0DC;&#xB85C; IPC&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xB418;&#xB294;&#xC9C0;, Case &#xBCC4;&#xB85C; &#xD655;&#xC778;&#xD574;&#xBCFC;&#xAE4C;&#xC694;!</p>
<h2 id="0-Attack-Surface"><a href="#0-Attack-Surface" class="headerlink" title="0. Attack Surface"></a>0. Attack Surface</h2><hr>
<p>&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC744; &#xC18C;&#xAC1C;&#xD558;&#xAE30; &#xC804;&#xC5D0;, &#xAC00;&#xC7A5; &#xBA3C;&#xC800; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD560; &#xBD80;&#xBD84;&#xC785;&#xB2C8;&#xB2E4;. Everyone &#xAD8C;&#xD55C;&#xC774; System &#xC218;&#xC900;&#xC758; &#xAD8C;&#xD55C;&#xC744; &#xC5BB;&#xAE30; &#xC704;&#xD55C; &#xCCAB; &#xAC78;&#xC74C;&#xC774;&#xB77C;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC8E0;! Part 1 &#xB54C;&#xC640; &#xAC70;&#xC758; &#xC720;&#xC0AC;&#xD558;&#xC9C0;&#xB9CC;! <del>&#xADF8;&#xB798;&#xB3C4; &#xBCF4;&#xC5EC;&#xB4DC;&#xB9AC;&#xB294; &#xAC83;&#xC774; &#xC778;&#xC9C0;&#xC0C1;&#xC815;</del> &#xADF8;&#xB798;&#xB3C4; &#xAC19;&#xC774; &#xD655;&#xC778;&#xD574;&#xBCFC;&#xAE4C;&#xC694;?</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image2.png" srcset="/img/loading.gif" alt></p>
<p>&#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC124;&#xCE58;&#xD588;&#xC744; &#xB54C; Process Explorer&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74;, &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; SASCore64.exe &#xB77C;&#xB294; System &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294; Process&#xAC00; &#xC788;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC8E0;! &#xAC70;&#xAE30;&#xB2E4; Handles &#xBD80;&#xBD84;&#xC5D0; Named Pipe &#xAC00; &#xC788;&#xB2E4;&#xB294; &#xAC83; &#xAE4C;&#xC9C0; &#xD655;&#xC778;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image3.png" srcset="/img/loading.gif" alt></p>
<p>&#xAC70;&#xAE30;&#xB2E4; &#xAC00;&#xC7A5; &#xD070; &#xAD00;&#xBB38;&#xC778; ACL &#xBD80;&#xBD84;&#xC774;&#xC8E0;..!! SysinternalsSuite&#xC758; accesschk&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xAD8C;&#xD55C;&#xC744; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xB2C8; Everyone RW &#xAD8C;&#xD55C;&#xC774; &#xC788;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;~ &#xB530;&#xB77C;&#xC11C; medium user&#xAC00; &#xD2B9;&#xBCC4;&#xD55C; &#xAD8C;&#xD55C; &#xC5C6;&#xC774;&#xB3C4; System &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589; &#xC911;&#xC778; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC758;&#xBBF8;&#xACA0;&#xC8E0;!</p>
<p>&#xC790; &#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xC774;&#xC81C; &#xC9C1;&#xC811; SASCore64.exe &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xCD94;&#xCD9C;&#xD558;&#xC5EC; IDA&#xB85C; &#xC5F4;&#xC5B4;&#xBCF8; &#xB4A4;, Imports&#xC5D0;&#xC11C; Named Pipe &#xAD00;&#xB828; api&#xAC00; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image4.png" srcset="/img/loading.gif" alt></p>
<p>CreateNamedPipe api&#xAC00; &#xC788;&#xB294; sub_140013F60 &#xD568;&#xC218;&#xB85C; &#xAC00;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image5.png" srcset="/img/loading.gif" alt></p>
<p>&#xCF54;&#xB4DC;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; CreateNamedPipeA &#xB97C; &#xD1B5;&#xD574; named pipe&#xB97C; &#xB9CC;&#xB4E4;&#xACE0;, Connect &#xD558;&#xB294; &#xAC78; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xD575;&#xC2EC;&#xC740; Named Pipe&#xC6A9; SECURITY_ATTRIBUTES &#xB97C; &#xAD6C;&#xC131;&#xD558;&#xB294;&#xB370;, &#xBAA8;&#xB4E0; &#xB85C;&#xCEEC; &#xC0AC;&#xC6A9;&#xC790; &#xC644;&#xC804; &#xC811;&#xADFC;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC774;&#xC8E0;! StartAddress &#xD568;&#xC218;&#xB85C; &#xAC00;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image6.png" srcset="/img/loading.gif" alt></p>
<p>StartAddress &#xD568;&#xC218;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; 1&#xAC1C;&#xB2F9; Named Pipe &#xC138;&#xC158;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xC804;&#xC6A9; &#xC2A4;&#xB808;&#xB4DC;&#xB85C;, sub_14000F7E0 &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xD30C;&#xC774;&#xD504; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xD574;&#xC11D;&#xD558;&#xC5EC; &#xC218;&#xD589;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; sub_14000F7E0 &#xB85C; &#xAC00;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image7.png" srcset="/img/loading.gif" alt></p>
<p>v6&#xC5D0; &#xC6B0;&#xB9AC;&#xC758; input &#xAC12;&#xC744; &#xB123;&#xC744; &#xC218; &#xC788;&#xACE0;, &#xC774;&#xB97C; case&#xB85C; &#xB098;&#xB258;&#xC5B4;&#xC11C; &#xC5EC;&#xB7EC; &#xAE30;&#xB2A5;&#xB4E4;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! &#xADF8;&#xB7EC;&#xB098; &#xAE30;&#xB2A5;&#xB4E4;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xC544;&#xB798; 0x103A &#xBD84;&#xAE30;&#xB97C; &#xD1B5;&#xD558;&#xC5EC; Token&#xC744; &#xBA3C;&#xC800; &#xD68D;&#xB4DD;&#xD574;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp"><span class="hljs-keyword">case</span> <span class="hljs-number">0x103A</span>:
{
  <span class="hljs-comment">// ... (&#xC785;&#xB825;/&#xC2DC;&#xAC04; &#xAC80;&#xC99D; &#xBC0F; &#xAE30;&#xD0C0; &#xBD80;&#xC218; &#xB85C;&#xC9C1;)</span>

  <span class="hljs-keyword">if</span> (ImpersonateNamedPipeClient(a3))
  {
    <span class="hljs-comment">// ... (TLS&#xC5D0; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC800;&#xC7A5; &#xB4F1;)</span>

    HANDLE hProc = OpenProcess(PROCESS_ALL_ACCESS, FALSE, *(DWORD *)(input + <span class="hljs-number">8</span>));
    <span class="hljs-keyword">if</span> (hProc)
    {
      HANDLE hToken = <span class="hljs-literal">NULL</span>;
      <span class="hljs-keyword">if</span> (OpenProcessToken(hProc, TOKEN_ALL_ACCESS, &amp;hToken) &amp;&amp; hToken)
      {
        <span class="hljs-comment">// ... (&#xD1A0;&#xD070;&#xC744; &#xB0B4;&#xBD80; &#xC138;&#xC158;/&#xD14C;&#xC774;&#xBE14;&#xC5D0; &#xC800;&#xC7A5;)</span>
        CloseHandle(hToken);
      }
      CloseHandle(hProc);
    }

    RevertToSelf();
    FileSize = <span class="hljs-number">1</span>; <span class="hljs-comment">// session established</span>
  }

  <span class="hljs-comment">// ... (&#xC751;&#xB2F5; &#xAD6C;&#xC131;)</span>
  WriteFile(a3, Buffer, <span class="hljs-number">0x10018</span>u, &amp;written, <span class="hljs-number">0</span>);
  <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
}
</code></pre>
<ul>
<li>ImpersonateNamedPipeClient, OpenProcessToken(&#x2026;Pid&#x2026;) &#xC131;&#xACF5; &#xC2DC; &#xB0B4;&#xBD80; &#xB9AC;&#xC2A4;&#xD2B8;(a1 + 0x68)&#xC5D0; &#xC0C8; <strong>&#xB178;&#xB4DC; + &#xD1A0;&#xD070;</strong> &#xC774; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;.</li>
<li>&#xC751;&#xB2F5; 0x10018 &#xBC14;&#xC774;&#xD2B8; &#xC911; &#xC624;&#xD504;&#xC14B; 0x04 &#xC5D0; &#xD1A0;&#xD070; &#xAC12;&#xC744; &#xB3CC;&#xB824;&#xC8FC;&#xBBC0;&#xB85C; &#xC774; Token&#xC744; &#xC800;&#xC7A5;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xAC8C;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xC774;&#xB7F0; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD1A0;&#xD070;&#xC744; &#xC5BB;&#xC740; &#xD6C4;&#xC5D0; &#xB2E4;&#xB978; &#xAE30;&#xB2A5;&#xB4E4;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;, &#xC774; &#xAE30;&#xB2A5;&#xB4E4;&#xC774; &#xBC14;&#xB85C; &#xC81C;&#xAC00; &#xB9D0;&#xC500;&#xB4DC;&#xB9B4; &#xCDE8;&#xC57D;&#xC810; &#xBCA1;&#xD130;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h2 id="1-File-&#xAD00;&#xB828;-API&#xB97C;-&#xD65C;&#xC6A9;&#xD55C;-LPE"><a href="#1-File-&#xAD00;&#xB828;-API&#xB97C;-&#xD65C;&#xC6A9;&#xD55C;-LPE" class="headerlink" title="1. File &#xAD00;&#xB828; API&#xB97C; &#xD65C;&#xC6A9;&#xD55C; LPE"></a>1. File &#xAD00;&#xB828; API&#xB97C; &#xD65C;&#xC6A9;&#xD55C; LPE</h2><hr>
<p>&#xBA3C;&#xC800; File &#xAD00;&#xB828; API&#xB4E4;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xBA3C;&#xC800; &#xC54C;&#xC544;&#xBCFC;&#xAE4C;&#xC694;? Windows&#xC5D0;&#xB294; &#xC5EC;&#xB7EC;&#xAC00;&#xC9C0; API&#xB4E4;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xACE0;, &#xB300;&#xBD80;&#xBD84;&#xC740; &#xC548;&#xC804;&#xD558;&#xAC8C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xAC80;&#xC99D;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. &#xC911;&#xC694;&#xD55C; &#xBD80;&#xBD84;&#xC740; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xAC74;&#xB4E4;&#xC9C0; &#xBABB;&#xD558;&#xB3C4;&#xB85D; &#xB9D0;&#xC774;&#xC8E0;.. &#xD558;&#xC9C0;&#xB9CC; &#xB9CC;&#xC57D; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC911;&#xC694;&#xD55C; &#xC778;&#xC790;&#xB97C; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xB420;&#xAE4C;&#xC694;? </p>
<h3 id="1-1-CopyFileW"><a href="#1-1-CopyFileW" class="headerlink" title="1-1. CopyFileW()"></a>1-1. CopyFileW()</h3><p>MS&#xC5D0;&#xC11C; <code>CopyFileW()</code> &#xD568;&#xC218;&#xB97C; &#xBCF4;&#xBA74;, &#xAE30;&#xC874; &#xD30C;&#xC77C;&#xC744; &#xC0C8;&#xB85C;&#xC6B4; &#xD30C;&#xC77C;&#xB85C; &#xBCF5;&#xC0AC;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC744; &#xD558;&#xB294; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp"><span class="hljs-function">BOOL <span class="hljs-title">CopyFileW</span><span class="hljs-params">(</span></span>
<span class="hljs-function"><span class="hljs-params">  [in] LPCWSTR lpExistingFileName,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in] LPCWSTR lpNewFileName,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in] BOOL    bFailIfExists</span></span>
<span class="hljs-function"><span class="hljs-params">)</span></span>;</code></pre>
<p>&#xADF8;&#xB807;&#xB2E4;&#xBA74;, System &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC6D0;&#xD558;&#xB294; &#xACBD;&#xB85C;&#xC758; &#xD30C;&#xC77C;&#xC744; &#xC545;&#xC131; &#xD30C;&#xC77C;&#xB85C; &#xBC14;&#xAFC0; &#xC218; &#xC788;&#xB2E4;&#xBA74; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC774; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xACA0;&#xC8E0;?</p>
<pre><code class="hljs cpp"><span class="hljs-keyword">case</span> <span class="hljs-number">0x100D</span>:
{
  <span class="hljs-comment">// ...</span>
  BOOL ok = CopyFileW(
      (LPCWSTR)(input + <span class="hljs-number">8</span>),       <span class="hljs-comment">// attacker-controlled: src</span>
      (LPCWSTR)(input + <span class="hljs-number">0x1048</span>),  <span class="hljs-comment">// attacker-controlled: dst</span>
      *(DWORD *)(input + <span class="hljs-number">0x2088</span>)  <span class="hljs-comment">// attacker-controlled: bFailIfExists</span>
  );

  DWORD err = GetLastError();
  <span class="hljs-comment">// ... (&#xC751;&#xB2F5; Buffer&#xC5D0; ok/err &#xB2F4;&#xC544;&#xC11C; &#xBC18;&#xD658;)</span>
  WriteFile(a3, Buffer, <span class="hljs-number">0x10018</span>u, &amp;written, <span class="hljs-number">0</span>);
  <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
}
</code></pre>
<p>Token&#xC744; &#xC5BB;&#xC740; &#xB4A4; case 0x100D &#xB85C; &#xBD84;&#xAE30;&#xD558;&#xBA74; input+8&#xC5D0; Copy&#xD560; &#xD30C;&#xC77C; &#xACBD;&#xB85C;&#xB97C;, &#xB36E;&#xC5B4; &#xC4F8; &#xD30C;&#xC77C; &#xACBD;&#xB85C;&#xB97C; input+0x1048 &#xC5D0; &#xB123;&#xC5B4; API&#xB97C; &#xD638;&#xCD9C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image8.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xAC8C; &#xC65C; LPE&#xB0D0;&#xAD6C;&#xC694;..? &#xC800;&#xD76C;&#xAC00; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xAD8C;&#xD55C;&#xC73C;&#xB85C;&#xB294; &#xBC14;&#xAFB8;&#xAC70;&#xB098; &#xC0AD;&#xC81C;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xD30C;&#xC77C;&#xB4E4;&#xC774; &#xC788;&#xC8E0;. &#xAC70;&#xAE30;&#xB2E4;&#xAC00; &#xBA87; &#xCD08;&#xB9C8;&#xB2E4; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xD30C;&#xC77C;&#xC774; &#xC788;&#xB2E4;&#xBA74;? &#xC774; &#xD30C;&#xC77C;&#xC744; System &#xAD8C;&#xD55C;&#xC73C;&#xB85C; cmd&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xC545;&#xC131;&#xD30C;&#xC77C;&#xB85C; &#xBC14;&#xAFBC;&#xB2E4;&#xBA74; &#xB9D0;&#xADF8;&#xB300;&#xB85C; &#xBA87; &#xCD08;&#xB9C8;&#xB2E4; System &#xAD8C;&#xD55C; cmd&#xAC00; &#xCF1C;&#xC9C0;&#xACA0;&#xC8E0;!! &#xADF8;&#xB7F0; &#xC6D0;&#xB9AC;&#xC785;&#xB2C8;&#xB2E4;.&#x1F47D;</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image9.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xB807;&#xAC8C; &#xC9C1;&#xC811; Process Monitor&#xB85C; &#xD655;&#xC778;&#xD574;&#xBCFC;&#xAE4C;&#xC694;? &#xC774;&#xAC74; Chrome updater &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC774;&#xACE0;, &#xBA87; &#xCD08;&#xB9C8;&#xB2E4; &#xC2E4;&#xD589;&#xB418;&#xACE0;, &#xAD8C;&#xD55C;&#xC774; &#xB192;&#xC544; &#xC77C;&#xBC18; &#xAD8C;&#xD55C;&#xC73C;&#xB85C;&#xB294; &#xC811;&#xADFC;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC704; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD65C;&#xC6A9;&#xD574; &#xC545;&#xC131; &#xD30C;&#xC77C;&#xB85C; &#xBC14;&#xAFBC;&#xB2E4;&#xBA74;!?</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image10.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xB7F0;&#xC2DD;&#xC73C;&#xB85C; System cmd&#xAC00; &#xCF1C;&#xC9C0;&#xB294; &#xAC78; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC8E0;! &#x1F44F;</p>
<p>&#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xC870;&#xAE08; &#xB354; &#xD655;&#xC2E4;&#xD558;&#xAC8C; &#xD655;&#xC778;&#xD574;&#xBCFC;&#xAE4C;&#xC694;?</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image11.png" srcset="/img/loading.gif" alt></p>
<p>Windbg&#xB85C; &#xD574;&#xB2F9; Process&#xC5D0; Attach&#xB97C; &#xD55C; &#xD6C4; lm &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xD1B5;&#xD574; base &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD558;&#xACE0;, IDA&#xC5D0;&#xC11C; base &#xC124;&#xC815;&#xC744; &#xD1B5;&#xD574; CopyFileW() &#xD568;&#xC218; &#xBD80;&#xADFC;&#xC5D0; bp&#xB97C; &#xAC78;&#xACE0; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image12.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image13.png" srcset="/img/loading.gif" alt></p>
<p>&#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; Dst &#xC5D0;&#xB294; &#xC55E;&#xC11C; &#xB9D0;&#xD55C; updater &#xACBD;&#xB85C;&#xAC00; &#xC368;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image14.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB9AC;&#xACE0; Src&#xC5D0;&#xB294; &#xBCF5;&#xC0AC;&#xD560; &#xD30C;&#xC77C; &#xACBD;&#xB85C;&#xAC00; &#xADF8;&#xB300;&#xB85C; &#xB4E4;&#xC5B4;&#xAC00; &#xC788;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xAC00;&#xC9DC; updater.exe &#xB294; System &#xD1A0;&#xD070;&#xC73C;&#xB85C; cmd&#xB97C; &#xCF1C;&#xAC8C; &#xD574;&#xC8FC;&#xB294; &#xC545;&#xC131; &#xD30C;&#xC77C;&#xC774;&#xACE0;, &#xC774;&#xB807;&#xAC8C; &#xBCF5;&#xC0AC;&#xAC00; &#xB418;&#xBA74;&#xC11C; LPE&#xC5D0; &#xC131;&#xACF5;&#xD558;&#xAC8C; &#xB418;&#xB294;&#xAC83;&#xC774;&#xC8E0;!</p>
<h2 id="2-Registry-&#xAD00;&#xB828;-API&#xB97C;-&#xD65C;&#xC6A9;&#xD55C;-LPE"><a href="#2-Registry-&#xAD00;&#xB828;-API&#xB97C;-&#xD65C;&#xC6A9;&#xD55C;-LPE" class="headerlink" title="2. Registry &#xAD00;&#xB828; API&#xB97C; &#xD65C;&#xC6A9;&#xD55C; LPE"></a>2. Registry &#xAD00;&#xB828; API&#xB97C; &#xD65C;&#xC6A9;&#xD55C; LPE</h2><hr>
<p>&#xC790;, &#xB2E4;&#xC74C;&#xC740; Registry &#xAD00;&#xB828; API&#xB4E4;&#xC744; &#xC0B4;&#xD3B4;&#xBCFC;&#xAE4C;&#xC694;! </p>
<h3 id="2-1-SHSetValueW"><a href="#2-1-SHSetValueW" class="headerlink" title="2-1. SHSetValueW()"></a>2-1. SHSetValueW()</h3><pre><code class="hljs cpp"><span class="hljs-function">LSTATUS <span class="hljs-title">SHSetValueW</span><span class="hljs-params">(</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]           HKEY    hkey,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional] LPCWSTR pszSubKey,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional] LPCWSTR pszValue,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]           DWORD   dwType,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional] LPCVOID pvData,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]           DWORD   cbData</span></span>
<span class="hljs-function"><span class="hljs-params">)</span></span>;</code></pre>
<p><code>SHSetValueW()</code> &#xD568;&#xC218;&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xC758; &#xAC12;&#xC744; &#xC124;&#xC815;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC744; &#xD558;&#xB294;&#xB370;&#xC694;, &#xC774; &#xC778;&#xC790; &#xC138;&#xD305;&#xC744; &#xBCF4;&#xBA74; SubKey&#xC640; ValueName &#xC744; &#xC124;&#xC815;&#xD574;&#xC904; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xAC8C; &#xBB34;&#xC2A8; &#xB9D0;&#xC774;&#xB0D0;, &#xC774; &#xC778;&#xC790;&#xB4E4;&#xC744; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xBA74; &#xC6D0;&#xD558;&#xB294; &#xACBD;&#xB85C;&#xC758; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC;&#xC758; Value &#xAC12;&#xC744; &#xB9C8;&#xC74C;&#xB300;&#xB85C; &#xBC14;&#xAFC0; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xB73B;&#xC774;&#xACA0;&#xC8E0;!! &#xC9C1;&#xC811; &#xCF54;&#xB4DC;&#xB97C; &#xD1B5;&#xD574; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp"><span class="hljs-keyword">case</span> <span class="hljs-number">0x102C</span>:
{
  <span class="hljs-keyword">const</span> WCHAR *SubKey    = (<span class="hljs-keyword">const</span> WCHAR *)(input + <span class="hljs-number">16</span>);    <span class="hljs-comment">// attacker-controlled</span>
  <span class="hljs-keyword">const</span> WCHAR *ValueName = (<span class="hljs-keyword">const</span> WCHAR *)(input + <span class="hljs-number">4176</span>);  <span class="hljs-comment">// attacker-controlled</span>
  HKEY RootKey           = *(HKEY *)(input + <span class="hljs-number">8</span>);           <span class="hljs-comment">// attacker-controlled</span>
  DWORD Type             = *(DWORD *)(input + <span class="hljs-number">0xA094</span>);     <span class="hljs-comment">// attacker-controlled</span>
  LPCVOID Data           = (LPCVOID)(input + <span class="hljs-number">0x2090</span>);      <span class="hljs-comment">// attacker-controlled</span>
  DWORD DataSize         = *(DWORD *)(input + <span class="hljs-number">0xA090</span>);     <span class="hljs-comment">// attacker-controlled</span>

  <span class="hljs-comment">// ... (RootKey == HKCR &#xB798;&#xD551; / HKCU TLS &#xCE58;&#xD658; / &#xD14C;&#xC774;&#xBE14; &#xD578;&#xB4E4; &#xB85C;&#xC9C1; &#xB4F1;)</span>

  LSTATUS st = SHSetValueW(
      RootKey,
      SubKey,
      ValueName,
      Type,
      Data,
      DataSize
  );

  DWORD err = GetLastError();
  <span class="hljs-comment">// ... (&#xC751;&#xB2F5; Buffer&#xC5D0; st/err &#xB2F4;&#xC544;&#xC11C; &#xBC18;&#xD658;)</span>
  WriteFile(a3, Buffer, <span class="hljs-number">0x10018</span>u, &amp;written, <span class="hljs-number">0</span>);
  <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
}
</code></pre>
<p>case 0x102C &#xBD84;&#xAE30;&#xB85C; &#xAC00;&#xBA74; &#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C; SHSetValueW &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xC6D0;&#xD558;&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xAC12;&#xC744; &#xC124;&#xC815;&#xD574; &#xC904; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp">offset +<span class="hljs-number">0x0008</span> &#x2192; <span class="hljs-function">HKEY <span class="hljs-title">Root</span> <span class="hljs-params">(&#xC608;: HKEY_LOCAL_MACHINE)</span></span>
offset +0x0010 &#x2192; SubKey
offset +<span class="hljs-number">0x1050</span> &#x2192; ValueName
offset +<span class="hljs-number">0xA068</span> &#x2192; Type (REG_SZ &#xB4F1;)
offset +<span class="hljs-number">0x2090</span> &#x2192; Buffer (&#xC124;&#xC815;&#xD560; &#xAC12;)
offset +<span class="hljs-number">0xA064</span> &#x2192; Buffer size</code></pre>
<p>&#xC785;&#xB825; &#xAD6C;&#xC870;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<pre><code class="hljs cpp"><span class="hljs-keyword">if</span> (RootKey == HKEY_CLASSES_ROOT)
{
  <span class="hljs-comment">// &#xB0B4;&#xBD80; &#xD074;&#xB798;&#xC2A4;&#xB85C; &#xB798;&#xD551;</span>
  CClassesRoot ctx;
  ctx.h1 = TlsGetValue(...);
  ctx.h2 = TlsGetValue(...);
  SHSetValueW(ctx.h1 <span class="hljs-keyword">or</span> h2, SubKey, ValueName, Type, Data, Size);
}
<span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (RootKey &amp; <span class="hljs-number">0x80000000</span>)  <span class="hljs-comment">// e.g., HKEY_LOCAL_MACHINE, HKEY_USERS &#xB4F1;</span>
{
  keyctx = get_handle_from_table(RootKey);
  SHSetValueW(keyctx, SubKey, ValueName, Type, Data, Size);
}
<span class="hljs-keyword">else</span>
{
  <span class="hljs-comment">// &#xC77C;&#xBC18; HKEY_CURRENT_USER &#xC77C; &#xACBD;&#xC6B0; TLS &#xAE30;&#xBC18; &#xD0A4;&#xB85C; &#xCE58;&#xD658;</span>
  <span class="hljs-keyword">if</span> (RootKey == HKEY_CURRENT_USER)
    RootKey = TlsGetValue(...);

  SHSetValueW(RootKey, SubKey, ValueName, Type, Data, Size);
}
</code></pre>
<p>&#xD575;&#xC2EC; &#xCDE8;&#xC57D; &#xB85C;&#xC9C1;&#xC740; &#xC704;&#xC640; &#xAC19;&#xC740;&#xB370;, &#xACB0;&#xAD6D; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC81C;&#xACF5;&#xD55C; &#xC784;&#xC758; HKEY + SubKey + Value + Data&#xAC00; System &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xADF8;&#xB300;&#xB85C; SHSetValueW &#xD568;&#xC218;&#xC758; &#xC778;&#xC790;&#xB85C; &#xB4E4;&#xC5B4;&#xAC11;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xC774;&#xBC88;&#xC5D0;&#xB3C4; &#xAC19;&#xC740; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; System &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xBA74;&#xC11C; Registry&#xC5D0; ImagePath&#xAC00; &#xC788;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xCC3E;&#xC544;&#xBCFC;&#xAE4C;&#xC694;?</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image15.png" srcset="/img/loading.gif" alt></p>
<p>&#xC800;&#xB294; &#xD0C0;&#xAC9F;&#xC73C;&#xB85C; MicrosoftEdgeElevationService &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC120;&#xC815;&#xD558;&#xC5EC; &#xC9C4;&#xD589;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. Process Monitor &#xB97C; &#xD1B5;&#xD574; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74;, Edge&#xB97C; &#xCF30;&#xC744; &#xB54C; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xC790;&#xB3D9;&#xC73C;&#xB85C; System &#xAD8C;&#xD55C;&#xC73C;&#xB85C; Load &#xB418;&#xB294;&#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image16.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8; &#xD6C4; &#xC774; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xC5B4;&#xB290; &#xACBD;&#xB85C;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294;&#xC9C0;, &#xC11C;&#xBE44;&#xC2A4;&#xC640; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD3B8;&#xC9D1;&#xAE30;&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image17.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image18.png" srcset="/img/loading.gif" alt></p>
<p>&#xC704; &#xC0AC;&#xC9C4;&#xACFC; &#xAC19;&#xC774; MicroSoftEdgeElevationService &#xC778; &#xAC83;&#xC744; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xACE0;, ImagePath &#xAC00; &#x201C;C:\Program Files (x86)\Microsoft\Edge\Application\138.0.3351.77\elevation_service.exe&#x201D; &#xC778; &#xAC83;&#xC744; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC81C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD2B8;&#xB9AC;&#xAC70; &#xD55C; &#xB4A4; &#xB2E4;&#xC2DC; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image19.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image20.png" srcset="/img/loading.gif" alt></p>
<p>&#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC11C;&#xBE44;&#xC2A4;&#xC758; Path&#xC640; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC;&#xC758; ImagePath&#xAC00; &#xBC14;&#xB010; &#xAC83;&#xC744; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!! &#xC774;&#xC81C; MicrosoftEdge&#xB97C; &#xC2E4;&#xD589;&#xC2DC;&#xD0A4;&#xBA74; System &#xAD8C;&#xD55C;&#xC744; &#xAC00;&#xC9C4; cmd&#xAC00; &#xCF1C;&#xC9C0;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;!</p>
<p>&#xC774;&#xBC88;&#xC5D0;&#xB3C4; &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xC548; &#xD574;&#xBCFC; &#xC218; &#xC5C6;&#xACA0;&#xC8E0;?</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image21.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image22.png" srcset="/img/loading.gif" alt></p>
<p>Value &#xBD80;&#xBD84;&#xC744; &#xBCF4;&#xBA74; ImagePath &#xAC00; &#xB4E4;&#xC5B4;&#xAC04; &#xAC83;&#xC744; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image23.png" srcset="/img/loading.gif" alt></p>
<p>SubKey &#xBD80;&#xBD84;&#xC744; &#xBCF4;&#xBA74; &#xC55E;&#xC5D0;&#xC11C; &#xB9D0;&#xD55C; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xACBD;&#xB85C;&#xAC00; &#xB4E4;&#xC5B4;&#xAC04; &#xAC83;&#xC744; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image24.png" srcset="/img/loading.gif" alt></p>
<p>&#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; key&#xB294; HKEY_LOCAL_MACHINE &#xB97C; &#xC758;&#xBBF8;&#xD558;&#xB294; 0x80000002 &#xAC00; &#xB4E4;&#xC5B4;&#xAC04; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC81C;&#xAC00; &#xC6D0;&#xD558;&#xB294; &#xB192;&#xC740; &#xACBD;&#xB85C;&#xC758; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; Image Path&#xB97C; &#xC6D0;&#xD558;&#xB294; &#xAC12;&#xC73C;&#xB85C; &#xBC14;&#xAFC0; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xB294; &#xAC83;&#xC774;&#xC8E0;!</p>
<h2 id="3-Service-&#xAD00;&#xB828;-API&#xB97C;-&#xD65C;&#xC6A9;&#xD55C;-LPE"><a href="#3-Service-&#xAD00;&#xB828;-API&#xB97C;-&#xD65C;&#xC6A9;&#xD55C;-LPE" class="headerlink" title="3. Service &#xAD00;&#xB828; API&#xB97C; &#xD65C;&#xC6A9;&#xD55C; LPE"></a>3. Service &#xAD00;&#xB828; API&#xB97C; &#xD65C;&#xC6A9;&#xD55C; LPE</h2><hr>
<p>&#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; Service &#xAD00;&#xB828; API&#xB97C; &#xC0B4;&#xD3B4;&#xBCFC;&#xAE4C;&#xC694;! &#xC774;&#xBC88;&#xC5D4; 3&#xAC00;&#xC9C0;&#xC758; API&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; LPE&#xAE4C;&#xC9C0; &#xB2EC;&#xC131; &#xD560; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;, &#xD558;&#xB098;&#xC529; &#xC0B4;&#xD3B4;&#xBCFC;&#xAE4C;&#xC694;?</p>
<h3 id="3-1-OpenSCManagerW"><a href="#3-1-OpenSCManagerW" class="headerlink" title="3.1 OpenSCManagerW()"></a>3.1 OpenSCManagerW()</h3><pre><code class="hljs cpp"><span class="hljs-function">SC_HANDLE <span class="hljs-title">OpenSCManagerW</span><span class="hljs-params">(</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional] LPCWSTR lpMachineName,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional] LPCWSTR lpDatabaseName,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]           DWORD   dwDesiredAccess</span></span>
<span class="hljs-function"><span class="hljs-params">)</span></span>;</code></pre>
<p>&#xBA3C;&#xC800; <code>OpenSCManagerW()</code> &#xD568;&#xC218;&#xC785;&#xB2C8;&#xB2E4;. &#xB4A4;&#xC5D0; &#xB098;&#xC62C; CreateService&#xB098; StartService&#xB294; &#xB418;&#xAC8C; &#xC9C1;&#xAD00;&#xC801;&#xC73C;&#xB85C; &#xBB34;&#xC2A8; &#xAE30;&#xB2A5;&#xC778;&#xC9C0; &#xC54C; &#xAC83; &#xAC19;&#xC9C0;&#xB9CC;, &#xC774; <code>OpenSCManagerW()</code> API&#xB97C; &#xBA3C;&#xC800; &#xC2E4;&#xD589;&#xD574;&#xC57C;&#xB9CC; &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xC8E0;!</p>
<p>&#xC11C;&#xBE44;&#xC2A4;&#xB294; &#x2018;SCM &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#x2019;&#xC5D0; &#xB4F1;&#xB85D;&#xB418;&#xB294; &#xAC1D;&#xCCB4;&#xB77C;&#xC11C;, &#xADF8; DB&#xC5D0; &#xB300;&#xD55C; &#xD578;&#xB4E4;(&#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;)&#xC774; &#xBA3C;&#xC800; &#xC788;&#xC5B4;&#xC57C; &#xC774;&#xD6C4; &#xC791;&#xC5C5;(&#xC0DD;&#xC131;/&#xC218;&#xC815;/&#xC2DC;&#xC791;)&#xC744; &#xD560; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8; &#xD578;&#xB4E4;&#xC744; &#xC5F4;&#xACE0; &#xBC18;&#xD658;&#xD574;&#xC8FC;&#xB294; &#xAC83;&#xC774; &#xBC14;&#xB85C; &#xC774; API&#xB77C;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp"><span class="hljs-keyword">case</span> <span class="hljs-number">0x103B</span>:
{
  <span class="hljs-keyword">const</span> WCHAR *Machine  = (<span class="hljs-keyword">const</span> WCHAR *)(input + <span class="hljs-number">8</span>);      <span class="hljs-comment">// attacker-controlled (optional)</span>
  <span class="hljs-keyword">const</span> WCHAR *Database = (<span class="hljs-keyword">const</span> WCHAR *)(input + <span class="hljs-number">0x1048</span>); <span class="hljs-comment">// attacker-controlled (optional)</span>
  DWORD Access          = *(DWORD *)(input + <span class="hljs-number">0x2088</span>);      <span class="hljs-comment">// attacker-controlled</span>

  <span class="hljs-comment">// ... (empty string -&gt; NULL &#xCC98;&#xB9AC; &#xB4F1;)</span>

  SC_HANDLE hScm = OpenSCManagerW(Machine, Database, Access);

  DWORD err = GetLastError();
  <span class="hljs-comment">// ... (&#xC751;&#xB2F5;&#xC5D0; hScm/err &#xBC18;&#xD658;)</span>
  WriteFile(a3, Buffer, <span class="hljs-number">0x10018</span>u, &amp;written, <span class="hljs-number">0</span>);
  <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
}
</code></pre>
<p>case 0x103B &#xBD84;&#xAE30;&#xB97C; &#xD1B5;&#xD574; &#xD574;&#xB2F9; API&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC5EC; &#xD578;&#xB4E4;&#xC744; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;,</p>
<ul>
<li>input + 8 &#x2192; lpMachineName</li>
<li>input + 0x1048 &#x2192; lpDatabaseName</li>
<li>input + 0x2088 &#x2192; dwDesiredAccess</li>
</ul>
<p>&#xC5EC;&#xAE30;&#xC11C; &#xC911;&#xC694;&#xD55C; &#xAC83;&#xC740; dwDesiredAccess &#xB85C;, SC_MANAGER_ALL_ACCESS(0xF003F) &#xB85C; &#xC124;&#xC815;&#xD574;&#xC918;&#xC57C; &#xD55C;&#xB2E4;&#xB294;&#xAC83;!</p>
<h3 id="3-2-CreateServiceW"><a href="#3-2-CreateServiceW" class="headerlink" title="3.2 CreateServiceW()"></a>3.2 <strong>CreateServiceW()</strong></h3><pre><code class="hljs cpp"><span class="hljs-function">SC_HANDLE <span class="hljs-title">CreateServiceW</span><span class="hljs-params">(</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]            SC_HANDLE hSCManager,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]            LPCWSTR   lpServiceName,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional]  LPCWSTR   lpDisplayName,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]            DWORD     dwDesiredAccess,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]            DWORD     dwServiceType,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]            DWORD     dwStartType,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]            DWORD     dwErrorControl,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional]  LPCWSTR   lpBinaryPathName,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional]  LPCWSTR   lpLoadOrderGroup,</span></span>
<span class="hljs-function"><span class="hljs-params">  [out, optional] LPDWORD   lpdwTagId,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional]  LPCWSTR   lpDependencies,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional]  LPCWSTR   lpServiceStartName,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional]  LPCWSTR   lpPassword</span></span>
<span class="hljs-function"><span class="hljs-params">)</span></span>;</code></pre>
<p>&#xADF8;&#xB7FC; &#xC774;&#xC81C; &#xD578;&#xB4E4;&#xB3C4; &#xC5BB;&#xC5C8;&#xC73C;&#xB2C8;, Service&#xB97C; &#xC0DD;&#xC131;&#xD574;&#xBCFC;&#xAE4C;&#xC694;?</p>
<pre><code class="hljs cpp"><span class="hljs-keyword">case</span> <span class="hljs-number">0x103F</span>:
{
  SC_HANDLE hScm = *(SC_HANDLE *)(input + <span class="hljs-number">8</span>);

  <span class="hljs-keyword">const</span> WCHAR *SvcName    = (<span class="hljs-keyword">const</span> WCHAR *)(input + <span class="hljs-number">16</span>);     <span class="hljs-comment">// attacker-controlled</span>
  <span class="hljs-keyword">const</span> WCHAR *DispName   = (<span class="hljs-keyword">const</span> WCHAR *)(input + <span class="hljs-number">4176</span>);   <span class="hljs-comment">// attacker-controlled</span>
  <span class="hljs-keyword">const</span> WCHAR *BinPath    = (<span class="hljs-keyword">const</span> WCHAR *)(input + <span class="hljs-number">8352</span>);   <span class="hljs-comment">// attacker-controlled</span>

  DWORD DesiredAccess     = *(DWORD *)(input + <span class="hljs-number">0x2090</span>);      <span class="hljs-comment">// attacker-controlled</span>
  DWORD ServiceType       = *(DWORD *)(input + <span class="hljs-number">0x2094</span>);      <span class="hljs-comment">// attacker-controlled</span>
  DWORD StartType         = *(DWORD *)(input + <span class="hljs-number">0x2098</span>);      <span class="hljs-comment">// attacker-controlled</span>
  DWORD ErrorControl      = *(DWORD *)(input + <span class="hljs-number">0x209C</span>);      <span class="hljs-comment">// attacker-controlled</span>

  <span class="hljs-comment">// ... (Group/Deps/StartName/Password &#xD3EC;&#xC778;&#xD130; &#xC815;&#xB9AC; &#xBC0F; NULL &#xCC98;&#xB9AC;)</span>

  SC_HANDLE hSvc = CreateServiceW(
      hScm,
      SvcName,
      DispName,
      DesiredAccess,
      ServiceType,
      StartType,
      ErrorControl,
      BinPath,
      <span class="hljs-comment">/* ... */</span> <span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">0</span>
  );

  DWORD err = GetLastError();
  <span class="hljs-comment">// ... (&#xC751;&#xB2F5;&#xC5D0; hSvc/err &#xBC18;&#xD658;)</span>
  WriteFile(a3, Buffer, <span class="hljs-number">0x10018</span>u, &amp;written, <span class="hljs-number">0</span>);
  <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
}
</code></pre>
<p>case 0x103F &#xBD84;&#xAE30;&#xC5D0;&#xC11C; CreateServiceW() &#xB85C; &#xC9C1;&#xC811; &#xC784;&#xC758; &#xD30C;&#xC77C;&#xC744; &#xC11C;&#xBE44;&#xC2A4;&#xB85C; &#xB4F1;&#xB85D;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<ul>
<li>input + 0x08 &#x2192; <code>hSCManager</code><ul>
<li><code>SC_HANDLE</code> (&#xC774;&#xC804; <code>0x103B</code> &#xD638;&#xCD9C;&#xB85C; &#xC5BB;&#xC740; SCM &#xD578;&#xB4E4;)</li>
</ul>
</li>
<li>input + 0x10 &#x2192; <code>lpServiceName</code><ul>
<li><code>LPCWSTR</code> &#xC11C;&#xBE44;&#xC2A4; &#xB0B4;&#xBD80; &#xC774;&#xB984; (&#xC608;: L&#x201D;LPE&#x201D;)</li>
</ul>
</li>
<li>input + 0x1050 &#x2192; <code>lpDisplayName</code><ul>
<li><code>LPCWSTR</code> &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xBCF4;&#xC77C; &#xC11C;&#xBE44;&#xC2A4; &#xC774;&#xB984; (&#xC608;: L&#x201D;My Payload Service&#x201D;)</li>
</ul>
</li>
<li>input + 0x2090 &#x2192; <code>dwDesiredAccess</code><ul>
<li><code>DWORD</code> &#xC811;&#xADFC;&#xAD8C;&#xD55C; &#xD50C;&#xB798;&#xADF8; (&#xC608;: <code>SERVICE_ALL_ACCESS</code> = 0xF01FF)</li>
</ul>
</li>
<li>input + 0x2094 &#x2192; <code>dwServiceType</code><ul>
<li><code>DWORD</code> &#xC11C;&#xBE44;&#xC2A4; &#xD0C0;&#xC785; (&#xC608;: <code>SERVICE_WIN32_OWN_PROCESS</code> = 0x10)</li>
</ul>
</li>
<li>input + 0x2098 &#x2192; <code>dwStartType</code><ul>
<li><code>DWORD</code> &#xC2DC;&#xC791; &#xC720;&#xD615; (&#xC608;: <code>SERVICE_DEMAND_START</code> = 0x3)</li>
</ul>
</li>
<li>input + 0x209C &#x2192; <code>dwErrorControl</code><ul>
<li><code>DWORD</code> &#xC624;&#xB958; &#xC81C;&#xC5B4; (&#xC608;: <code>SERVICE_ERROR_NORMAL</code> = 0x1)</li>
</ul>
</li>
<li>input + 0x20A0 &#x2192; <code>lpBinaryPathName</code><ul>
<li><code>LPCWSTR</code> &#xC2E4;&#xD589; &#xD30C;&#xC77C; &#xACBD;&#xB85C; (&#xC608;: L&#x201D;C:\Temp\poc.exe&#x201D;)</li>
</ul>
</li>
<li>input + 0x30E0 &#x2192; <code>lpLoadOrderGroup</code><ul>
<li><code>LPCWSTR</code> &#xB85C;&#xB4DC; &#xC21C;&#xC11C; &#xADF8;&#xB8F9; (&#xC608;: L&#x201D;Base&#x201D;)</li>
</ul>
</li>
<li>input + 0x4120 &#x2192; <code>lpDependencies</code><ul>
<li><code>LPCWSTR</code> &#xC758;&#xC874; &#xC11C;&#xBE44;&#xC2A4; &#xB9AC;&#xC2A4;&#xD2B8;</li>
</ul>
</li>
<li>input + 0x5160 &#x2192; <code>lpServiceStartName</code><ul>
<li><code>LPCWSTR</code> &#xB85C;&#xADF8;&#xC628; &#xACC4;&#xC815; (&#xC608;: L&#x201D;NT AUTHORITY\System&#x201D;)</li>
</ul>
</li>
<li>input + 0x61A0 &#x2192; <code>lpPassword</code><ul>
<li><code>LPCWSTR</code> &#xD574;&#xB2F9; &#xACC4;&#xC815; &#xBE44;&#xBC00;&#xBC88;&#xD638; (&#xC5C6;&#xC73C;&#xBA74; NULL)</li>
</ul>
</li>
</ul>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xC0DD;&#xC131;&#xB9CC; &#xD55C;&#xB2E4;&#xACE0; &#xD574;&#xC11C; &#xC644;&#xBCBD;&#xD55C; LPE&#xB77C;&#xACE0; &#xD560; &#xC21C; &#xC5C6;&#xACA0;&#xC8E0;? &#xC774;&#xB97C; &#xC2E4;&#xD589;&#xD574;&#xC8FC;&#xB294; API &#xB610;&#xD55C; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="3-3-StartServiceW"><a href="#3-3-StartServiceW" class="headerlink" title="3.3 StartServiceW()"></a>3.3 <strong>StartServiceW()</strong></h3><pre><code class="hljs cpp"><span class="hljs-function">BOOL <span class="hljs-title">StartServiceW</span><span class="hljs-params">(</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]           SC_HANDLE hService,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]           DWORD     dwNumServiceArgs,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional] LPCWSTR   *lpServiceArgVectors</span></span>
<span class="hljs-function"><span class="hljs-params">)</span></span>;</code></pre>
<pre><code class="hljs cpp"><span class="hljs-keyword">case</span> <span class="hljs-number">0x1040</span>:
{
  SC_HANDLE hSvc = *(SC_HANDLE *)(input + <span class="hljs-number">8</span>);  <span class="hljs-comment">// attacker-controlled (handle from prior call)</span>

  BOOL ok = StartServiceW(hSvc, <span class="hljs-number">0</span>, <span class="hljs-literal">NULL</span>);

  DWORD err = GetLastError();
  <span class="hljs-comment">// ... (&#xC751;&#xB2F5; Buffer&#xC5D0; ok/err &#xB2F4;&#xC544;&#xC11C; &#xBC18;&#xD658;)</span>
  WriteFile(a3, Buffer, <span class="hljs-number">0x10018</span>u, &amp;written, <span class="hljs-number">0</span>);
  <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
}
</code></pre>
<p>&#xC774;&#xC81C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; Start &#xC2DC;&#xD0A4;&#xB294; case 0x1040 &#xBD84;&#xAE30;&#xB85C; StartServiceW() &#xB97C; &#xC2E4;&#xD589;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>input + 8 &#x2192; <code>hService</code> (<code>SC_HANDLE</code>)</li>
<li>dwNumServiceArgs &#x2192; <code>0</code> (&#xACE0;&#xC815;)</li>
<li>lpServiceArgVectors &#x2192; <code>NULL</code> (&#xACE0;&#xC815;)</li>
</ul>
<p>&#xC55E;&#xC11C; CreateServiceW() &#xC758; &#xBC18;&#xD658; &#xAC12;&#xC73C;&#xB85C; &#xBC1B;&#xC740; &#xD578;&#xB4E4;&#xC744; input + 8&#xC5D0; &#xB123;&#xC5B4; &#xC2E4;&#xD589;&#xC2DC;&#xD0A4;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;!</p>
<p>&#xC774;&#xBC88;&#xC5D4; &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC73C;&#xB85C; &#xBA3C;&#xC800; &#xD55C; &#xB2E8;&#xACC4; &#xD55C; &#xB2E8;&#xACC4; &#xD655;&#xC778;&#xD574;&#xBCFC;&#xAE4C;&#xC694;?</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image25.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA3C;&#xC800; OpenSCManagerW() &#xD568;&#xC218; &#xBD80;&#xADFC;&#xC5D0; bp&#xB97C; &#xAC78;&#xACE0; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image26.png" srcset="/img/loading.gif" alt></p>
<p>dwDesiredAccess &#xBD80;&#xBD84;&#xC5D0; &#xC800;&#xD76C;&#xAC00; &#xC9D1;&#xC5B4;&#xB123;&#xC740; SC_MANAGER_ALL_ACCESS(0xf003f) &#xAC00; &#xB4E4;&#xC5B4;&#xAC04; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC8E0;!</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image27.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xD6C4; &#xCD9C;&#xB825; &#xD654;&#xBA74;&#xC744; &#xBCF4;&#xBA74; hSCM &#xD578;&#xB4E4;&#xC744; &#xC81C;&#xB300;&#xB85C; &#xBC1B;&#xC544;&#xC624;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image28.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xC81C; CreateServiceW() &#xBD80;&#xADFC;&#xC5D0; bp&#xB97C; &#xAC78;&#xACE0; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image29.png" srcset="/img/loading.gif" alt></p>
<p>lpServiceStartName &#xC5D0;&#xB294; System &#xC744; &#xC801;&#xC5B4;&#xC8FC;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image30.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB9AC;&#xACE0; lpBinaryPathName &#xC5D0; &#xC800;&#xD76C;&#xAC00; &#xC11C;&#xBE44;&#xC2A4;&#xD654; &#xC2DC;&#xD0AC; &#xC545;&#xC131; &#xD30C;&#xC77C; &#xACBD;&#xB85C;&#xAC00; &#xC368;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image31.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xD6C4; &#xCD9C;&#xB825; &#xB8E8;&#xD2F4;&#xC744; &#xBCF4;&#xBA74; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xC0DD;&#xC131;&#xC774; &#xB418;&#xACE0;, &#xC11C;&#xBE44;&#xC2A4; &#xD578;&#xB4E4; &#xAC12;&#xB3C4; &#xC5BB;&#xC5B4;&#xC62C; &#xC218; &#xC788;&#xB294; &#xAC78; &#xBCFC; &#xC218; &#xC788;&#xC8E0;.</p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image32.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image33.png" srcset="/img/loading.gif" alt></p>
<p>&#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; LPE &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xC0DD;&#xACBC;&#xACE0;, &#xACBD;&#xB85C;&#xB3C4; &#xC545;&#xC131; &#xD30C;&#xC77C; &#xACBD;&#xB85C;&#xB85C; &#xB418;&#xC5B4; &#xC788;&#xB294; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC81C; StartServiceW() &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xC2E4;&#xD589;&#xB9CC; &#xC2DC;&#xD0A8;&#xB2E4;&#xBA74;? System &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC545;&#xC131; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xACA0;&#xC8E0;!!</p>
<h2 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h2><hr>
<p><img src="/2026/01/18/gongjae/WHS3-bughunting2/KR/image34.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xBC88; Part 2&#xC758; Named Pipe &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC5EC;&#xB7EC; LPE &#xBCA1;&#xD130;&#xC5D0; &#xB300;&#xD55C; &#xC124;&#xBA85;&#xC774; &#xC5EC;&#xB7EC;&#xBD84;&#xC5D0;&#xAC8C; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xC168;&#xC73C;&#xBA74; &#xC88B;&#xACA0;&#xB294;&#xB370;&#xC694;!! Named Pipe&#xC758; &#xAD8C;&#xD55C; &#xC124;&#xC815;&#xC73C;&#xB85C; &#xC778;&#xD574; medium &#xC720;&#xC800;&#xAC00; System &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xD589;&#xC704;&#xB97C; &#xD560; &#xC218; &#xC788;&#xB294; &#xC0C1;&#xD669;&#xB3C4; &#xC788;&#xB2E4;&#xB294; &#xC810;! &#xC4F0;&#xB2E4; &#xBCF4;&#xB2C8; &#xB108;&#xBB34; &#xACE0;&#xBD09;&#xBC25;&#xCC98;&#xB7FC; &#xC4F4; &#xAC83; &#xAC19;&#xC544; &#xBD84;&#xB7C9; &#xC870;&#xC808;&#xC5D0; &#xC2E4;&#x2026;&#xD328; &#xD55C; &#xAC83; &#xAC19;&#xC9C0;&#xB9CC;!! &#xADF8;&#xB798;&#xB3C4; &#xC774;&#xB7F0; &#xBC29;&#xC2DD;&#xC73C;&#xB85C;&#xB3C4; LPE&#xAC00; &#xAC00;&#xB2A5;&#xD558;&#xAD6C;&#xB098;!! &#xD558;&#xBA74;&#xC11C; &#xBD10;&#xC8FC;&#xC2DC;&#xBA74; &#xAC10;&#xC0AC;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; &#x1F609; &#xB2E4;&#xC74C;&#xC5D0;&#xB294; Windows LPE&#xC758; &#xAF43;&#xC774;&#xC790; Kernel Driver&#xC5D0;&#xC11C; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xB3CC;&#xC544;&#xC624;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;~ &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;!</p>
<h2 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h2><ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-openscmanagerw">https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-openscmanagerw</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/windows/win32/services/service-security-and-access-rights">https://learn.microsoft.com/ko-kr/windows/win32/services/service-security-and-access-rights</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-createservicew">https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-createservicew</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-startservicew">https://learn.microsoft.com/ko-kr/windows/win32/api/winsvc/nf-winsvc-startservicew</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/windows/win32/api/shlwapi/nf-shlwapi-shsetvaluew">https://learn.microsoft.com/ko-kr/windows/win32/api/shlwapi/nf-shlwapi-shsetvaluew</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/windows/win32/api/winbase/nf-winbase-copyfilew">https://learn.microsoft.com/ko-kr/windows/win32/api/winbase/nf-winbase-copyfilew</a></li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/LPE/">LPE</a>
                  
                  <a class="hover-with-bg" href="/tags/Windows/">Windows</a>
                  
                  <a class="hover-with-bg" href="/tags/BugHunting/">BugHunting</a>
                  
                  <a class="hover-with-bg" href="/tags/KernelDriver/">KernelDriver</a>
                  
                  <a class="hover-with-bg" href="/tags/NamedPipe/">NamedPipe</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_gongjae.jpg" srcset="/img/loading.gif" alt="gongjae">
                  </div>

                  <div class="link-text">
                    <div class="link-title">gongjae</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/gongjae">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2026/01/21/newp1ayer48/CVE-2025-48593/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2025-48593 : Android SDP DB    UAF  Zero-Click RCE</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2026/01/18/gongjae/WHS3-bughunting2/EN/">
                    <span class="hidden-mobile">[Research] Windows LPE Bug Hunting, Served by the Teams Youngest: Part 2 (EN)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2026/01/18/gongjae/WHS3-bughunting2/KR/';
        this.page.identifier = '/2026/01/18/gongjae/WHS3-bughunting2/KR/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research]    Windows LPE   Part 2 (KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
