

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;a href=&#34;#&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;/a&gt;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&lt;/h1&gt;&lt;p&gt;Time Travel Debugging(TTD)&amp;#xB294; 2017&amp;#xB144;&amp;#xC5D0; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; Windbg preview&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xC9C0; 3&amp;#xB144;&amp;#xC774;&amp;#xB098; &amp;#xC9C0;&amp;#xB0AC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC9C1; &amp;#xD55C;&amp;#xAE00;&amp;#xB85C; &amp;#xB41C; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xBB38;&amp;#xC11C;&amp;#xB294; &amp;#xBCC4;&amp;#xB85C; &amp;#xC5C6;&amp;#xB294; &amp;#xAC70; &amp;#xAC19;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. windbg preview&amp;#xB97C; &amp;#xC4F4;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098; TTD&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xC544;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xC801;&amp;#xC5B4;&amp;#xC11C; &amp;#xADF8;&amp;#xB7F0;&amp;#xAC00; &amp;#xC2F6;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0;&amp;#x2026; windbg&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xCC98;&amp;#xC74C; &amp;#xD574;&amp;#xBCF8;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC98;&amp;#xC74C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC90; &amp;#xD55C;&amp;#xAE00;&amp;#xB85C; &amp;#xB41C; &amp;#xBB38;&amp;#xC11C;&amp;#xAC00; &amp;#xBB38;&amp;#xD131;&amp;#xC758; &amp;#xB192;&amp;#xC774;&amp;#xB97C; &amp;#xB0AE;&amp;#xCD94;&amp;#xB294;&amp;#xB370; &amp;#xD070; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#x201C;&amp;#xB0B4;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xBCF4;&amp;#xC9C0; &amp;#xBB50;&amp;#x201D;&amp;#xB77C;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C1;&amp;#xC811; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xBCFC;&amp;#xAE4C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xB7B5; Part 3&amp;#xAE4C;&amp;#xC9C0; &amp;#xC0DD;&amp;#xAC01; &amp;#xC911;&amp;#xC774;&amp;#xACE0;, Part 4&amp;#xAE4C;&amp;#xC9C0; &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Part 1 : &amp;#xAC04;&amp;#xB2E8; &amp;#xC18C;&amp;#xAC1C; &amp;#xBC0F; &amp;#xCCAB;&amp;#xC778;&amp;#xC0C1;&lt;/li&gt;
&lt;li&gt;Part 2 : &amp;#xAD6C;&amp;#xBC84;&amp;#xC804;&amp;#xC758; open source&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xC2E4;&amp;#xC2B5;&lt;/li&gt;
&lt;li&gt;Part 3 : &amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF8; &amp;#xACBD;&amp;#xD5D8;&amp;#xB2F4;&lt;/li&gt;
&lt;li&gt;Part 4 : JavaScript&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xC790;&amp;#xB3D9;&amp;#xD654; &amp;#xBC0F; &amp;#xACE0;&amp;#xC624;&amp;#xC624;&amp;#xAE09; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Time-Travel-Debugging&#34;&gt;&lt;a href=&#34;#Time-Travel-Debugging&#34; class=&#34;headerlink&#34; title=&#34;Time Travel Debugging&#34;&gt;&lt;/a&gt;Time Travel Debugging&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBD88;&amp;#xD604;&amp;#xB4EF;&amp;#xC774; &amp;#xACFC;&amp;#xAC70;&amp;#xC5D0; &amp;#xC800;&amp;#xC9C0;&amp;#xB978; &amp;#xC2E4;&amp;#xC218; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xBD88; &amp;#xD0A5;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740; &amp;#xACBD;&amp;#xD5D8;&amp;#xC744; &amp;#xB204;&amp;#xAD6C;&amp;#xB098; &amp;#xD55C; &amp;#xBC88;&amp;#xCBE4;&amp;#xC740; &amp;#xD574;&amp;#xBD24;&amp;#xC744;&amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACFC;&amp;#xAC70;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00; &amp;#xBAA8;&amp;#xB450; &amp;#xC5C6;&amp;#xB358; &amp;#xC77C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218;&amp;#xB9CC; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xC88B;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;. &amp;#xBB3C;&amp;#xB860; &amp;#xADF8;&amp;#xAC8C; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC774; &amp;#xB354;&amp;#xC6B1; &amp;#xAC00;&amp;#xC2B4;&amp;#xC744; &amp;#xD6C4;&amp;#xBCBC; &amp;#xD30C;&amp;#xBA70; &amp;#xC0AC;&amp;#xB78C;&amp;#xC744; &amp;#xBBF8;&amp;#xCE58;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Microsoft&amp;#xC758; Debugging Experience&amp;#xD300;&amp;#xC740; Debugging&amp;#xC758; &amp;#xD55C;&amp;#xC5D0;&amp;#xC120; &amp;#xACFC;&amp;#xAC70;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00; &amp;#xC800;&amp;#xC9C0;&amp;#xB978; &amp;#xC2E4;&amp;#xC218;&amp;#xB97C; &amp;#xB9CC;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Time Travel Debugging(TTD), is a tool that allows you to record an execution of your process running, then replay it later both forwards and backwards.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;TTD&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#x201C;&amp;#xB418;&amp;#xAC10;&amp;#xAE30;(rewind)&amp;#x201D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9E4;&amp;#xBC88; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xC7AC; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xB294; &amp;#xBC88;&amp;#xAC70;&amp;#xB85C;&amp;#xC6C0;&amp;#xC744; &amp;#xB35C;&amp;#xACE0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; MS &amp;#xC2A4;&amp;#xD1A0;&amp;#xC5B4;&amp;#xC5D0;&amp;#xC11C; windbg preview&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB9CC;&amp;#xC73C;&amp;#xB85C; TTD&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB2C8;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB2C8;&amp;#xC544;&amp;#xB2C8; &amp;#xBB34;&amp;#xB8CC;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694; &amp;#xC190;&amp;#xB2D8;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778;-&amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778;-&amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&#34;&gt;&lt;/a&gt;&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&lt;/h1&gt;&lt;h2 id=&#34;&amp;#xAD00;&amp;#xB9AC;&amp;#xC790;-&amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C;-&amp;#xC2E4;&amp;#xD589;&#34;&gt;&lt;a href=&#34;#&amp;#xAD00;&amp;#xB9AC;&amp;#xC790;-&amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C;-&amp;#xC2E4;&amp;#xD589;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&#34;&gt;&lt;/a&gt;&amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC758; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xB179;&amp;#xD654;&amp;#xD574; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; Trace file(&amp;#xC774;&amp;#xD558; &lt;code&gt;.run&lt;/code&gt;)&amp;#xC744; &amp;#xC539;&amp;#xACE0; &amp;#xB72F;&amp;#xACE0; &amp;#xB9DB;&amp;#xBCF4;&amp;#xACE0; &amp;#xC990;&amp;#xAE34;&amp;#xB2E4;&amp;#xB294; &amp;#xAC8C; TTD&amp;#xC758; &amp;#xB9E4;&amp;#xB825;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC804;&amp;#xC5D0; &amp;#xC6B0;&amp;#xC120; windbg preview&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC154;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Input/Output &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1;&amp;#xC744; &amp;#xAE30;&amp;#xB85D;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xC774;&amp;#xBBF8; &amp;#xC874;&amp;#xC7AC;&amp;#xD574;&amp;#xC654;&amp;#xC9C0;&amp;#xB9CC; TTD&amp;#xB294; &amp;#xC774;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC880; &amp;#xB354; &amp;#xD655;&amp;#xC7A5;&amp;#xB41C; &amp;#xAC1C;&amp;#xB150;&amp;#xC73C;&amp;#xB85C;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xAE30;&amp;#xB85D;&amp;#xD574; &lt;code&gt;.run&lt;/code&gt;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC0C1;&amp;#xB300;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Trace-file-&amp;#xB179;&amp;#xD654;&amp;#xD558;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#Trace-file-&amp;#xB179;&amp;#xD654;&amp;#xD558;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;Trace file &amp;#xB179;&amp;#xD654;&amp;#xD558;&amp;#xAE30;&#34;&gt;&lt;/a&gt;Trace file &amp;#xB179;&amp;#xD654;&amp;#xD558;&amp;#xAE30;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;[&amp;#xC0C1;&amp;#xB2E8; &amp;#xBA54;&amp;#xB274;] &amp;gt; [&amp;#xD30C;&amp;#xC77C;] &amp;gt; [Launch executable (advanced)] &amp;gt; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C; &amp;#xC120;&amp;#xD0DD; &amp;gt; [Record with TTD &amp;#xCCB4;&amp;#xD06C; &amp;#xBC15;&amp;#xC2A4;]&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC774; &amp;#xB420; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD574;&amp;#xC900; &amp;#xB4A4; Record with Time Trabel Debugging&amp;#xB97C; &amp;#xCCB4;&amp;#xD06C;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;.run&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC740; &lt;code&gt;C:\\Users\\username\\Documents&lt;/code&gt;&amp;#xC5D0; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6D0;&amp;#xD558;&amp;#xC2E0;&amp;#xB2E4;&amp;#xBA74; &amp;#xC0DD;&amp;#xC131; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xBC14;&amp;#xAFB8;&amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;.run&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815; &amp;#xD6C4; Record &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB204;&amp;#xB974;&amp;#xC2DC;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xB179;&amp;#xD654;&amp;#xAC00; &amp;#xC2DC;&amp;#xC791;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F;&amp;#xC758; &amp;#xB179;&amp;#xD654;&amp;#xAC00; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; &amp;#xD31D;&amp;#xC5C5;&amp;#xCC3D;&amp;#xC774; &amp;#xB72C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB179;&amp;#xD654;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD31D;&amp;#xC5C5;&amp;#xCC3D;&amp;#xC5D0;&amp;#xC120; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;, &amp;#xB179;&amp;#xD654; &amp;#xCEE4;&amp;#xBA58;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xBA70; &amp;#xC774; &amp;#xB179;&amp;#xD654;&amp;#xAC00; &amp;#xC9C4;&amp;#xC815; &amp;#xB0B4;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB179;&amp;#xD654;&amp;#xAC00; &amp;#xB9DE;&amp;#xB294;&amp;#xC9C0; &amp;#xCD5C;&amp;#xC885; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBB3C;&amp;#xB860; &amp;#xC774; &amp;#xD31D;&amp;#xC5C5;&amp;#xCC3D;&amp;#xC774; &amp;#xB72C;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8;&amp;#xB7F0; &amp;#xAC74; &amp;#xC2E0;&amp;#xACBD; &amp;#xC4F0;&amp;#xC9C0; &amp;#xB9C8;&amp;#xC2DC;&amp;#xACE0; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xBE68;&amp;#xB9AC; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC288;&amp;#xB098; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xC7AC;&amp;#xD604;&amp;#xD574;&amp;#xC8FC;&amp;#xC154;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xC7A0;&amp;#xC2DC; &amp;#xB2E4;&amp;#xB8F0; &amp;#xB2E8;&amp;#xC810;&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xB4DC;&amp;#xB9AC;&amp;#xC790;&amp;#xBA74;  &lt;code&gt;.run&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xBE68;&amp;#xB9AC; &amp;#xCEE4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAE00;&amp;#xC744; &amp;#xC4F0;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC7AC;&amp;#xD604;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xB300;&amp;#xB7B5; 3~4&amp;#xCD08; &amp;#xC815;&amp;#xB3C4; &amp;#xAC78;&amp;#xB9AC;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC26C;&amp;#xB97C; &amp;#xB179;&amp;#xD654;&amp;#xD588;&amp;#xACE0; 1.5GB &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &lt;code&gt;.run&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD3C9;&amp;#xADE0;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC601;&amp;#xD654; &amp;#xD55C; &amp;#xD3B8;&amp;#xC774; 1.5GB&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC70;&amp;#xAE30;&amp;#xB2E4; &amp;#xCD94;&amp;#xAC00;&amp;#xB85C;  &lt;code&gt;.idx&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; 0.5GB&amp;#xB97C; &amp;#xCC28;&amp;#xC9C0;&amp;#xD558;&amp;#xB2C8; &amp;#xCD1D; 2GB&amp;#xB098; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xAD70;&amp;#xC694;. MSDOCS&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &lt;code&gt;.idx&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xBCF4;&amp;#xD1B5;  &lt;code&gt;.run&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; 2&amp;#xBC30; &amp;#xC815;&amp;#xB3C4;&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xC774; &lt;code&gt;.run&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xB9CC; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &amp;#xB2E4;&amp;#xC2DC; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xC7AC;&amp;#xD604;&amp;#xD558;&amp;#xB294; &amp;#xBC88;&amp;#xAC70;&amp;#xB85C;&amp;#xC6C0;&amp;#xC744; &amp;#xC5C6;&amp;#xC568; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBCF4;&amp;#xD1B5; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xB2E4; &amp;#xC2E4;&amp;#xC218;&amp;#xD55C;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xC774; &amp;#xBC84;&amp;#xADF8; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xC810;&amp;#xC744; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xBC84;&amp;#xB9AC;&amp;#xBA74; restart&amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xC2DC;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC04;&amp;#xD639; restart&amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC548; &amp;#xBA39;&amp;#xAC70;&amp;#xB098; &amp;#xB514;&amp;#xBC84;&amp;#xAC70; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xC7AC;&amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D4; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xB610;&amp;#xB2E4;&amp;#xC2DC; &amp;#xC7AC;&amp;#xD604;&amp;#xD574;&amp;#xC57C; &amp;#xD574;&amp;#xC11C; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xADC0;&amp;#xCC2E;&amp;#xC8E0;. &amp;#xC800;&amp;#xB294; &amp;#xC774;&amp;#xB7F0; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0; vm&amp;#xC758; &amp;#xC2A4;&amp;#xB0C5;&amp;#xC0F7;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &lt;code&gt;.bat&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xBC84;&amp;#xADF8; &amp;#xC7AC;&amp;#xD604;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xD654; &amp;#xD558;&amp;#xACE4; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xC6E9;&amp;#x2026;&lt;/p&gt;
&lt;h1 id=&#34;TTD-&amp;#xC4F0;&amp;#xC138;&amp;#xC694;-&amp;#xB450;&amp;#xBC88;-&amp;#xC4F0;&amp;#xC138;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#TTD-&amp;#xC4F0;&amp;#xC138;&amp;#xC694;-&amp;#xB450;&amp;#xBC88;-&amp;#xC4F0;&amp;#xC138;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;TTD &amp;#xC4F0;&amp;#xC138;&amp;#xC694;, &amp;#xB450;&amp;#xBC88; &amp;#xC4F0;&amp;#xC138;&amp;#xC694;&#34;&gt;&lt;/a&gt;TTD &amp;#xC4F0;&amp;#xC138;&amp;#xC694;, &amp;#xB450;&amp;#xBC88; &amp;#xC4F0;&amp;#xC138;&amp;#xC694;&lt;/h1&gt;&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; TTD&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF8; &amp;#xC81C;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; MS&amp;#xC5D0;&amp;#xC11C; &amp;#xB0B4;&amp;#xC138;&amp;#xC6B0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Re-zero&amp;#xBD80;&amp;#xD130;-&amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294;-&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xC6B0;&amp;#xC6E9;&#34;&gt;&lt;a href=&#34;#Re-zero&amp;#xBD80;&amp;#xD130;-&amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294;-&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xC6B0;&amp;#xC6E9;&#34; class=&#34;headerlink&#34; title=&#34;Re:zero&amp;#xBD80;&amp;#xD130; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;? &amp;#xC6B0;&amp;#xC6E9;&#34;&gt;&lt;/a&gt;Re:zero&amp;#xBD80;&amp;#xD130; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;? &amp;#xC6B0;&amp;#xC6E9;&lt;/h2&gt;&lt;p&gt;&amp;#xC544;&amp;#xAE4C; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB9B0; &amp;#xB300;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xC2DC;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB294; &amp;#xC77C;&amp;#xC740; &amp;#xC815;&amp;#xB9D0; &amp;#xBE48;&amp;#xBC88;&amp;#xD788; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB798;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC; idioth&amp;#xD615;&amp;#xC774; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC88B;&amp;#xC544;&amp;#xD558;&amp;#xB098; &amp;#xBD10;&amp;#xC694;. &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAC70; &amp;#xC885;&amp;#xB958;&amp;#xC640; &amp;#xC0C1;&amp;#xAD00;&amp;#xC5C6;&amp;#xC774; &amp;#xC870;&amp;#xAE08; &amp;#xB9CC;&amp;#xC838;&amp;#xBD24;&amp;#xB2E4; &amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC01;&amp;#xAC01; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC774; &amp;#xBB34;&amp;#xC2A8; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC775;&amp;#xC219;&amp;#xD560; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;GO : break point &amp;#xC704;&amp;#xCE58;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&lt;/li&gt;
&lt;li&gt;Step Out : &amp;#xD604;&amp;#xC7AC; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB05D;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC2E4;&amp;#xD589; &amp;#xD6C4; &amp;#xB9AC;&amp;#xD134;&lt;/li&gt;
&lt;li&gt;Step Into : instruction &amp;#xD55C;&amp;#xAC1C; &amp;#xC2E4;&amp;#xD589;, &amp;#xB9CC;&amp;#xC57D; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xBD80;&amp;#xB85C; &amp;#xC9C4;&amp;#xC785;&lt;/li&gt;
&lt;li&gt;Step Over : instruction &amp;#xD55C;&amp;#xAC1C; &amp;#xC2E4;&amp;#xD589;, &amp;#xB9CC;&amp;#xC57D; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB05D;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC2E4;&amp;#xD589;&amp;#xD6C4; &amp;#xB9AC;&amp;#xD134;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;GO&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; break point &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xC798;&amp;#xBABB;&amp;#xD588;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098;, Step Into&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xBD80;&amp;#xB85C; &amp;#xC9C4;&amp;#xC785;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0;&amp;#xC11C; Step Over&amp;#xB97C; &amp;#xD558;&amp;#xAC8C; &amp;#xB420; &amp;#xACBD;&amp;#xC6B0; &amp;#xB208;&amp;#xBB3C;&amp;#xC744; &amp;#xBA38;&amp;#xAE08;&amp;#xACE0; restart&amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB20C;&amp;#xB7EC;&amp;#xC57C; &amp;#xD558;&amp;#xC8E0;. &amp;#xC815;&amp;#xB9D0; &amp;#xC7A0;&amp;#xC2DC; &amp;#xC9D1;&amp;#xC911;&amp;#xC744; &amp;#xC548; &amp;#xD558;&amp;#xBA74; &amp;#xBC8C;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xC77C;&amp;#xC774;&amp;#xB77C; &amp;#xC9DC;&amp;#xC99D; &amp;#xB098;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0; break point&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC5EC;&amp;#xAC04; &amp;#xADC0;&amp;#xCC2E;&amp;#xC740; &amp;#xAC8C; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. TTD&amp;#xB294; &amp;#xC774;&amp;#xB7F0; &amp;#xBD88;&amp;#xD3B8;&amp;#xD568;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD574;&amp;#xACB0;&amp;#xD588;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;h2 id=&#34;Reverse-Flow-Control&#34;&gt;&lt;a href=&#34;#Reverse-Flow-Control&#34; class=&#34;headerlink&#34; title=&#34;Reverse Flow Control&#34;&gt;&lt;/a&gt;Reverse Flow Control&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;TTD&amp;#xB294; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; Flow Control &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xB4A4;&amp;#xC9D1;&amp;#xC740; Reverse Flow Control&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB0E5; &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xAC70;&amp;#xAFB8;&amp;#xB85C; &amp;#xAC70;&amp;#xC2AC;&amp;#xB7EC; &amp;#xC62C;&amp;#xB7EC;&amp;#xAC08; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xAE4C; &amp;#xB9D0;&amp;#xD55C; &amp;#xB300;&amp;#xB85C; Step Into&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0;&amp;#xC11C; Step Over&amp;#xB97C; &amp;#xD574;&amp;#xBC84;&amp;#xB824;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xB2E4;&amp;#xBA74; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; Step Over Back &amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xACB0;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Time-Travel-Position&#34;&gt;&lt;a href=&#34;#Time-Travel-Position&#34; class=&#34;headerlink&#34; title=&#34;Time Travel Position&#34;&gt;&lt;/a&gt;Time Travel Position&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xD604;&amp;#xC7AC; program counter &amp;#xC704;&amp;#xCE58;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; intruction&amp;#xC744; &amp;#xAC70;&amp;#xC2AC;&amp;#xB7EC; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xB294; &amp;#xAC8C; &amp;#xB05D;&amp;#xC774;&amp;#xB0D0;? &amp;#xADF8;&amp;#xB7AC;&amp;#xB2E4;&amp;#xBA74; &amp;#xC2DC;&amp;#xAC04;&amp;#xC5EC;&amp;#xD589;(Time Travel)&amp;#xC774;&amp;#xB780; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xBD99;&amp;#xC9C4; &amp;#xC54A;&amp;#xC558;&amp;#xACA0;&amp;#xC8E0;. &amp;#xB179;&amp;#xD654; &amp;#xC2DC;&amp;#xC791;&amp;#xBD80;&amp;#xD130; &amp;#xB179;&amp;#xD654; &amp;#xC885;&amp;#xB8CC; &amp;#xC2DC;&amp;#xC810;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; instruction&amp;#xB9C8;&amp;#xB2E4; Time Travel Position(&amp;#xC774;&amp;#xD558; TTP)&amp;#xC774;&amp;#xB780; &amp;#xAC12;&amp;#xC774; &amp;#xB9E4;&amp;#xACA8;&amp;#xC9C0;&amp;#xB294;&amp;#xB370; break point&amp;#xC758; &amp;#xC0C1;&amp;#xC704; &amp;#xD638;&amp;#xD658;&amp;#xC774;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &lt;code&gt;fabulous()&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC788;&amp;#xACE0; &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xAC00; 16&amp;#xBC88;&amp;#xC9F8; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xB3D9;&amp;#xC801; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC704;&amp;#xD574; &lt;code&gt;fabulous()&lt;/code&gt;&amp;#xD568;&amp;#xC218; &amp;#xC5D4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xC5D0; break point&amp;#xB97C; &amp;#xAC78;&amp;#xC5C8;&amp;#xB2E4;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xC2DC;&amp;#xC810;&amp;#xBD80;&amp;#xD130; &amp;#xBC84;&amp;#xADF8; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC704;&amp;#xCE58;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD574;&amp;#xB2F9; break point&amp;#xC5D0; &amp;#xCD1D; 16&amp;#xBC88; &amp;#xAC78;&amp;#xB824;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC18;&amp;#xBA74; Time Travel Position&amp;#xC740; &amp;#xAC19;&amp;#xC740; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xAC19;&amp;#xC740; instruction&amp;#xC77C;&amp;#xC9C0;&amp;#xB77C;&amp;#xB3C4; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xC810;&amp;#xC774; &amp;#xB2E4;&amp;#xB974;&amp;#xB2E4;&amp;#xBA74; &amp;#xB2E4;&amp;#xB978; &amp;#xAC12;&amp;#xC774; &amp;#xB9E4;&amp;#xACA8;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;!tt&lt;/code&gt;&amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC784;&amp;#xC758;&amp;#xC758; TTP&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xD2B9;&amp;#xC815; &amp;#xC2DC;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xB418;&amp;#xB3CC;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Timeline&#34;&gt;&lt;a href=&#34;#Timeline&#34; class=&#34;headerlink&#34; title=&#34;Timeline&#34;&gt;&lt;/a&gt;Timeline&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;MS&amp;#xC5D0;&amp;#xC11C; &amp;#xB0B4;&amp;#xC138;&amp;#xC6B0;&amp;#xB294; TTD&amp;#xC758; &amp;#xC7A5;&amp;#xC810; &amp;#xC911; &amp;#xC81C;&amp;#xAC00; &amp;#xB2E8;&amp;#xC5F0; &amp;#xCD5C;&amp;#xACE0;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC740; &amp;#xBC14;&amp;#xB85C; &amp;#xD0C0;&amp;#xC784;&amp;#xB77C;&amp;#xC778;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xC74C;&amp;#xC5D4; &amp;#xB3D9;&amp;#xC601;&amp;#xC0C1; &amp;#xC7AC;&amp;#xC0DD; &amp;#xBC14;&amp;#xCC98;&amp;#xB7FC; &amp;#xB9C8;&amp;#xC6B0;&amp;#xC2A4;&amp;#xB85C; &amp;#xB4DC;&amp;#xB798;&amp;#xADF8;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD074;&amp;#xB9AD;&amp;#xD574;&amp;#xC11C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xAC08; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xC904; &amp;#xC54C;&amp;#xC558;&amp;#xB294;&amp;#xB370; &amp;#xBC18;&amp;#xC740; &amp;#xB9DE;&amp;#xACE0; &amp;#xBC18;&amp;#xC740; &amp;#xD2C0;&amp;#xB9B0; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774;&amp;#xB354;&amp;#xAD70;&amp;#xC694;. &amp;#xC804;&amp;#xCCB4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xD750;&amp;#xB984; &amp;#xC911; &amp;#xC8FC;&amp;#xC694; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;(Exception, Break Point, Function Call, Memory Access)&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xADF8;&amp;#xB9BC;&amp;#xC73C;&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xD574; &amp;#xC8FC;&amp;#xBA70; &amp;#xD0C0;&amp;#xC784;&amp;#xB77C;&amp;#xC778;&amp;#xC5D0; &amp;#xD45C;&amp;#xC2DC;&amp;#xB41C; &amp;#xAC01; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xD574;&amp;#xB2F9; &amp;#xC2DC;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xC774;&amp;#xC678;&amp;#xC758; &amp;#xACF3;&amp;#xC740; &amp;#xD074;&amp;#xB9AD;&amp;#xD574;&amp;#xB3C4; &amp;#xC774;&amp;#xB3D9; &amp;#xC548;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x314E;&amp;#x314E;;; &amp;#xB108;&amp;#xBB34; &amp;#xAE30;&amp;#xB300;&amp;#xAC00; &amp;#xCEF8;&amp;#xB098;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xC911; Memory Access &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D4; &amp;#xD2B9;&amp;#xC815; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xD2B9;&amp;#xC815; &amp;#xB3D9;&amp;#xC791;(RWX)&amp;#xC774; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C8; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xD0C0;&amp;#xC784;&amp;#xB77C;&amp;#xC778;&amp;#xC5D0; &amp;#xAE30;&amp;#xB85D;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCEE4;&amp;#xB7FD;&amp;#xC158; &amp;#xAC19;&amp;#xC740; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xB54C; &amp;#xC815;&amp;#xB9D0; &amp;#xC720;&amp;#xC6A9;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;? &amp;#xBBF8;&amp;#xB514;&amp;#xC5B4; &amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xC5B4; &amp;#xB531; &amp;#xB300;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB2E8;&amp;#xC810;&#34;&gt;&lt;a href=&#34;#&amp;#xB2E8;&amp;#xC810;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB2E8;&amp;#xC810;&#34;&gt;&lt;/a&gt;&amp;#xB2E8;&amp;#xC810;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB50;&amp;#x2026; &amp;#xC0AC;&amp;#xC2E4; &amp;#xB2E8;&amp;#xC810;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xB2E8;&amp;#xC810;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC55E;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xC7A5;&amp;#xC810;&amp;#xB4E4;&amp;#xC5D0; &amp;#xBE44;&amp;#xD558;&amp;#xBA74; &amp;#xC774; &amp;#xC815;&amp;#xB3C4;&amp;#xB294; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xAC10;&amp;#xC218;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Trace-File-&amp;#xD06C;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#Trace-File-&amp;#xD06C;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;Trace File &amp;#xD06C;&amp;#xAE30;&#34;&gt;&lt;/a&gt;Trace File &amp;#xD06C;&amp;#xAE30;&lt;/h2&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC7AC;&amp;#xD604;&amp;#xC5D0; 3~4&amp;#xCD08; &amp;#xAC78;&amp;#xB9AC;&amp;#xB294; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xB179;&amp;#xD654;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB85C; 2GB &amp;#xC815;&amp;#xB3C4;&amp;#xC758; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC6A9;&amp;#xB7C9;&amp;#xC744; &amp;#xCC28;&amp;#xC9C0;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC5C8;&amp;#xC8E0;? &amp;#xB9CC;&amp;#xC57D; &amp;#xBC84;&amp;#xADF8; &amp;#xC7AC;&amp;#xD604;&amp;#xC5D0;&amp;#xB9CC; &amp;#xBA87;&amp;#xC2ED; &amp;#xBD84;&amp;#xC744; &amp;#xC18C;&amp;#xBAA8;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xD6C4;&amp;#x2026;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xB179;&amp;#xD654;&amp;#xC911;-&amp;#xC624;&amp;#xBC84;&amp;#xD5E4;&amp;#xB4DC;&#34;&gt;&lt;a href=&#34;#&amp;#xB179;&amp;#xD654;&amp;#xC911;-&amp;#xC624;&amp;#xBC84;&amp;#xD5E4;&amp;#xB4DC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB179;&amp;#xD654;&amp;#xC911; &amp;#xC624;&amp;#xBC84;&amp;#xD5E4;&amp;#xB4DC;&#34;&gt;&lt;/a&gt;&amp;#xB179;&amp;#xD654;&amp;#xC911; &amp;#xC624;&amp;#xBC84;&amp;#xD5E4;&amp;#xB4DC;&lt;/h2&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xC0AC;&amp;#xC591;&amp;#xC774;&amp;#xB098; &amp;#xB179;&amp;#xD654; &amp;#xC911; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC591;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xCC9C;&amp;#xCC28;&amp;#xB9CC;&amp;#xBCC4;&amp;#xC778; &amp;#xB370;&amp;#xB2E4; &amp;#xBC29;&amp;#xAE08; &amp;#xC5B8;&amp;#xAE09;&amp;#xD55C; Trace File&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xC5D0; &amp;#xC9C1;&amp;#xACB0;&amp;#xB418;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB77C; &amp;#xC6EC;&amp;#xB9CC;&amp;#xD558;&amp;#xBA74; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC88B;&amp;#xC740; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xBE68;&amp;#xB9AC; &amp;#xB179;&amp;#xD654;&amp;#xB97C; &amp;#xB05D;&amp;#xB0B4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Read-only-Debugging&#34;&gt;&lt;a href=&#34;#Read-only-Debugging&#34; class=&#34;headerlink&#34; title=&#34;Read-only Debugging&#34;&gt;&lt;/a&gt;Read-only Debugging&lt;/h2&gt;&lt;p&gt;&amp;#xB2F9;&amp;#xC5F0;&amp;#xD55C; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xB179;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xB3CC;&amp;#xB824;&amp;#xBCF4;&amp;#xB294; &amp;#xAC8C; TTD&amp;#xB77C; &amp;#xB2E4;&amp;#xB978; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB4E4;&amp;#xCC98;&amp;#xB7FC; &amp;#xD2B9;&amp;#xC815; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB098; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xAC12;&amp;#xC744; &amp;#xC784;&amp;#xC2DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xB294; &amp;#xC791;&amp;#xC5C5;&amp;#xC740; &amp;#xBABB;&amp;#xD574;&amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xAD8C;&amp;#xD55C;&#34;&gt;&lt;a href=&#34;#&amp;#xAD8C;&amp;#xD55C;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAD8C;&amp;#xD55C;&#34;&gt;&lt;/a&gt;&amp;#xAD8C;&amp;#xD55C;&lt;/h2&gt;&lt;p&gt;&amp;#xC544;&amp;#xC9C1;&amp;#xAE4C;&amp;#xC9C4; TTD&amp;#xB85C; User-mode &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB9CC; &amp;#xB179;&amp;#xD654;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Kernel-mode &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xC548;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC740; &amp;#xAC70;&amp;#xC758; &amp;#xBB50; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC774;&amp;#xB77C;&amp;#xAE30; &amp;#xBCF4;&amp;#xB2E8; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00; &amp;#xC218;&amp;#xC900;&amp;#xC5D0;&amp;#xC11C; &amp;#xB05D;&amp;#xB09C; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00;&amp;#xC5D0;&amp;#xC120; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB9C8; &amp;#xAD6C;&amp;#xBC84;&amp;#xC804; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xBC84;&amp;#xADF8;&amp;#xB098; MSDOCS&amp;#xC5D0;&amp;#xC11C; TTD &amp;#xC5F0;&amp;#xC2B5;&amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &amp;#xC544;&amp;#xC608; &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574; &amp;#xBCFC; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACE0;, &amp;#xC544;&amp;#xC9C1; &amp;#xC815;&amp;#xD574;&amp;#xC9C4; &amp;#xAC74; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC800;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; TTD&amp;#xB97C; &amp;#xC775;&amp;#xD600;&amp;#xC62C;&amp;#xAC8C;&amp;#xC694;. &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB3C4; &amp;#xCC3E;&amp;#xACE0;&amp;#x2026; &amp;#x314E;&amp;#x314E;;;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] 시간을 여행하는 해커를 위한 안내서 Part1 - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;a href=&#34;#&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;/a&gt;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&lt;/h1&gt;&lt;p&gt;Time Travel Debugging(TTD)&amp;#xB294; 2017&amp;#xB144;&amp;#xC5D0; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; Windbg preview&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xC9C0; 3&amp;#xB144;&amp;#xC774;&amp;#xB098; &amp;#xC9C0;&amp;#xB0AC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC9C1; &amp;#xD55C;&amp;#xAE00;&amp;#xB85C; &amp;#xB41C; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xBB38;&amp;#xC11C;&amp;#xB294; &amp;#xBCC4;&amp;#xB85C; &amp;#xC5C6;&amp;#xB294; &amp;#xAC70; &amp;#xAC19;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. windbg preview&amp;#xB97C; &amp;#xC4F4;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098; TTD&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xC544;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xC801;&amp;#xC5B4;&amp;#xC11C; &amp;#xADF8;&amp;#xB7F0;&amp;#xAC00; &amp;#xC2F6;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0;&amp;#x2026; windbg&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xCC98;&amp;#xC74C; &amp;#xD574;&amp;#xBCF8;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC98;&amp;#xC74C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC90; &amp;#xD55C;&amp;#xAE00;&amp;#xB85C; &amp;#xB41C; &amp;#xBB38;&amp;#xC11C;&amp;#xAC00; &amp;#xBB38;&amp;#xD131;&amp;#xC758; &amp;#xB192;&amp;#xC774;&amp;#xB97C; &amp;#xB0AE;&amp;#xCD94;&amp;#xB294;&amp;#xB370; &amp;#xD070; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#x201C;&amp;#xB0B4;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xBCF4;&amp;#xC9C0; &amp;#xBB50;&amp;#x201D;&amp;#xB77C;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C1;&amp;#xC811; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xBCFC;&amp;#xAE4C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xB7B5; Part 3&amp;#xAE4C;&amp;#xC9C0; &amp;#xC0DD;&amp;#xAC01; &amp;#xC911;&amp;#xC774;&amp;#xACE0;, Part 4&amp;#xAE4C;&amp;#xC9C0; &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Part 1 : &amp;#xAC04;&amp;#xB2E8; &amp;#xC18C;&amp;#xAC1C; &amp;#xBC0F; &amp;#xCCAB;&amp;#xC778;&amp;#xC0C1;&lt;/li&gt;
&lt;li&gt;Part 2 : &amp;#xAD6C;&amp;#xBC84;&amp;#xC804;&amp;#xC758; open source&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xC2E4;&amp;#xC2B5;&lt;/li&gt;
&lt;li&gt;Part 3 : &amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF8; &amp;#xACBD;&amp;#xD5D8;&amp;#xB2F4;&lt;/li&gt;
&lt;li&gt;Part 4 : JavaScript&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xC790;&amp;#xB3D9;&amp;#xD654; &amp;#xBC0F; &amp;#xACE0;&amp;#xC624;&amp;#xC624;&amp;#xAE09; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Time-Travel-Debugging&#34;&gt;&lt;a href=&#34;#Time-Travel-Debugging&#34; class=&#34;headerlink&#34; title=&#34;Time Travel Debugging&#34;&gt;&lt;/a&gt;Time Travel Debugging&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBD88;&amp;#xD604;&amp;#xB4EF;&amp;#xC774; &amp;#xACFC;&amp;#xAC70;&amp;#xC5D0; &amp;#xC800;&amp;#xC9C0;&amp;#xB978; &amp;#xC2E4;&amp;#xC218; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xBD88; &amp;#xD0A5;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740; &amp;#xACBD;&amp;#xD5D8;&amp;#xC744; &amp;#xB204;&amp;#xAD6C;&amp;#xB098; &amp;#xD55C; &amp;#xBC88;&amp;#xCBE4;&amp;#xC740; &amp;#xD574;&amp;#xBD24;&amp;#xC744;&amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACFC;&amp;#xAC70;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00; &amp;#xBAA8;&amp;#xB450; &amp;#xC5C6;&amp;#xB358; &amp;#xC77C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218;&amp;#xB9CC; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xC88B;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;. &amp;#xBB3C;&amp;#xB860; &amp;#xADF8;&amp;#xAC8C; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC774; &amp;#xB354;&amp;#xC6B1; &amp;#xAC00;&amp;#xC2B4;&amp;#xC744; &amp;#xD6C4;&amp;#xBCBC; &amp;#xD30C;&amp;#xBA70; &amp;#xC0AC;&amp;#xB78C;&amp;#xC744; &amp;#xBBF8;&amp;#xCE58;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Microsoft&amp;#xC758; Debugging Experience&amp;#xD300;&amp;#xC740; Debugging&amp;#xC758; &amp;#xD55C;&amp;#xC5D0;&amp;#xC120; &amp;#xACFC;&amp;#xAC70;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00; &amp;#xC800;&amp;#xC9C0;&amp;#xB978; &amp;#xC2E4;&amp;#xC218;&amp;#xB97C; &amp;#xB9CC;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Time Travel Debugging(TTD), is a tool that allows you to record an execution of your process running, then replay it later both forwards and backwards.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;TTD&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#x201C;&amp;#xB418;&amp;#xAC10;&amp;#xAE30;(rewind)&amp;#x201D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9E4;&amp;#xBC88; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xC7AC; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xB294; &amp;#xBC88;&amp;#xAC70;&amp;#xB85C;&amp;#xC6C0;&amp;#xC744; &amp;#xB35C;&amp;#xACE0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; MS &amp;#xC2A4;&amp;#xD1A0;&amp;#xC5B4;&amp;#xC5D0;&amp;#xC11C; windbg preview&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB9CC;&amp;#xC73C;&amp;#xB85C; TTD&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB2C8;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB2C8;&amp;#xC544;&amp;#xB2C8; &amp;#xBB34;&amp;#xB8CC;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694; &amp;#xC190;&amp;#xB2D8;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778;-&amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778;-&amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&#34;&gt;&lt;/a&gt;&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&lt;/h1&gt;&lt;h2 id=&#34;&amp;#xAD00;&amp;#xB9AC;&amp;#xC790;-&amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C;-&amp;#xC2E4;&amp;#xD589;&#34;&gt;&lt;a href=&#34;#&amp;#xAD00;&amp;#xB9AC;&amp;#xC790;-&amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C;-&amp;#xC2E4;&amp;#xD589;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&#34;&gt;&lt;/a&gt;&amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC758; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xB179;&amp;#xD654;&amp;#xD574; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; Trace file(&amp;#xC774;&amp;#xD558; &lt;code&gt;.run&lt;/code&gt;)&amp;#xC744; &amp;#xC539;&amp;#xACE0; &amp;#xB72F;&amp;#xACE0; &amp;#xB9DB;&amp;#xBCF4;&amp;#xACE0; &amp;#xC990;&amp;#xAE34;&amp;#xB2E4;&amp;#xB294; &amp;#xAC8C; TTD&amp;#xC758; &amp;#xB9E4;&amp;#xB825;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC804;&amp;#xC5D0; &amp;#xC6B0;&amp;#xC120; windbg preview&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC154;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Input/Output &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1;&amp;#xC744; &amp;#xAE30;&amp;#xB85D;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xC774;&amp;#xBBF8; &amp;#xC874;&amp;#xC7AC;&amp;#xD574;&amp;#xC654;&amp;#xC9C0;&amp;#xB9CC; TTD&amp;#xB294; &amp;#xC774;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC880; &amp;#xB354; &amp;#xD655;&amp;#xC7A5;&amp;#xB41C; &amp;#xAC1C;&amp;#xB150;&amp;#xC73C;&amp;#xB85C;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xAE30;&amp;#xB85D;&amp;#xD574; &lt;code&gt;.run&lt;/code&gt;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC0C1;&amp;#xB300;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Trace-file-&amp;#xB179;&amp;#xD654;&amp;#xD558;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#Trace-file-&amp;#xB179;&amp;#xD654;&amp;#xD558;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;Trace file &amp;#xB179;&amp;#xD654;&amp;#xD558;&amp;#xAE30;&#34;&gt;&lt;/a&gt;Trace file &amp;#xB179;&amp;#xD654;&amp;#xD558;&amp;#xAE30;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;[&amp;#xC0C1;&amp;#xB2E8; &amp;#xBA54;&amp;#xB274;] &amp;gt; [&amp;#xD30C;&amp;#xC77C;] &amp;gt; [Launch executable (advanced)] &amp;gt; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C; &amp;#xC120;&amp;#xD0DD; &amp;gt; [Record with TTD &amp;#xCCB4;&amp;#xD06C; &amp;#xBC15;&amp;#xC2A4;]&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC774; &amp;#xB420; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD574;&amp;#xC900; &amp;#xB4A4; Record with Time Trabel Debugging&amp;#xB97C; &amp;#xCCB4;&amp;#xD06C;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;.run&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC740; &lt;code&gt;C:\\Users\\username\\Documents&lt;/code&gt;&amp;#xC5D0; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6D0;&amp;#xD558;&amp;#xC2E0;&amp;#xB2E4;&amp;#xBA74; &amp;#xC0DD;&amp;#xC131; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xBC14;&amp;#xAFB8;&amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;.run&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815; &amp;#xD6C4; Record &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB204;&amp;#xB974;&amp;#xC2DC;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xB179;&amp;#xD654;&amp;#xAC00; &amp;#xC2DC;&amp;#xC791;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F;&amp;#xC758; &amp;#xB179;&amp;#xD654;&amp;#xAC00; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; &amp;#xD31D;&amp;#xC5C5;&amp;#xCC3D;&amp;#xC774; &amp;#xB72C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB179;&amp;#xD654;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD31D;&amp;#xC5C5;&amp;#xCC3D;&amp;#xC5D0;&amp;#xC120; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;, &amp;#xB179;&amp;#xD654; &amp;#xCEE4;&amp;#xBA58;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xBA70; &amp;#xC774; &amp;#xB179;&amp;#xD654;&amp;#xAC00; &amp;#xC9C4;&amp;#xC815; &amp;#xB0B4;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB179;&amp;#xD654;&amp;#xAC00; &amp;#xB9DE;&amp;#xB294;&amp;#xC9C0; &amp;#xCD5C;&amp;#xC885; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBB3C;&amp;#xB860; &amp;#xC774; &amp;#xD31D;&amp;#xC5C5;&amp;#xCC3D;&amp;#xC774; &amp;#xB72C;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8;&amp;#xB7F0; &amp;#xAC74; &amp;#xC2E0;&amp;#xACBD; &amp;#xC4F0;&amp;#xC9C0; &amp;#xB9C8;&amp;#xC2DC;&amp;#xACE0; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xBE68;&amp;#xB9AC; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC288;&amp;#xB098; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xC7AC;&amp;#xD604;&amp;#xD574;&amp;#xC8FC;&amp;#xC154;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xC7A0;&amp;#xC2DC; &amp;#xB2E4;&amp;#xB8F0; &amp;#xB2E8;&amp;#xC810;&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xB4DC;&amp;#xB9AC;&amp;#xC790;&amp;#xBA74;  &lt;code&gt;.run&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xBE68;&amp;#xB9AC; &amp;#xCEE4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAE00;&amp;#xC744; &amp;#xC4F0;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC7AC;&amp;#xD604;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xB300;&amp;#xB7B5; 3~4&amp;#xCD08; &amp;#xC815;&amp;#xB3C4; &amp;#xAC78;&amp;#xB9AC;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC26C;&amp;#xB97C; &amp;#xB179;&amp;#xD654;&amp;#xD588;&amp;#xACE0; 1.5GB &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &lt;code&gt;.run&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD3C9;&amp;#xADE0;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC601;&amp;#xD654; &amp;#xD55C; &amp;#xD3B8;&amp;#xC774; 1.5GB&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC70;&amp;#xAE30;&amp;#xB2E4; &amp;#xCD94;&amp;#xAC00;&amp;#xB85C;  &lt;code&gt;.idx&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; 0.5GB&amp;#xB97C; &amp;#xCC28;&amp;#xC9C0;&amp;#xD558;&amp;#xB2C8; &amp;#xCD1D; 2GB&amp;#xB098; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xAD70;&amp;#xC694;. MSDOCS&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &lt;code&gt;.idx&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xBCF4;&amp;#xD1B5;  &lt;code&gt;.run&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; 2&amp;#xBC30; &amp;#xC815;&amp;#xB3C4;&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xC774; &lt;code&gt;.run&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xB9CC; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &amp;#xB2E4;&amp;#xC2DC; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xC7AC;&amp;#xD604;&amp;#xD558;&amp;#xB294; &amp;#xBC88;&amp;#xAC70;&amp;#xB85C;&amp;#xC6C0;&amp;#xC744; &amp;#xC5C6;&amp;#xC568; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBCF4;&amp;#xD1B5; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xB2E4; &amp;#xC2E4;&amp;#xC218;&amp;#xD55C;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xC774; &amp;#xBC84;&amp;#xADF8; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xC810;&amp;#xC744; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xBC84;&amp;#xB9AC;&amp;#xBA74; restart&amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xC2DC;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC04;&amp;#xD639; restart&amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC548; &amp;#xBA39;&amp;#xAC70;&amp;#xB098; &amp;#xB514;&amp;#xBC84;&amp;#xAC70; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xC7AC;&amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D4; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xB610;&amp;#xB2E4;&amp;#xC2DC; &amp;#xC7AC;&amp;#xD604;&amp;#xD574;&amp;#xC57C; &amp;#xD574;&amp;#xC11C; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xADC0;&amp;#xCC2E;&amp;#xC8E0;. &amp;#xC800;&amp;#xB294; &amp;#xC774;&amp;#xB7F0; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0; vm&amp;#xC758; &amp;#xC2A4;&amp;#xB0C5;&amp;#xC0F7;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &lt;code&gt;.bat&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xBC84;&amp;#xADF8; &amp;#xC7AC;&amp;#xD604;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xD654; &amp;#xD558;&amp;#xACE4; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xC6E9;&amp;#x2026;&lt;/p&gt;
&lt;h1 id=&#34;TTD-&amp;#xC4F0;&amp;#xC138;&amp;#xC694;-&amp;#xB450;&amp;#xBC88;-&amp;#xC4F0;&amp;#xC138;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#TTD-&amp;#xC4F0;&amp;#xC138;&amp;#xC694;-&amp;#xB450;&amp;#xBC88;-&amp;#xC4F0;&amp;#xC138;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;TTD &amp;#xC4F0;&amp;#xC138;&amp;#xC694;, &amp;#xB450;&amp;#xBC88; &amp;#xC4F0;&amp;#xC138;&amp;#xC694;&#34;&gt;&lt;/a&gt;TTD &amp;#xC4F0;&amp;#xC138;&amp;#xC694;, &amp;#xB450;&amp;#xBC88; &amp;#xC4F0;&amp;#xC138;&amp;#xC694;&lt;/h1&gt;&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; TTD&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF8; &amp;#xC81C;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; MS&amp;#xC5D0;&amp;#xC11C; &amp;#xB0B4;&amp;#xC138;&amp;#xC6B0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Re-zero&amp;#xBD80;&amp;#xD130;-&amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294;-&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xC6B0;&amp;#xC6E9;&#34;&gt;&lt;a href=&#34;#Re-zero&amp;#xBD80;&amp;#xD130;-&amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294;-&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xC6B0;&amp;#xC6E9;&#34; class=&#34;headerlink&#34; title=&#34;Re:zero&amp;#xBD80;&amp;#xD130; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;? &amp;#xC6B0;&amp;#xC6E9;&#34;&gt;&lt;/a&gt;Re:zero&amp;#xBD80;&amp;#xD130; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;? &amp;#xC6B0;&amp;#xC6E9;&lt;/h2&gt;&lt;p&gt;&amp;#xC544;&amp;#xAE4C; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB9B0; &amp;#xB300;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xC2DC;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB294; &amp;#xC77C;&amp;#xC740; &amp;#xC815;&amp;#xB9D0; &amp;#xBE48;&amp;#xBC88;&amp;#xD788; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB798;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC; idioth&amp;#xD615;&amp;#xC774; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC88B;&amp;#xC544;&amp;#xD558;&amp;#xB098; &amp;#xBD10;&amp;#xC694;. &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAC70; &amp;#xC885;&amp;#xB958;&amp;#xC640; &amp;#xC0C1;&amp;#xAD00;&amp;#xC5C6;&amp;#xC774; &amp;#xC870;&amp;#xAE08; &amp;#xB9CC;&amp;#xC838;&amp;#xBD24;&amp;#xB2E4; &amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC01;&amp;#xAC01; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC774; &amp;#xBB34;&amp;#xC2A8; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC775;&amp;#xC219;&amp;#xD560; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;GO : break point &amp;#xC704;&amp;#xCE58;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&lt;/li&gt;
&lt;li&gt;Step Out : &amp;#xD604;&amp;#xC7AC; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB05D;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC2E4;&amp;#xD589; &amp;#xD6C4; &amp;#xB9AC;&amp;#xD134;&lt;/li&gt;
&lt;li&gt;Step Into : instruction &amp;#xD55C;&amp;#xAC1C; &amp;#xC2E4;&amp;#xD589;, &amp;#xB9CC;&amp;#xC57D; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xBD80;&amp;#xB85C; &amp;#xC9C4;&amp;#xC785;&lt;/li&gt;
&lt;li&gt;Step Over : instruction &amp;#xD55C;&amp;#xAC1C; &amp;#xC2E4;&amp;#xD589;, &amp;#xB9CC;&amp;#xC57D; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB05D;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC2E4;&amp;#xD589;&amp;#xD6C4; &amp;#xB9AC;&amp;#xD134;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;GO&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; break point &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xC798;&amp;#xBABB;&amp;#xD588;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098;, Step Into&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xBD80;&amp;#xB85C; &amp;#xC9C4;&amp;#xC785;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0;&amp;#xC11C; Step Over&amp;#xB97C; &amp;#xD558;&amp;#xAC8C; &amp;#xB420; &amp;#xACBD;&amp;#xC6B0; &amp;#xB208;&amp;#xBB3C;&amp;#xC744; &amp;#xBA38;&amp;#xAE08;&amp;#xACE0; restart&amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB20C;&amp;#xB7EC;&amp;#xC57C; &amp;#xD558;&amp;#xC8E0;. &amp;#xC815;&amp;#xB9D0; &amp;#xC7A0;&amp;#xC2DC; &amp;#xC9D1;&amp;#xC911;&amp;#xC744; &amp;#xC548; &amp;#xD558;&amp;#xBA74; &amp;#xBC8C;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xC77C;&amp;#xC774;&amp;#xB77C; &amp;#xC9DC;&amp;#xC99D; &amp;#xB098;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0; break point&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC5EC;&amp;#xAC04; &amp;#xADC0;&amp;#xCC2E;&amp;#xC740; &amp;#xAC8C; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. TTD&amp;#xB294; &amp;#xC774;&amp;#xB7F0; &amp;#xBD88;&amp;#xD3B8;&amp;#xD568;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD574;&amp;#xACB0;&amp;#xD588;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;h2 id=&#34;Reverse-Flow-Control&#34;&gt;&lt;a href=&#34;#Reverse-Flow-Control&#34; class=&#34;headerlink&#34; title=&#34;Reverse Flow Control&#34;&gt;&lt;/a&gt;Reverse Flow Control&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;TTD&amp;#xB294; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; Flow Control &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xB4A4;&amp;#xC9D1;&amp;#xC740; Reverse Flow Control&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB0E5; &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xAC70;&amp;#xAFB8;&amp;#xB85C; &amp;#xAC70;&amp;#xC2AC;&amp;#xB7EC; &amp;#xC62C;&amp;#xB7EC;&amp;#xAC08; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xAE4C; &amp;#xB9D0;&amp;#xD55C; &amp;#xB300;&amp;#xB85C; Step Into&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0;&amp;#xC11C; Step Over&amp;#xB97C; &amp;#xD574;&amp;#xBC84;&amp;#xB824;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xB2E4;&amp;#xBA74; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; Step Over Back &amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xACB0;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Time-Travel-Position&#34;&gt;&lt;a href=&#34;#Time-Travel-Position&#34; class=&#34;headerlink&#34; title=&#34;Time Travel Position&#34;&gt;&lt;/a&gt;Time Travel Position&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xD604;&amp;#xC7AC; program counter &amp;#xC704;&amp;#xCE58;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; intruction&amp;#xC744; &amp;#xAC70;&amp;#xC2AC;&amp;#xB7EC; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xB294; &amp;#xAC8C; &amp;#xB05D;&amp;#xC774;&amp;#xB0D0;? &amp;#xADF8;&amp;#xB7AC;&amp;#xB2E4;&amp;#xBA74; &amp;#xC2DC;&amp;#xAC04;&amp;#xC5EC;&amp;#xD589;(Time Travel)&amp;#xC774;&amp;#xB780; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xBD99;&amp;#xC9C4; &amp;#xC54A;&amp;#xC558;&amp;#xACA0;&amp;#xC8E0;. &amp;#xB179;&amp;#xD654; &amp;#xC2DC;&amp;#xC791;&amp;#xBD80;&amp;#xD130; &amp;#xB179;&amp;#xD654; &amp;#xC885;&amp;#xB8CC; &amp;#xC2DC;&amp;#xC810;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; instruction&amp;#xB9C8;&amp;#xB2E4; Time Travel Position(&amp;#xC774;&amp;#xD558; TTP)&amp;#xC774;&amp;#xB780; &amp;#xAC12;&amp;#xC774; &amp;#xB9E4;&amp;#xACA8;&amp;#xC9C0;&amp;#xB294;&amp;#xB370; break point&amp;#xC758; &amp;#xC0C1;&amp;#xC704; &amp;#xD638;&amp;#xD658;&amp;#xC774;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &lt;code&gt;fabulous()&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC788;&amp;#xACE0; &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xAC00; 16&amp;#xBC88;&amp;#xC9F8; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xB3D9;&amp;#xC801; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC704;&amp;#xD574; &lt;code&gt;fabulous()&lt;/code&gt;&amp;#xD568;&amp;#xC218; &amp;#xC5D4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xC5D0; break point&amp;#xB97C; &amp;#xAC78;&amp;#xC5C8;&amp;#xB2E4;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xC2DC;&amp;#xC810;&amp;#xBD80;&amp;#xD130; &amp;#xBC84;&amp;#xADF8; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC704;&amp;#xCE58;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD574;&amp;#xB2F9; break point&amp;#xC5D0; &amp;#xCD1D; 16&amp;#xBC88; &amp;#xAC78;&amp;#xB824;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC18;&amp;#xBA74; Time Travel Position&amp;#xC740; &amp;#xAC19;&amp;#xC740; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xAC19;&amp;#xC740; instruction&amp;#xC77C;&amp;#xC9C0;&amp;#xB77C;&amp;#xB3C4; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xC810;&amp;#xC774; &amp;#xB2E4;&amp;#xB974;&amp;#xB2E4;&amp;#xBA74; &amp;#xB2E4;&amp;#xB978; &amp;#xAC12;&amp;#xC774; &amp;#xB9E4;&amp;#xACA8;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;!tt&lt;/code&gt;&amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC784;&amp;#xC758;&amp;#xC758; TTP&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xD2B9;&amp;#xC815; &amp;#xC2DC;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xB418;&amp;#xB3CC;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Timeline&#34;&gt;&lt;a href=&#34;#Timeline&#34; class=&#34;headerlink&#34; title=&#34;Timeline&#34;&gt;&lt;/a&gt;Timeline&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;MS&amp;#xC5D0;&amp;#xC11C; &amp;#xB0B4;&amp;#xC138;&amp;#xC6B0;&amp;#xB294; TTD&amp;#xC758; &amp;#xC7A5;&amp;#xC810; &amp;#xC911; &amp;#xC81C;&amp;#xAC00; &amp;#xB2E8;&amp;#xC5F0; &amp;#xCD5C;&amp;#xACE0;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC740; &amp;#xBC14;&amp;#xB85C; &amp;#xD0C0;&amp;#xC784;&amp;#xB77C;&amp;#xC778;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xC74C;&amp;#xC5D4; &amp;#xB3D9;&amp;#xC601;&amp;#xC0C1; &amp;#xC7AC;&amp;#xC0DD; &amp;#xBC14;&amp;#xCC98;&amp;#xB7FC; &amp;#xB9C8;&amp;#xC6B0;&amp;#xC2A4;&amp;#xB85C; &amp;#xB4DC;&amp;#xB798;&amp;#xADF8;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD074;&amp;#xB9AD;&amp;#xD574;&amp;#xC11C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xAC08; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xC904; &amp;#xC54C;&amp;#xC558;&amp;#xB294;&amp;#xB370; &amp;#xBC18;&amp;#xC740; &amp;#xB9DE;&amp;#xACE0; &amp;#xBC18;&amp;#xC740; &amp;#xD2C0;&amp;#xB9B0; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774;&amp;#xB354;&amp;#xAD70;&amp;#xC694;. &amp;#xC804;&amp;#xCCB4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xD750;&amp;#xB984; &amp;#xC911; &amp;#xC8FC;&amp;#xC694; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;(Exception, Break Point, Function Call, Memory Access)&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xADF8;&amp;#xB9BC;&amp;#xC73C;&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xD574; &amp;#xC8FC;&amp;#xBA70; &amp;#xD0C0;&amp;#xC784;&amp;#xB77C;&amp;#xC778;&amp;#xC5D0; &amp;#xD45C;&amp;#xC2DC;&amp;#xB41C; &amp;#xAC01; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xD574;&amp;#xB2F9; &amp;#xC2DC;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xC774;&amp;#xC678;&amp;#xC758; &amp;#xACF3;&amp;#xC740; &amp;#xD074;&amp;#xB9AD;&amp;#xD574;&amp;#xB3C4; &amp;#xC774;&amp;#xB3D9; &amp;#xC548;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x314E;&amp;#x314E;;; &amp;#xB108;&amp;#xBB34; &amp;#xAE30;&amp;#xB300;&amp;#xAC00; &amp;#xCEF8;&amp;#xB098;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xC911; Memory Access &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D4; &amp;#xD2B9;&amp;#xC815; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xD2B9;&amp;#xC815; &amp;#xB3D9;&amp;#xC791;(RWX)&amp;#xC774; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C8; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xD0C0;&amp;#xC784;&amp;#xB77C;&amp;#xC778;&amp;#xC5D0; &amp;#xAE30;&amp;#xB85D;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCEE4;&amp;#xB7FD;&amp;#xC158; &amp;#xAC19;&amp;#xC740; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xB54C; &amp;#xC815;&amp;#xB9D0; &amp;#xC720;&amp;#xC6A9;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;? &amp;#xBBF8;&amp;#xB514;&amp;#xC5B4; &amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xC5B4; &amp;#xB531; &amp;#xB300;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB2E8;&amp;#xC810;&#34;&gt;&lt;a href=&#34;#&amp;#xB2E8;&amp;#xC810;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB2E8;&amp;#xC810;&#34;&gt;&lt;/a&gt;&amp;#xB2E8;&amp;#xC810;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB50;&amp;#x2026; &amp;#xC0AC;&amp;#xC2E4; &amp;#xB2E8;&amp;#xC810;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xB2E8;&amp;#xC810;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC55E;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xC7A5;&amp;#xC810;&amp;#xB4E4;&amp;#xC5D0; &amp;#xBE44;&amp;#xD558;&amp;#xBA74; &amp;#xC774; &amp;#xC815;&amp;#xB3C4;&amp;#xB294; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xAC10;&amp;#xC218;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Trace-File-&amp;#xD06C;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#Trace-File-&amp;#xD06C;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;Trace File &amp;#xD06C;&amp;#xAE30;&#34;&gt;&lt;/a&gt;Trace File &amp;#xD06C;&amp;#xAE30;&lt;/h2&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC7AC;&amp;#xD604;&amp;#xC5D0; 3~4&amp;#xCD08; &amp;#xAC78;&amp;#xB9AC;&amp;#xB294; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xB179;&amp;#xD654;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB85C; 2GB &amp;#xC815;&amp;#xB3C4;&amp;#xC758; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC6A9;&amp;#xB7C9;&amp;#xC744; &amp;#xCC28;&amp;#xC9C0;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC5C8;&amp;#xC8E0;? &amp;#xB9CC;&amp;#xC57D; &amp;#xBC84;&amp;#xADF8; &amp;#xC7AC;&amp;#xD604;&amp;#xC5D0;&amp;#xB9CC; &amp;#xBA87;&amp;#xC2ED; &amp;#xBD84;&amp;#xC744; &amp;#xC18C;&amp;#xBAA8;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xD6C4;&amp;#x2026;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xB179;&amp;#xD654;&amp;#xC911;-&amp;#xC624;&amp;#xBC84;&amp;#xD5E4;&amp;#xB4DC;&#34;&gt;&lt;a href=&#34;#&amp;#xB179;&amp;#xD654;&amp;#xC911;-&amp;#xC624;&amp;#xBC84;&amp;#xD5E4;&amp;#xB4DC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB179;&amp;#xD654;&amp;#xC911; &amp;#xC624;&amp;#xBC84;&amp;#xD5E4;&amp;#xB4DC;&#34;&gt;&lt;/a&gt;&amp;#xB179;&amp;#xD654;&amp;#xC911; &amp;#xC624;&amp;#xBC84;&amp;#xD5E4;&amp;#xB4DC;&lt;/h2&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xC0AC;&amp;#xC591;&amp;#xC774;&amp;#xB098; &amp;#xB179;&amp;#xD654; &amp;#xC911; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC591;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xCC9C;&amp;#xCC28;&amp;#xB9CC;&amp;#xBCC4;&amp;#xC778; &amp;#xB370;&amp;#xB2E4; &amp;#xBC29;&amp;#xAE08; &amp;#xC5B8;&amp;#xAE09;&amp;#xD55C; Trace File&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xC5D0; &amp;#xC9C1;&amp;#xACB0;&amp;#xB418;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB77C; &amp;#xC6EC;&amp;#xB9CC;&amp;#xD558;&amp;#xBA74; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC88B;&amp;#xC740; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xBE68;&amp;#xB9AC; &amp;#xB179;&amp;#xD654;&amp;#xB97C; &amp;#xB05D;&amp;#xB0B4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Read-only-Debugging&#34;&gt;&lt;a href=&#34;#Read-only-Debugging&#34; class=&#34;headerlink&#34; title=&#34;Read-only Debugging&#34;&gt;&lt;/a&gt;Read-only Debugging&lt;/h2&gt;&lt;p&gt;&amp;#xB2F9;&amp;#xC5F0;&amp;#xD55C; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xB179;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xB3CC;&amp;#xB824;&amp;#xBCF4;&amp;#xB294; &amp;#xAC8C; TTD&amp;#xB77C; &amp;#xB2E4;&amp;#xB978; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB4E4;&amp;#xCC98;&amp;#xB7FC; &amp;#xD2B9;&amp;#xC815; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB098; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xAC12;&amp;#xC744; &amp;#xC784;&amp;#xC2DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xB294; &amp;#xC791;&amp;#xC5C5;&amp;#xC740; &amp;#xBABB;&amp;#xD574;&amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xAD8C;&amp;#xD55C;&#34;&gt;&lt;a href=&#34;#&amp;#xAD8C;&amp;#xD55C;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAD8C;&amp;#xD55C;&#34;&gt;&lt;/a&gt;&amp;#xAD8C;&amp;#xD55C;&lt;/h2&gt;&lt;p&gt;&amp;#xC544;&amp;#xC9C1;&amp;#xAE4C;&amp;#xC9C4; TTD&amp;#xB85C; User-mode &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB9CC; &amp;#xB179;&amp;#xD654;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Kernel-mode &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xC548;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/24/fabu1ous/ttd-1/16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC740; &amp;#xAC70;&amp;#xC758; &amp;#xBB50; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC774;&amp;#xB77C;&amp;#xAE30; &amp;#xBCF4;&amp;#xB2E8; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00; &amp;#xC218;&amp;#xC900;&amp;#xC5D0;&amp;#xC11C; &amp;#xB05D;&amp;#xB09C; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00;&amp;#xC5D0;&amp;#xC120; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB9C8; &amp;#xAD6C;&amp;#xBC84;&amp;#xC804; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xBC84;&amp;#xADF8;&amp;#xB098; MSDOCS&amp;#xC5D0;&amp;#xC11C; TTD &amp;#xC5F0;&amp;#xC2B5;&amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &amp;#xC544;&amp;#xC608; &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574; &amp;#xBCFC; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACE0;, &amp;#xC544;&amp;#xC9C1; &amp;#xC815;&amp;#xD574;&amp;#xC9C4; &amp;#xAC74; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC800;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; TTD&amp;#xB97C; &amp;#xC775;&amp;#xD600;&amp;#xC62C;&amp;#xAC8C;&amp;#xC694;. &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB3C4; &amp;#xCC3E;&amp;#xACE0;&amp;#x2026; &amp;#x314E;&amp;#x314E;;;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/01/24/fabu1ous/ttd-1/16.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/01/24/fabu1ous/ttd-1/">

  <title>[Research] 시간을 여행하는 해커를 위한 안내서 Part1 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-01-24 18:00" pubdate>
      2021년 1월 24일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.8k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      55
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] 시간을 여행하는 해커를 위한 안내서 Part1</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="&#xBA38;&#xB9BF;&#xB9D0;"><a href="#&#xBA38;&#xB9BF;&#xB9D0;" class="headerlink" title="&#xBA38;&#xB9BF;&#xB9D0;"></a>&#xBA38;&#xB9BF;&#xB9D0;</h1><p>Time Travel Debugging(TTD)&#xB294; 2017&#xB144;&#xC5D0; &#xACF5;&#xAC1C;&#xB41C; Windbg preview&#xC758; &#xAE30;&#xB2A5;&#xC785;&#xB2C8;&#xB2E4;. &#xACF5;&#xAC1C;&#xB41C; &#xC9C0; 3&#xB144;&#xC774;&#xB098; &#xC9C0;&#xB0AC;&#xC9C0;&#xB9CC; &#xC544;&#xC9C1; &#xD55C;&#xAE00;&#xB85C; &#xB41C; &#xC790;&#xC138;&#xD55C; &#xBB38;&#xC11C;&#xB294; &#xBCC4;&#xB85C; &#xC5C6;&#xB294; &#xAC70; &#xAC19;&#xB354;&#xB77C;&#xACE0;&#xC694;. windbg preview&#xB97C; &#xC4F4;&#xB2E4;&#xAC70;&#xB098; TTD&#xC758; &#xC874;&#xC7AC;&#xB97C; &#xC544;&#xB294; &#xC0AC;&#xB78C;&#xC774; &#xC801;&#xC5B4;&#xC11C; &#xADF8;&#xB7F0;&#xAC00; &#xC2F6;&#xAE30;&#xB3C4; &#xD558;&#xACE0;&#x2026; windbg&#xB85C; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xCC98;&#xC74C; &#xD574;&#xBCF8;&#xB2E4;&#xAC70;&#xB098; &#xB514;&#xBC84;&#xAE45; &#xC790;&#xCCB4;&#xB97C; &#xCC98;&#xC74C; &#xC2DC;&#xC791;&#xD558;&#xB824;&#xB294; &#xC0AC;&#xB78C;&#xB4E4;&#xC5D0;&#xAC90; &#xD55C;&#xAE00;&#xB85C; &#xB41C; &#xBB38;&#xC11C;&#xAC00; &#xBB38;&#xD131;&#xC758; &#xB192;&#xC774;&#xB97C; &#xB0AE;&#xCD94;&#xB294;&#xB370; &#xD070; &#xB3C4;&#xC6C0;&#xC774; &#xB41C;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB798;&#xC11C; &#x201C;&#xB0B4;&#xAC00; &#xB9CC;&#xB4E4;&#xC5B4; &#xBCF4;&#xC9C0; &#xBB50;&#x201D;&#xB77C;&#xB294; &#xC0DD;&#xAC01;&#xC73C;&#xB85C; &#xC9C1;&#xC811; &#xACF5;&#xBD80;&#xD574;&#xBCF4;&#xBA74;&#xC11C; &#xC791;&#xC131;&#xD574;&#xBCFC;&#xAE4C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB300;&#xB7B5; Part 3&#xAE4C;&#xC9C0; &#xC0DD;&#xAC01; &#xC911;&#xC774;&#xACE0;, Part 4&#xAE4C;&#xC9C0; &#xCD94;&#xAC00;&#xB85C; &#xD560; &#xC218;&#xB3C4; &#xC788;&#xC5B4;&#xC694;.</p>
<ul>
<li>Part 1 : &#xAC04;&#xB2E8; &#xC18C;&#xAC1C; &#xBC0F; &#xCCAB;&#xC778;&#xC0C1;</li>
<li>Part 2 : &#xAD6C;&#xBC84;&#xC804;&#xC758; open source&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xBC84;&#xADF8;&#xB97C; &#xC9C1;&#xC811; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xB294; &#xC2E4;&#xC2B5;</li>
<li>Part 3 : &#xD06C;&#xB798;&#xC26C; &#xBD84;&#xC11D;&#xC5D0; &#xC0AC;&#xC6A9;&#xD574;&#xBCF8; &#xACBD;&#xD5D8;&#xB2F4;</li>
<li>Part 4 : JavaScript&#xB97C; &#xC774;&#xC6A9;&#xD55C; &#xC790;&#xB3D9;&#xD654; &#xBC0F; &#xACE0;&#xC624;&#xC624;&#xAE09; &#xC0AC;&#xC6A9;&#xBC95;</li>
</ul>
<h1 id="Time-Travel-Debugging"><a href="#Time-Travel-Debugging" class="headerlink" title="Time Travel Debugging"></a>Time Travel Debugging</h1><p><img src="/2021/01/24/fabu1ous/ttd-1/1.png" srcset="/img/loading.gif" alt></p>
<p>&#xBD88;&#xD604;&#xB4EF;&#xC774; &#xACFC;&#xAC70;&#xC5D0; &#xC800;&#xC9C0;&#xB978; &#xC2E4;&#xC218; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xBD88; &#xD0A5;&#xC744; &#xD558;&#xACE0; &#xC2F6;&#xC740; &#xACBD;&#xD5D8;&#xC744; &#xB204;&#xAD6C;&#xB098; &#xD55C; &#xBC88;&#xCBE4;&#xC740; &#xD574;&#xBD24;&#xC744;&#xAC81;&#xB2C8;&#xB2E4;. &#xACFC;&#xAC70;&#xB85C; &#xB3CC;&#xC544;&#xAC00; &#xBAA8;&#xB450; &#xC5C6;&#xB358; &#xC77C;&#xB85C; &#xB9CC;&#xB4E4; &#xC218;&#xB9CC; &#xC788;&#xB2E4;&#xBA74; &#xC5BC;&#xB9C8;&#xB098; &#xC88B;&#xC744;&#xAE4C;&#xC694;. &#xBB3C;&#xB860; &#xADF8;&#xAC8C; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC774; &#xB354;&#xC6B1; &#xAC00;&#xC2B4;&#xC744; &#xD6C4;&#xBCBC; &#xD30C;&#xBA70; &#xC0AC;&#xB78C;&#xC744; &#xBBF8;&#xCE58;&#xAC8C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; Microsoft&#xC758; Debugging Experience&#xD300;&#xC740; Debugging&#xC758; &#xD55C;&#xC5D0;&#xC120; &#xACFC;&#xAC70;&#xB85C; &#xB3CC;&#xC544;&#xAC00; &#xC800;&#xC9C0;&#xB978; &#xC2E4;&#xC218;&#xB97C; &#xB9CC;&#xD68C;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>Time Travel Debugging(TTD), is a tool that allows you to record an execution of your process running, then replay it later both forwards and backwards.</p>
</blockquote>
<p>TTD&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xC2E4;&#xD589;&#xC744; &#x201C;&#xB418;&#xAC10;&#xAE30;(rewind)&#x201D;&#xD560; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB9E4;&#xBC88; &#xBC84;&#xADF8;&#xB97C; &#xC7AC; &#xAD6C;&#xD604;&#xD558;&#xB294; &#xBC88;&#xAC70;&#xB85C;&#xC6C0;&#xC744; &#xB35C;&#xACE0; &#xB514;&#xBC84;&#xAE45;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC8C;&#xB2E4;&#xAC00; MS &#xC2A4;&#xD1A0;&#xC5B4;&#xC5D0;&#xC11C; windbg preview&#xB97C; &#xC124;&#xCE58;&#xD558;&#xB294; &#xAC83;&#xB9CC;&#xC73C;&#xB85C; TTD&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB2C8;&#x2026;</p>
<p><img src="/2021/01/24/fabu1ous/ttd-1/2.png" srcset="/img/loading.gif" alt></p>
<p>&#xC544;&#xB2C8;&#xC544;&#xB2C8; &#xBB34;&#xB8CC;&#xB77C;&#xAD6C;&#xC694; &#xC190;&#xB2D8;</p>
<h1 id="&#xAE30;&#xBCF8;&#xC801;&#xC778;-&#xC0AC;&#xC6A9;&#xBC95;"><a href="#&#xAE30;&#xBCF8;&#xC801;&#xC778;-&#xC0AC;&#xC6A9;&#xBC95;" class="headerlink" title="&#xAE30;&#xBCF8;&#xC801;&#xC778; &#xC0AC;&#xC6A9;&#xBC95;"></a>&#xAE30;&#xBCF8;&#xC801;&#xC778; &#xC0AC;&#xC6A9;&#xBC95;</h1><h2 id="&#xAD00;&#xB9AC;&#xC790;-&#xAD8C;&#xD55C;&#xC73C;&#xB85C;-&#xC2E4;&#xD589;"><a href="#&#xAD00;&#xB9AC;&#xC790;-&#xAD8C;&#xD55C;&#xC73C;&#xB85C;-&#xC2E4;&#xD589;" class="headerlink" title="&#xAD00;&#xB9AC;&#xC790; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;"></a>&#xAD00;&#xB9AC;&#xC790; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;</h2><p><img src="/2021/01/24/fabu1ous/ttd-1/3.png" srcset="/img/loading.gif" alt></p>
<p>&#xB514;&#xBC84;&#xAE45; &#xD0C0;&#xAC9F;&#xC758; &#xC2E4;&#xD589;&#xC744; &#xB179;&#xD654;&#xD574; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; Trace file(&#xC774;&#xD558; <code>.run</code>)&#xC744; &#xC539;&#xACE0; &#xB72F;&#xACE0; &#xB9DB;&#xBCF4;&#xACE0; &#xC990;&#xAE34;&#xB2E4;&#xB294; &#xAC8C; TTD&#xC758; &#xB9E4;&#xB825;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xC804;&#xC5D0; &#xC6B0;&#xC120; windbg preview&#xB97C; &#xAD00;&#xB9AC;&#xC790; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xD558;&#xC154;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. Input/Output &#xD2B8;&#xB808;&#xC774;&#xC2F1;&#xC744; &#xAE30;&#xB85D;&#xD558;&#xB294; &#xB514;&#xBC84;&#xAE45; &#xBC29;&#xC2DD;&#xC740; &#xC774;&#xBBF8; &#xC874;&#xC7AC;&#xD574;&#xC654;&#xC9C0;&#xB9CC; TTD&#xB294; &#xC774;&#xBCF4;&#xB2E4; &#xC880; &#xB354; &#xD655;&#xC7A5;&#xB41C; &#xAC1C;&#xB150;&#xC73C;&#xB85C;, &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xBAA8;&#xB4E0; &#xC2E4;&#xD589;&#xC744; &#xAE30;&#xB85D;&#xD574; <code>.run</code>&#xC744; &#xB9CC;&#xB4E4;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC0C1;&#xB300;&#xC801;&#xC73C;&#xB85C; &#xB192;&#xC740; &#xAD8C;&#xD55C;&#xC744; &#xC694;&#xAD6C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="Trace-file-&#xB179;&#xD654;&#xD558;&#xAE30;"><a href="#Trace-file-&#xB179;&#xD654;&#xD558;&#xAE30;" class="headerlink" title="Trace file &#xB179;&#xD654;&#xD558;&#xAE30;"></a>Trace file &#xB179;&#xD654;&#xD558;&#xAE30;</h2><p><img src="/2021/01/24/fabu1ous/ttd-1/4.png" srcset="/img/loading.gif" alt></p>
<p>[&#xC0C1;&#xB2E8; &#xBA54;&#xB274;] &gt; [&#xD30C;&#xC77C;] &gt; [Launch executable (advanced)] &gt; &#xC2E4;&#xD589; &#xD30C;&#xC77C; &#xC120;&#xD0DD; &gt; [Record with TTD &#xCCB4;&#xD06C; &#xBC15;&#xC2A4;]</p>
<p>&#xB514;&#xBC84;&#xAE45; &#xD0C0;&#xAC9F;&#xC774; &#xB420; &#xC2E4;&#xD589; &#xD30C;&#xC77C;&#xC744; &#xC120;&#xD0DD;&#xD574;&#xC900; &#xB4A4; Record with Time Trabel Debugging&#xB97C; &#xCCB4;&#xD06C;&#xD574;&#xC8FC;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/01/24/fabu1ous/ttd-1/5.png" srcset="/img/loading.gif" alt></p>
<p>&#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; <code>.run</code>&#xD30C;&#xC77C;&#xC740; <code>C:\\Users\\username\\Documents</code>&#xC5D0; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC6D0;&#xD558;&#xC2E0;&#xB2E4;&#xBA74; &#xC0DD;&#xC131; &#xACBD;&#xB85C;&#xB97C; &#xBC14;&#xAFB8;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <code>.run</code>&#xD30C;&#xC77C;&#xC758; &#xACBD;&#xB85C;&#xB97C; &#xC9C0;&#xC815; &#xD6C4; Record &#xBC84;&#xD2BC;&#xC744; &#xB204;&#xB974;&#xC2DC;&#xBA74; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xB179;&#xD654;&#xAC00; &#xC2DC;&#xC791;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/01/24/fabu1ous/ttd-1/6.png" srcset="/img/loading.gif" alt></p>
<p>&#xD0C0;&#xAC9F;&#xC758; &#xB179;&#xD654;&#xAC00; &#xC9C4;&#xD589;&#xB418;&#xACE0; &#xC788;&#xC74C;&#xC744; &#xC54C;&#xB824;&#xC8FC;&#xB294; &#xD31D;&#xC5C5;&#xCC3D;&#xC774; &#xB72C;&#xB2E4;&#xBA74; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xB179;&#xD654;&#xB418;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xD31D;&#xC5C5;&#xCC3D;&#xC5D0;&#xC120; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xC138;&#xC2A4;, &#xB179;&#xD654; &#xCEE4;&#xBA58;&#xB4DC;&#xB97C; &#xBCF4;&#xC5EC;&#xC8FC;&#xBA70; &#xC774; &#xB179;&#xD654;&#xAC00; &#xC9C4;&#xC815; &#xB0B4;&#xAC00; &#xC6D0;&#xD558;&#xB294; &#xB179;&#xD654;&#xAC00; &#xB9DE;&#xB294;&#xC9C0; &#xCD5C;&#xC885; &#xD655;&#xC778;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xBB3C;&#xB860; &#xC774; &#xD31D;&#xC5C5;&#xCC3D;&#xC774; &#xB72C;&#xB2E4;&#xBA74; &#xADF8;&#xB7F0; &#xAC74; &#xC2E0;&#xACBD; &#xC4F0;&#xC9C0; &#xB9C8;&#xC2DC;&#xACE0; &#xCD5C;&#xB300;&#xD55C; &#xBE68;&#xB9AC; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xC774;&#xC288;&#xB098; &#xBC84;&#xADF8;&#xB97C; &#xC7AC;&#xD604;&#xD574;&#xC8FC;&#xC154;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xB098;&#xC911;&#xC5D0; &#xC7A0;&#xC2DC; &#xB2E4;&#xB8F0; &#xB2E8;&#xC810;&#xC758; &#xB0B4;&#xC6A9;&#xC774;&#xC9C0;&#xB9CC; &#xAC04;&#xB2E8;&#xD788; &#xC124;&#xBA85;&#xB4DC;&#xB9AC;&#xC790;&#xBA74;  <code>.run</code>&#xD30C;&#xC77C;&#xC774; &#xD06C;&#xAE30;&#xAC00; &#xC0DD;&#xAC01;&#xBCF4;&#xB2E4; &#xBE68;&#xB9AC; &#xCEE4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC774; &#xAE00;&#xC744; &#xC4F0;&#xAE30; &#xC704;&#xD574; &#xC7AC;&#xD604;&#xD558;&#xB294;&#xB370; &#xB300;&#xB7B5; 3~4&#xCD08; &#xC815;&#xB3C4; &#xAC78;&#xB9AC;&#xB294; &#xD06C;&#xB798;&#xC26C;&#xB97C; &#xB179;&#xD654;&#xD588;&#xACE0; 1.5GB &#xD06C;&#xAE30;&#xC758; <code>.run</code>&#xD30C;&#xC77C;&#xC774; &#xB9CC;&#xB4E4;&#xC5B4;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD3C9;&#xADE0;&#xC801;&#xC73C;&#xB85C; &#xC601;&#xD654; &#xD55C; &#xD3B8;&#xC774; 1.5GB&#xC785;&#xB2C8;&#xB2E4;. &#xAC70;&#xAE30;&#xB2E4; &#xCD94;&#xAC00;&#xB85C;  <code>.idx</code>&#xB77C;&#xB294; &#xD30C;&#xC77C;&#xC774; 0.5GB&#xB97C; &#xCC28;&#xC9C0;&#xD558;&#xB2C8; &#xCD1D; 2GB&#xB098; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xAD70;&#xC694;. MSDOCS&#xC5D0; &#xB530;&#xB974;&#xBA74; <code>.idx</code>&#xD30C;&#xC77C;&#xC740; &#xBCF4;&#xD1B5;  <code>.run</code>&#xD30C;&#xC77C;&#xC758; 2&#xBC30; &#xC815;&#xB3C4;&#xC758; &#xD06C;&#xAE30;&#xAC00; &#xB41C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/01/24/fabu1ous/ttd-1/7.png" srcset="/img/loading.gif" alt></p>
<p>&#xC55E;&#xC73C;&#xB85C; &#xC774; <code>.run</code>&#xD30C;&#xC77C;&#xB9CC; &#xC788;&#xB2E4;&#xBA74; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xD558;&#xB2E4;&#xAC00; &#xB2E4;&#xC2DC; &#xBC84;&#xADF8;&#xB97C; &#xC7AC;&#xD604;&#xD558;&#xB294; &#xBC88;&#xAC70;&#xB85C;&#xC6C0;&#xC744; &#xC5C6;&#xC568; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBCF4;&#xD1B5; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xB2E4; &#xC2E4;&#xC218;&#xD55C;&#xB2E4;&#xAC70;&#xB098; &#xCEE8;&#xD2B8;&#xB864;&#xC774; &#xBC84;&#xADF8; &#xBC1C;&#xC0DD;&#xC2DC;&#xC810;&#xC744; &#xB118;&#xC5B4;&#xAC00;&#xBC84;&#xB9AC;&#xBA74; restart&#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xC2DC;&#xC791; &#xC2DC;&#xC810;&#xC73C;&#xB85C; &#xB3CC;&#xC544;&#xAC00;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xAC04;&#xD639; restart&#xAE30;&#xB2A5;&#xC774; &#xC548; &#xBA39;&#xAC70;&#xB098; &#xB514;&#xBC84;&#xAC70; &#xC790;&#xCCB4;&#xB97C; &#xC7AC;&#xC2DC;&#xC791;&#xD574;&#xC57C; &#xD558;&#xB294; &#xACBD;&#xC6B0;&#xC5D4; &#xBC84;&#xADF8;&#xB97C; &#xB610;&#xB2E4;&#xC2DC; &#xC7AC;&#xD604;&#xD574;&#xC57C; &#xD574;&#xC11C; &#xC0C1;&#xB2F9;&#xD788; &#xADC0;&#xCC2E;&#xC8E0;. &#xC800;&#xB294; &#xC774;&#xB7F0; &#xACBD;&#xC6B0;&#xC5D0; vm&#xC758; &#xC2A4;&#xB0C5;&#xC0F7;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xAC70;&#xB098; <code>.bat</code>&#xD30C;&#xC77C;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xBC84;&#xADF8; &#xC7AC;&#xD604;&#xC744; &#xC790;&#xB3D9;&#xD654; &#xD558;&#xACE4; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xC6E9;&#x2026;</p>
<h1 id="TTD-&#xC4F0;&#xC138;&#xC694;-&#xB450;&#xBC88;-&#xC4F0;&#xC138;&#xC694;"><a href="#TTD-&#xC4F0;&#xC138;&#xC694;-&#xB450;&#xBC88;-&#xC4F0;&#xC138;&#xC694;" class="headerlink" title="TTD &#xC4F0;&#xC138;&#xC694;, &#xB450;&#xBC88; &#xC4F0;&#xC138;&#xC694;"></a>TTD &#xC4F0;&#xC138;&#xC694;, &#xB450;&#xBC88; &#xC4F0;&#xC138;&#xC694;</h1><p>&#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; TTD&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xBCF8; &#xC81C;&#xAC00; &#xC0DD;&#xAC01;&#xD558;&#xB294; &#xC7A5;&#xC810;, &#xADF8;&#xB9AC;&#xACE0; MS&#xC5D0;&#xC11C; &#xB0B4;&#xC138;&#xC6B0;&#xACE0; &#xC788;&#xB294; &#xC7A5;&#xC810;&#xC744; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<h2 id="Re-zero&#xBD80;&#xD130;-&#xC2DC;&#xC791;&#xD558;&#xB294;-&#xB514;&#xBC84;&#xAE45;-&#xC6B0;&#xC6E9;"><a href="#Re-zero&#xBD80;&#xD130;-&#xC2DC;&#xC791;&#xD558;&#xB294;-&#xB514;&#xBC84;&#xAE45;-&#xC6B0;&#xC6E9;" class="headerlink" title="Re:zero&#xBD80;&#xD130; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xB514;&#xBC84;&#xAE45;? &#xC6B0;&#xC6E9;"></a>Re:zero&#xBD80;&#xD130; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xB514;&#xBC84;&#xAE45;? &#xC6B0;&#xC6E9;</h2><p>&#xC544;&#xAE4C; &#xB9D0;&#xC500;&#xB4DC;&#xB9B0; &#xB300;&#xB85C; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xBA74;&#xC11C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xC2DC;&#xC791; &#xC2DC;&#xC810;&#xC73C;&#xB85C; &#xB3CC;&#xC544;&#xAC00;&#xB294; &#xC77C;&#xC740; &#xC815;&#xB9D0; &#xBE48;&#xBC88;&#xD788; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB798;&#xC11C; &#xC6B0;&#xB9AC; idioth&#xD615;&#xC774; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xC88B;&#xC544;&#xD558;&#xB098; &#xBD10;&#xC694;. &#x314B;&#x314B;&#x314B;&#x314B;</p>
<p><img src="/2021/01/24/fabu1ous/ttd-1/8.png" srcset="/img/loading.gif" alt></p>
<p>&#xB514;&#xBC84;&#xAC70; &#xC885;&#xB958;&#xC640; &#xC0C1;&#xAD00;&#xC5C6;&#xC774; &#xC870;&#xAE08; &#xB9CC;&#xC838;&#xBD24;&#xB2E4; &#xD558;&#xC2DC;&#xB294; &#xBD84;&#xB4E4;&#xC740; &#xC704; &#xC0AC;&#xC9C4;&#xC5D0;&#xC11C; &#xAC01;&#xAC01; &#xAE30;&#xB2A5;&#xB4E4;&#xC774; &#xBB34;&#xC2A8; &#xB3D9;&#xC791;&#xC744; &#xD558;&#xB294;&#xC9C0; &#xC775;&#xC219;&#xD560; &#xAC81;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>GO : break point &#xC704;&#xCE58;&#xAE4C;&#xC9C0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;</li>
<li>Step Out : &#xD604;&#xC7AC; &#xD568;&#xC218;&#xB97C; &#xB05D;&#xAE4C;&#xC9C0; &#xC2E4;&#xD589; &#xD6C4; &#xB9AC;&#xD134;</li>
<li>Step Into : instruction &#xD55C;&#xAC1C; &#xC2E4;&#xD589;, &#xB9CC;&#xC57D; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xBA74; &#xD568;&#xC218; &#xB0B4;&#xBD80;&#xB85C; &#xC9C4;&#xC785;</li>
<li>Step Over : instruction &#xD55C;&#xAC1C; &#xC2E4;&#xD589;, &#xB9CC;&#xC57D; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xBA74; &#xD574;&#xB2F9; &#xD568;&#xC218;&#xB97C; &#xB05D;&#xAE4C;&#xC9C0; &#xC2E4;&#xD589;&#xD6C4; &#xB9AC;&#xD134;</li>
</ol>
<p>GO&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xAE30; &#xC804;&#xC5D0; break point &#xC124;&#xC815;&#xC744; &#xC798;&#xBABB;&#xD588;&#xB2E4;&#xAC70;&#xB098;, Step Into&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xD568;&#xC218; &#xB0B4;&#xBD80;&#xB85C; &#xC9C4;&#xC785;&#xD574;&#xC57C; &#xD558;&#xB294; &#xC0C1;&#xD669;&#xC5D0;&#xC11C; Step Over&#xB97C; &#xD558;&#xAC8C; &#xB420; &#xACBD;&#xC6B0; &#xB208;&#xBB3C;&#xC744; &#xBA38;&#xAE08;&#xACE0; restart&#xBC84;&#xD2BC;&#xC744; &#xB20C;&#xB7EC;&#xC57C; &#xD558;&#xC8E0;. &#xC815;&#xB9D0; &#xC7A0;&#xC2DC; &#xC9D1;&#xC911;&#xC744; &#xC548; &#xD558;&#xBA74; &#xBC8C;&#xC5B4;&#xC9C0;&#xB294; &#xC77C;&#xC774;&#xB77C; &#xC9DC;&#xC99D; &#xB098;&#xAE30;&#xB3C4; &#xD558;&#xACE0; break point&#xC758; &#xD55C;&#xACC4;&#xB97C; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xBA74; &#xC5EC;&#xAC04; &#xADC0;&#xCC2E;&#xC740; &#xAC8C; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. TTD&#xB294; &#xC774;&#xB7F0; &#xBD88;&#xD3B8;&#xD568;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xD574;&#xACB0;&#xD588;&#xC744;&#xAE4C;&#xC694;?</p>
<h2 id="Reverse-Flow-Control"><a href="#Reverse-Flow-Control" class="headerlink" title="Reverse Flow Control"></a>Reverse Flow Control</h2><p><img src="/2021/01/24/fabu1ous/ttd-1/9.png" srcset="/img/loading.gif" alt></p>
<p>TTD&#xB294; &#xC704;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD55C; Flow Control &#xAE30;&#xB2A5;&#xC744; &#xB4A4;&#xC9D1;&#xC740; Reverse Flow Control&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB0E5; &#xB9D0; &#xADF8;&#xB300;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD750;&#xB984;&#xC744; &#xAC70;&#xAFB8;&#xB85C; &#xAC70;&#xC2AC;&#xB7EC; &#xC62C;&#xB7EC;&#xAC08; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;. &#xC544;&#xAE4C; &#xB9D0;&#xD55C; &#xB300;&#xB85C; Step Into&#xB97C; &#xD574;&#xC57C; &#xD560; &#xC0C1;&#xD669;&#xC5D0;&#xC11C; Step Over&#xB97C; &#xD574;&#xBC84;&#xB824;&#xC11C; &#xBD84;&#xC11D;&#xD574;&#xC57C; &#xD560; &#xD568;&#xC218;&#xC5D0; &#xC9C4;&#xC785;&#xD558;&#xC9C0; &#xBABB;&#xD588;&#xB2E4;&#xBA74; &#xB2E8;&#xC21C;&#xD788; Step Over Back &#xD558;&#xBA74; &#xD574;&#xACB0;&#xB429;&#xB2C8;&#xB2E4;.</p>
<h2 id="Time-Travel-Position"><a href="#Time-Travel-Position" class="headerlink" title="Time Travel Position"></a>Time Travel Position</h2><p><img src="/2021/01/24/fabu1ous/ttd-1/10.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB7FC; &#xB2E8;&#xC21C;&#xD788; &#xD604;&#xC7AC; program counter &#xC704;&#xCE58;&#xB85C;&#xBD80;&#xD130; intruction&#xC744; &#xAC70;&#xC2AC;&#xB7EC; &#xC62C;&#xB77C;&#xAC00;&#xB294; &#xAC8C; &#xB05D;&#xC774;&#xB0D0;? &#xADF8;&#xB7AC;&#xB2E4;&#xBA74; &#xC2DC;&#xAC04;&#xC5EC;&#xD589;(Time Travel)&#xC774;&#xB780; &#xC774;&#xB984;&#xC774; &#xBD99;&#xC9C4; &#xC54A;&#xC558;&#xACA0;&#xC8E0;. &#xB179;&#xD654; &#xC2DC;&#xC791;&#xBD80;&#xD130; &#xB179;&#xD654; &#xC885;&#xB8CC; &#xC2DC;&#xC810;&#xAE4C;&#xC9C0; &#xC2E4;&#xD589;&#xB41C; instruction&#xB9C8;&#xB2E4; Time Travel Position(&#xC774;&#xD558; TTP)&#xC774;&#xB780; &#xAC12;&#xC774; &#xB9E4;&#xACA8;&#xC9C0;&#xB294;&#xB370; break point&#xC758; &#xC0C1;&#xC704; &#xD638;&#xD658;&#xC774;&#xB77C; &#xC0DD;&#xAC01;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/01/24/fabu1ous/ttd-1/11.png" srcset="/img/loading.gif" alt></p>
<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4; <code>fabulous()</code>&#xB77C;&#xB294; &#xD568;&#xC218;&#xAC00; &#xC788;&#xACE0; &#xC774; &#xD568;&#xC218;&#xAC00; 16&#xBC88;&#xC9F8; &#xD638;&#xCD9C;&#xB41C; &#xC2DC;&#xC810;&#xC5D0;&#xC11C; &#xD568;&#xC218; &#xB0B4;&#xBD80;&#xC5D0; &#xBC84;&#xADF8;&#xAC00; &#xBC1C;&#xC0DD;&#xD588;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;. &#xB3D9;&#xC801; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC704;&#xD574; <code>fabulous()</code>&#xD568;&#xC218; &#xC5D4;&#xD2B8;&#xB9AC;&#xC5D0; break point&#xB97C; &#xAC78;&#xC5C8;&#xB2E4;&#xBA74; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xC2DC;&#xC791; &#xC2DC;&#xC810;&#xBD80;&#xD130; &#xBC84;&#xADF8; &#xBC1C;&#xC0DD; &#xC704;&#xCE58;&#xAE4C;&#xC9C0; &#xD574;&#xB2F9; break point&#xC5D0; &#xCD1D; 16&#xBC88; &#xAC78;&#xB824;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/01/24/fabu1ous/ttd-1/12.png" srcset="/img/loading.gif" alt></p>
<p>&#xBC18;&#xBA74; Time Travel Position&#xC740; &#xAC19;&#xC740; &#xD568;&#xC218;&#xC758; &#xAC19;&#xC740; instruction&#xC77C;&#xC9C0;&#xB77C;&#xB3C4; &#xC2E4;&#xD589; &#xC2DC;&#xC810;&#xC774; &#xB2E4;&#xB974;&#xB2E4;&#xBA74; &#xB2E4;&#xB978; &#xAC12;&#xC774; &#xB9E4;&#xACA8;&#xC9D1;&#xB2C8;&#xB2E4;. <code>!tt</code>&#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC784;&#xC758;&#xC758; TTP&#xB85C; &#xC774;&#xB3D9;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xC0C1;&#xD0DC;&#xB97C; &#xD2B9;&#xC815; &#xC2DC;&#xC810;&#xC73C;&#xB85C; &#xB418;&#xB3CC;&#xB9B4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Timeline"><a href="#Timeline" class="headerlink" title="Timeline"></a>Timeline</h2><p><img src="/2021/01/24/fabu1ous/ttd-1/13.png" srcset="/img/loading.gif" alt></p>
<p>MS&#xC5D0;&#xC11C; &#xB0B4;&#xC138;&#xC6B0;&#xB294; TTD&#xC758; &#xC7A5;&#xC810; &#xC911; &#xC81C;&#xAC00; &#xB2E8;&#xC5F0; &#xCD5C;&#xACE0;&#xB77C; &#xC0DD;&#xAC01;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC740; &#xBC14;&#xB85C; &#xD0C0;&#xC784;&#xB77C;&#xC778;&#xC785;&#xB2C8;&#xB2E4;. &#xCC98;&#xC74C;&#xC5D4; &#xB3D9;&#xC601;&#xC0C1; &#xC7AC;&#xC0DD; &#xBC14;&#xCC98;&#xB7FC; &#xB9C8;&#xC6B0;&#xC2A4;&#xB85C; &#xB4DC;&#xB798;&#xADF8;&#xD558;&#xAC70;&#xB098; &#xD074;&#xB9AD;&#xD574;&#xC11C; &#xC6D0;&#xD558;&#xB294; &#xC2DC;&#xC810;&#xC73C;&#xB85C; &#xAC08; &#xC218; &#xC788;&#xC744; &#xC904; &#xC54C;&#xC558;&#xB294;&#xB370; &#xBC18;&#xC740; &#xB9DE;&#xACE0; &#xBC18;&#xC740; &#xD2C0;&#xB9B0; &#xC0DD;&#xAC01;&#xC774;&#xB354;&#xAD70;&#xC694;. &#xC804;&#xCCB4; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xD750;&#xB984; &#xC911; &#xC8FC;&#xC694; &#xC774;&#xBCA4;&#xD2B8;(Exception, Break Point, Function Call, Memory Access)&#xC758; &#xC704;&#xCE58;&#xB97C; &#xADF8;&#xB9BC;&#xC73C;&#xB85C; &#xD45C;&#xD604;&#xD574; &#xC8FC;&#xBA70; &#xD0C0;&#xC784;&#xB77C;&#xC778;&#xC5D0; &#xD45C;&#xC2DC;&#xB41C; &#xAC01; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xD074;&#xB9AD;&#xD558;&#xBA74; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xC0C1;&#xD0DC;&#xB97C; &#xD574;&#xB2F9; &#xC2DC;&#xC810;&#xC73C;&#xB85C; &#xBCC0;&#xACBD;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xADF8; &#xC774;&#xC678;&#xC758; &#xACF3;&#xC740; &#xD074;&#xB9AD;&#xD574;&#xB3C4; &#xC774;&#xB3D9; &#xC548;&#xD569;&#xB2C8;&#xB2E4;. &#x314E;&#x314E;;; &#xB108;&#xBB34; &#xAE30;&#xB300;&#xAC00; &#xCEF8;&#xB098;?</p>
<p><img src="/2021/01/24/fabu1ous/ttd-1/14.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xBCA4;&#xD2B8; &#xC911; Memory Access &#xAC19;&#xC740; &#xACBD;&#xC6B0;&#xC5D4; &#xD2B9;&#xC815; &#xC8FC;&#xC18C;&#xC5D0; &#xD2B9;&#xC815; &#xB3D9;&#xC791;(RWX)&#xC774; &#xC774;&#xB8E8;&#xC5B4;&#xC9C8; &#xB54C;&#xB9C8;&#xB2E4; &#xD0C0;&#xC784;&#xB77C;&#xC778;&#xC5D0; &#xAE30;&#xB85D;&#xB418;&#xB3C4;&#xB85D; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBA54;&#xBAA8;&#xB9AC; &#xCEE4;&#xB7FD;&#xC158; &#xAC19;&#xC740; &#xBC84;&#xADF8;&#xB97C; &#xCC3E;&#xC744; &#xB54C; &#xC815;&#xB9D0; &#xC720;&#xC6A9;&#xD558;&#xACA0;&#xC8E0;? &#xBBF8;&#xB514;&#xC5B4; &#xD50C;&#xB808;&#xC774;&#xC5B4; &#xB531; &#xB300;</p>
<h1 id="&#xB2E8;&#xC810;"><a href="#&#xB2E8;&#xC810;" class="headerlink" title="&#xB2E8;&#xC810;"></a>&#xB2E8;&#xC810;</h1><p><img src="/2021/01/24/fabu1ous/ttd-1/15.png" srcset="/img/loading.gif" alt></p>
<p>&#xBB50;&#x2026; &#xC0AC;&#xC2E4; &#xB2E8;&#xC810;&#xC774;&#xB77C;&#xBA74; &#xB2E8;&#xC810;&#xC774;&#xC9C0;&#xB9CC; &#xC55E;&#xC11C; &#xC124;&#xBA85;&#xD55C; &#xC7A5;&#xC810;&#xB4E4;&#xC5D0; &#xBE44;&#xD558;&#xBA74; &#xC774; &#xC815;&#xB3C4;&#xB294; &#xCDA9;&#xBD84;&#xD788; &#xAC10;&#xC218;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xBD05;&#xB2C8;&#xB2E4;.</p>
<h2 id="Trace-File-&#xD06C;&#xAE30;"><a href="#Trace-File-&#xD06C;&#xAE30;" class="headerlink" title="Trace File &#xD06C;&#xAE30;"></a>Trace File &#xD06C;&#xAE30;</h2><p>&#xC704;&#xC5D0;&#xC11C; &#xC7AC;&#xD604;&#xC5D0; 3~4&#xCD08; &#xAC78;&#xB9AC;&#xB294; &#xBC84;&#xADF8;&#xB97C; &#xB179;&#xD654;&#xD55C; &#xACB0;&#xACFC;&#xB85C; 2GB &#xC815;&#xB3C4;&#xC758; &#xB514;&#xC2A4;&#xD06C; &#xC6A9;&#xB7C9;&#xC744; &#xCC28;&#xC9C0;&#xD55C;&#xB2E4;&#xACE0; &#xD588;&#xC5C8;&#xC8E0;? &#xB9CC;&#xC57D; &#xBC84;&#xADF8; &#xC7AC;&#xD604;&#xC5D0;&#xB9CC; &#xBA87;&#xC2ED; &#xBD84;&#xC744; &#xC18C;&#xBAA8;&#xD55C;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xBA74; &#xC5B4;&#xD6C4;&#x2026;</p>
<h2 id="&#xB179;&#xD654;&#xC911;-&#xC624;&#xBC84;&#xD5E4;&#xB4DC;"><a href="#&#xB179;&#xD654;&#xC911;-&#xC624;&#xBC84;&#xD5E4;&#xB4DC;" class="headerlink" title="&#xB179;&#xD654;&#xC911; &#xC624;&#xBC84;&#xD5E4;&#xB4DC;"></a>&#xB179;&#xD654;&#xC911; &#xC624;&#xBC84;&#xD5E4;&#xB4DC;</h2><p>&#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xC0AC;&#xC591;&#xC774;&#xB098; &#xB179;&#xD654; &#xC911; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xCF54;&#xB4DC;&#xC758; &#xC591;&#xC5D0; &#xB530;&#xB77C; &#xCC9C;&#xCC28;&#xB9CC;&#xBCC4;&#xC778; &#xB370;&#xB2E4; &#xBC29;&#xAE08; &#xC5B8;&#xAE09;&#xD55C; Trace File&#xC758; &#xD06C;&#xAE30;&#xC5D0; &#xC9C1;&#xACB0;&#xB418;&#xB294; &#xBB38;&#xC81C;&#xB77C; &#xC6EC;&#xB9CC;&#xD558;&#xBA74; &#xCD5C;&#xB300;&#xD55C; &#xC88B;&#xC740; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xBE68;&#xB9AC; &#xB179;&#xD654;&#xB97C; &#xB05D;&#xB0B4;&#xB3C4;&#xB85D; &#xD569;&#xC2DC;&#xB2E4;.</p>
<h2 id="Read-only-Debugging"><a href="#Read-only-Debugging" class="headerlink" title="Read-only Debugging"></a>Read-only Debugging</h2><p>&#xB2F9;&#xC5F0;&#xD55C; &#xC774;&#xC57C;&#xAE30;&#xC9C0;&#xB9CC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xC2E4;&#xD589;&#xC744; &#xB179;&#xD654;&#xD558;&#xACE0; &#xB3CC;&#xB824;&#xBCF4;&#xB294; &#xAC8C; TTD&#xB77C; &#xB2E4;&#xB978; &#xB514;&#xBC84;&#xAC70;&#xB4E4;&#xCC98;&#xB7FC; &#xD2B9;&#xC815; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB098; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xAC12;&#xC744; &#xC784;&#xC2DC;&#xB85C; &#xBCC0;&#xACBD;&#xD558;&#xB294; &#xC791;&#xC5C5;&#xC740; &#xBABB;&#xD574;&#xBD05;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xAD8C;&#xD55C;"><a href="#&#xAD8C;&#xD55C;" class="headerlink" title="&#xAD8C;&#xD55C;"></a>&#xAD8C;&#xD55C;</h2><p>&#xC544;&#xC9C1;&#xAE4C;&#xC9C4; TTD&#xB85C; User-mode &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB9CC; &#xB179;&#xD654;&#xAC00; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. Kernel-mode &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xC548;&#xB41C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h1><p><img src="/2021/01/24/fabu1ous/ttd-1/16.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xBC88; &#xAE00;&#xC740; &#xAC70;&#xC758; &#xBB50; &#xC5F0;&#xAD6C;&#xAE00;&#xC774;&#xB77C;&#xAE30; &#xBCF4;&#xB2E8; &#xBC88;&#xC5ED;&#xAE00; &#xC218;&#xC900;&#xC5D0;&#xC11C; &#xB05D;&#xB09C; &#xAC70; &#xAC19;&#xB124;&#xC694;. &#xB2E4;&#xC74C; &#xAE00;&#xC5D0;&#xC120; &#xC2E4;&#xC81C;&#xB85C; &#xBC84;&#xADF8;&#xB97C; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xB294; &#xC2E4;&#xC2B5;&#xC744; &#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xB9C8; &#xAD6C;&#xBC84;&#xC804; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xBC84;&#xADF8;&#xB098; MSDOCS&#xC5D0;&#xC11C; TTD &#xC5F0;&#xC2B5;&#xC6A9;&#xC73C;&#xB85C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xAC70; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xB2C8;&#xBA74; &#xC544;&#xC608; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xBD84;&#xC11D;&#xD574; &#xBCFC; &#xC218;&#xB3C4; &#xC788;&#xACE0;, &#xC544;&#xC9C1; &#xC815;&#xD574;&#xC9C4; &#xAC74; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB54C;&#xAE4C;&#xC9C0; &#xC800;&#xB294; &#xD06C;&#xB798;&#xC26C; &#xBD84;&#xC11D;&#xD558;&#xBA74;&#xC11C; TTD&#xB97C; &#xC775;&#xD600;&#xC62C;&#xAC8C;&#xC694;. &#xCDE8;&#xC57D;&#xC810;&#xB3C4; &#xCC3E;&#xACE0;&#x2026; &#x314E;&#x314E;;;</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/Fabu1ous/">Fabu1ous</a>
                  
                  <a class="hover-with-bg" href="/tags/windbg/">windbg</a>
                  
                  <a class="hover-with-bg" href="/tags/time-travel-debugging/">time travel debugging</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_Fabu1ous.jpg" srcset="/img/loading.gif" alt="Fabu1ous">
                  </div>

                  <div class="link-text">
                    <div class="link-title">Fabu1ous</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/Fabu1ous">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/01/25/idioth/2021-01-25/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2021-1678 : MSRPC Printer Spooler Relay</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/01/23/fabu1ous/2021-01-23/">
                    <span class="hidden-mobile">[하루한줄] Three Bugs in Orion's belt</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/01/24/fabu1ous/ttd-1/';
        this.page.identifier = '/2021/01/24/fabu1ous/ttd-1/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] 시간을 여행하는 해커를 위한 안내서 Part1&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
