

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; &amp;#xB9C1;&amp;#xD06C; : &lt;a href=&#34;https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-both-ends&#34;&gt;https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-both-ends&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. j0ker&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD3C9;&amp;#xC18C;&amp;#xC5D0; &amp;#xD37C;&amp;#xC9D5;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB3C4; &amp;#xAD00;&amp;#xC2EC;&amp;#xC774; &amp;#xB9CE;&amp;#xC558;&amp;#xACE0; &amp;#xD30C;&amp;#xC77C; &amp;#xD37C;&amp;#xC9D5;&amp;#xB9CC; &amp;#xD574;&amp;#xBD24;&amp;#xC9C0; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC740; &amp;#xC548;&amp;#xD574;&amp;#xBD24;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xAD1C;&amp;#xCC2E;&amp;#xC740; &amp;#xAE00;&amp;#xC774; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xBC88;&amp;#xC5ED;&amp;#xD574;&amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC758;&amp;#xC5ED;&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC624;&amp;#xD0C0;&amp;#xB098; &amp;#xBC88;&amp;#xC5ED;&amp;#xC774; &amp;#xC5B4;&amp;#xC0C9;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xB313;&amp;#xAE00;&amp;#xB85C; &amp;#xC9C0;&amp;#xC801;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;. &amp;#xD639;&amp;#xC2DC;&amp;#xB098; &amp;#xBC88;&amp;#xC5ED;&amp;#xD574;&amp;#xC92C;&amp;#xC73C;&amp;#xBA74; &amp;#xD558;&amp;#xB294; &amp;#xAE00;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xCD94;&amp;#xCC9C; &amp;#xBD80;&amp;#xD0C1;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xBE68;&amp;#xB9AC; &amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;!&lt;/p&gt;
&lt;hr&gt;
&lt;h1 id=&#34;&amp;#xC778;&amp;#xC0AC;&amp;#xB9D0;&#34;&gt;&lt;a href=&#34;#&amp;#xC778;&amp;#xC0AC;&amp;#xB9D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC778;&amp;#xC0AC;&amp;#xB9D0;&#34;&gt;&lt;/a&gt;&amp;#xC778;&amp;#xC0AC;&amp;#xB9D0;&lt;/h1&gt;&lt;p&gt;&amp;#xC774; &amp;#xD3EC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; Windows RDP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84;&amp;#xB4E4;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xACAA;&amp;#xC740; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB4E4;&amp;#xACFC; &amp;#xADF8; &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB2E4;&amp;#xB8F0; &amp;#xC608;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xC548; &amp;#xCEE4;&amp;#xBBA4;&amp;#xB2C8;&amp;#xD2F0;&amp;#xB294; Microsoft&amp;#xC758; Remote Desktop Protocol(RDP)&amp;#xB97C; &amp;#xC608;&amp;#xC804;&amp;#xBD80;&amp;#xD130; &amp;#xAD00;&amp;#xC2EC;&amp;#xC788;&amp;#xAC8C; &amp;#xC9C0;&amp;#xCF1C;&amp;#xBD10;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 2019&amp;#xB144;&amp;#xC5D0;&amp;#xB294; &lt;a href=&#34;https://www.bankinfosecurity.com/top-ransomware-attack-vectors-rdp-drive-by-phishing-a-14353&#34;&gt;&amp;#xBA87; &amp;#xBC31;&amp;#xB9CC;&amp;#xB300;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD06C;&amp;#xB9AC;&amp;#xD2F0;&amp;#xCEEC;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&lt;/a&gt;&amp;#xB4E4;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC740; &amp;#xD32C;&amp;#xB300;&amp;#xBBF9; &amp;#xC2DC;&amp;#xAE30;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xC7AC;&amp;#xD0DD;&amp;#xADFC;&amp;#xBB34;&amp;#xB97C; &amp;#xD558;&amp;#xB294; &amp;#xD68C;&amp;#xC0AC;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C;&amp;#xB294; &amp;#xBA87; &amp;#xBC30;&amp;#xB85C; &amp;#xB354; &amp;#xD070; &amp;#xC704;&amp;#xD611;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xAC00;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xCC98;&amp;#xC74C; &amp;#xC2DC;&amp;#xC791;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; VM&amp;#xC5D0; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC5D0; &amp;#xAD00;&amp;#xC2EC;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Azure&amp;#xC758; Windows &amp;#xBA38;&amp;#xC2E0; &amp;#xD639;&amp;#xC740; Hyper-V &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD560; &amp;#xB54C; RDP&amp;#xB97C; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, RDP&amp;#xC5D0; &amp;#xB208;&amp;#xC744; &amp;#xB3CC;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB4E4;&amp;#xACFC; &amp;#xB611;&amp;#xAC19;&amp;#xC774; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xAD6C;&amp;#xAE00;&amp;#xB9C1;&amp;#xC744; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &lt;a href=&#34;https://www.youtube.com/watch?v=dGLrK8tUAFs&#34;&gt;&amp;#xBC15;&amp;#xCC9C;&amp;#xC131;&amp;#xB2D8;, &amp;#xC7A5;&amp;#xC601;&amp;#xC9C4;&amp;#xB2D8;, &amp;#xAE40;&amp;#xC2B9;&amp;#xC8FC;&amp;#xB2D8;, &amp;#xC774;&amp;#xAE30;&amp;#xD0DD;&amp;#xB2D8;&amp;#xC758; RDP fuzzing&amp;#xC5D0; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; BlackHat Europe 2019 &amp;#xBC1C;&amp;#xD45C;&lt;/a&gt;&amp;#xB97C; &amp;#xC811;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xBE60;&amp;#xB974;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD588;&amp;#xC74C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBD88;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xBA87; &amp;#xC2DC;&amp;#xAC04;&amp;#xB9CC;&amp;#xC5D0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xCC3E;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xADF8;&amp;#xB4E4;&amp;#xC758; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD655;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xD37C;&amp;#xD3EC;&amp;#xBA3C;&amp;#xC2A4;&amp;#xB97C; &amp;#xAC1C;&amp;#xC120;&amp;#xD558;&amp;#xC5EC; RDP&amp;#xC5D0;&amp;#xC11C; Remote Code Execution(RCE) &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xBD88;&amp;#xD589;&amp;#xD788;&amp;#xB3C4;(&amp;#xD639;&amp;#xC740; &amp;#xC6B4;&amp;#xC774; &amp;#xC88B;&amp;#xAC8C;&amp;#xB3C4;, &amp;#xBCF4;&amp;#xB294; &amp;#xC2DC;&amp;#xAC01;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xB97C; &amp;#xC218; &amp;#xC788;&amp;#xC74C;), &amp;#xBAA8;&amp;#xB4E0; &amp;#xD37C;&amp;#xC9D5; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xB4E4;&amp;#xC774; &amp;#xD06C;&amp;#xB9AC;&amp;#xD2F0;&amp;#xCEEC;&amp;#xD55C; &amp;#xAC83;&amp;#xC740; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;(&lt;a href=&#34;https://en.wikipedia.org/wiki/Survivorship_bias&#34;&gt;Survivorship Bias&lt;/a&gt; &amp;#xCC38;&amp;#xACE0;). &amp;#xC544;&amp;#xC9C1; RDP RCE&amp;#xB97C; &amp;#xCC3E;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBC84;&amp;#xADF8;&amp;#xB4E4;&amp;#xC744; &amp;#xCC3E;&amp;#xC558;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xACFC; &amp;#xAD6C;&amp;#xC131; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD37C;&amp;#xC9D5; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBC0F; &amp;#xD234;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E0; &amp;#xD37C;&amp;#xC9D5; &amp;#xC778;&amp;#xD504;&amp;#xB77C;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xD0C0;&amp;#xAC9F;&amp;#xB4E4;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xC815;&amp;#xB3C4;&amp;#xB85D; &amp;#xC81C;&amp;#xB124;&amp;#xB7F4;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD3EC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB4E4;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA3C;&amp;#xC800; RDP&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD588;&amp;#xB294;&amp;#xC9C0;, &amp;#xC5B4;&amp;#xB5A4; &amp;#xBB38;&amp;#xC81C;&amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xD574;&amp;#xCCD0;&amp;#xB098;&amp;#xAC14;&amp;#xB294;&amp;#xC9C0; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACFC;&amp;#xC815;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xAC8C;&amp;#xB41C; &amp;#xBC84;&amp;#xADF8;&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC598;&amp;#xAE30;&amp;#xD574; &amp;#xBCF4;&amp;#xACE0;&amp;#xC790; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;RDP-Overview&#34;&gt;&lt;a href=&#34;#RDP-Overview&#34; class=&#34;headerlink&#34; title=&#34;RDP Overview&#34;&gt;&lt;/a&gt;RDP Overview&lt;/h1&gt;&lt;p&gt;Remote Desktop Protocol&amp;#xC740; Windows &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD560; &amp;#xB54C; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD5C;&amp;#xADFC; Malwaretech&amp;#xB294; RDP&amp;#xB97C; &amp;#xB450;&amp;#xACE0; &amp;#x201C;&amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xB4E4;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD45C;&amp;#xD604;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. RDP&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCEE4;&amp;#xB125;&amp;#xC158;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xC5EC; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCC44;&amp;#xB110; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC811;&amp;#xC18D;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xACE0; &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB9D0;&amp;#xC740; &amp;#xC989;&amp;#xC2A8;, &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xCC44;&amp;#xB110;&amp;#xB4E4;&amp;#xC740; &amp;#xAC01;&amp;#xC790; &amp;#xB370;&amp;#xC774;&amp;#xD130;, &amp;#xC784;&amp;#xC758; &amp;#xC815;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xC11C; &amp;#xD578;&amp;#xB4E4;&amp;#xB9C1;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xBBF8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xADFC;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; RDP&amp;#xAC00; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xBBF8;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/17/j0ker/rdp_fuzzing1/Untitled.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;RDP &amp;#xC5F0;&amp;#xACB0; &amp;#xC2DC;&amp;#xC758; &amp;#xCC44;&amp;#xB110;&amp;#xB4E4;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;RDP &amp;#xD328;&amp;#xB110;&amp;#xC740; &amp;#xC815;&amp;#xC801;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xB3D9;&amp;#xC801;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB458;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xAE00;&amp;#xC758; &amp;#xC694;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC97;&amp;#xC5B4;&amp;#xB098;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC598;&amp;#xAE30;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; RDP&amp;#xC758; &amp;#xB0B4;&amp;#xBD80; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC880; &amp;#xB354; &amp;#xC54C;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xC2DC;&amp;#xB2E4;&amp;#xBA74;, &lt;a href=&#34;https://www.cyberark.com/resources/threat-research-blog/explain-like-i-m-5-remote-desktop-protocol-rdp&#34;&gt;&amp;#xC774; &amp;#xAE00;&lt;/a&gt;&amp;#xC744; &amp;#xC77D;&amp;#xC73C;&amp;#xC2DC;&amp;#xB294;&amp;#xAC78; &amp;#xCD94;&amp;#xCC9C;&amp;#xB4DC;&amp;#xB824;&amp;#xC694;. &amp;#xBC18;&amp;#xBA74;&amp;#xC5D0; &amp;#xD37C;&amp;#xC9D5; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC880; &amp;#xB354; &amp;#xC54C;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xCC3E;&amp;#xC544;&amp;#xC624;&amp;#xC168;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC08;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;h1 id=&#34;Challenges-in-RDP-Fuzzing&#34;&gt;&lt;a href=&#34;#Challenges-in-RDP-Fuzzing&#34; class=&#34;headerlink&#34; title=&#34;Challenges in RDP Fuzzing&#34;&gt;&lt;/a&gt;Challenges in RDP Fuzzing&lt;/h1&gt;&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xD37C;&amp;#xC9D5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xD639;&amp;#xC740; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC;&amp;#xC73C;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xC778;&amp;#xD48B; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC774;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xB364;&amp;#xACA8;&amp;#xBC1B;&amp;#xC544; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0; &amp;#xD37C;&amp;#xC800;&amp;#xAC00; &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCE21;&amp;#xC815;&amp;#xD55C; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xACE0; &amp;#xBCC0;&amp;#xC870;&amp;#xB41C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xBC18;&amp;#xBCF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;RDP &amp;#xD37C;&amp;#xC9D5;&amp;#xC740; RDP &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xD56D;&amp;#xC0C1; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xC640;&amp;#xB294; &amp;#xC0AC;&amp;#xBB47; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD37C;&amp;#xC800;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xB123;&amp;#xB294; &amp;#xC778;&amp;#xD48B;&amp;#xC740; &amp;#xCEE4;&amp;#xB125;&amp;#xC158;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xCC44;&amp;#xB110;(&amp;#xD37C;&amp;#xC9D5; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC74C;)&amp;#xC758; &amp;#xCD5C;&amp;#xC0C1;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; Protocol Data Unit(PDU)&amp;#xB85C;&amp;#xC368; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xC548;&amp;#xAE09;&amp;#xD588;&amp;#xB358; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xCC44;&amp;#xB110;&amp;#xC740; &amp;#xAC01;&amp;#xC790; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC774;&amp;#xC720; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xCCBC;&amp;#xB9B0;&amp;#xC9C0;&amp;#xB4E4;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xC774;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;/&amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C;&amp;#xB3C4; &amp;#xD574;&amp;#xB2F9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC74C;)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Client-Server architecture : &amp;#xC804;&amp;#xD1B5;&amp;#xC801;&amp;#xC778; &amp;#xD37C;&amp;#xC9D5;&amp;#xC5D0;&amp;#xC11C; &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xC2EC;&amp;#xD50C;&amp;#xD558;&amp;#xAC8C; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xB123;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xB9CC; &amp;#xD55C;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;-&amp;#xC11C;&amp;#xBC84; &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD55C; &amp;#xCABD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; &amp;#xC778;&amp;#xD48B;&amp;#xC740; &amp;#xB2E4;&amp;#xB978; &amp;#xD55C;&amp;#xCABD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC804;&amp;#xB2EC;&amp;#xB41C;&amp;#xB2E4;. RDP&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;, &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC591;&amp;#xCABD;&amp;#xC740; &amp;#xB2E4;&amp;#xB978; &amp;#xBA38;&amp;#xC2E0;(&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84; &amp;#xC758;&amp;#xBBF8;)&amp;#xC774;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Statefulness : RDP&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC; &amp;#xAE30;&amp;#xBC18; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;(&amp;#xC5F0;&amp;#xACB0; &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; &amp;#xC9C0;&amp;#xC18D;&amp;#xB418;&amp;#xB294;? &amp;#xAC19;&amp;#xC740; &amp;#xC758;&amp;#xBBF8;&amp;#xC778;&amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;)&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB9D0;&amp;#xC740; &amp;#xD37C;&amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xC640;&amp;#xC911;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC5F0;&amp;#xACB0; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xACE0;&amp;#xB824;&amp;#xD574;&amp;#xC57C;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD37C;&amp;#xC815; &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC5D0; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&amp;#xD37C;&amp;#xC9D5; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC740; &amp;#xBCF4;&amp;#xD1B5; &amp;#xC77C;&amp;#xAD00;&amp;#xC131;, &amp;#xC989; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xB123;&amp;#xC73C;&amp;#xBA74; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Multi-input fuzzing : &amp;#xB9CC;&amp;#xC57D; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC778;&amp;#xD48B;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1B;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;(file-format fuzzing), &amp;#xD0C0;&amp;#xAC9F;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC778;&amp;#xD48B;&amp;#xC740; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD30C;&amp;#xC77C; &amp;#xC548;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB450; &amp;#xB2F4;&amp;#xACA8;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC18;&amp;#xB300;&amp;#xB85C;, &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xCF54;&amp;#xB4DC; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xBC1C;&amp;#xAD74;&amp;#xD574;&amp;#xB0B4;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC5F0;&amp;#xC18D;&amp;#xC801;&amp;#xC778; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC57C;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Finding the target code : coverage-guided fuzzing&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xD578;&amp;#xB4E4;&amp;#xB9C1;&amp;#xD558;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD568;&amp;#xC218; &amp;#xAC19;&amp;#xC774; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0; &amp;#xCE21;&amp;#xC815; &amp;#xC2DC;&amp;#xC791; &amp;#xC9C0;&amp;#xC810;&amp;#xC744; &amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC54C;&amp;#xB824;&amp;#xC918;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. RDP&amp;#xC5D0;&amp;#xB294; &amp;#xB3D9;&amp;#xC791;&amp;#xC5D0; &amp;#xAD00;&amp;#xC5EC;&amp;#xD558;&amp;#xB294; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB4E4;&amp;#xC774; &amp;#xB9E4;&amp;#xC6B0; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xC9C0;&amp;#xC810;&amp;#xC744; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xB294;&amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC5B4;&amp;#xB835;&amp;#xC6B8; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; 4 &amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2DC;&amp;#xC791;&amp;#xD560; &amp;#xB54C; &amp;#xC608;&amp;#xC0C1;&amp;#xD588;&amp;#xB358; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0;&amp;#xB4E4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C; &amp;#xC139;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC774; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0;&amp;#xB4E4;&amp;#xACFC; &amp;#xCD94;&amp;#xD6C4;&amp;#xC5D0; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xB610; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD574;&amp;#xACB0;&amp;#xD588;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB2E4;&amp;#xB8F0; &amp;#xC608;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Techincal-Details-The-Challenges-and-How-to-Overcome-Them&#34;&gt;&lt;a href=&#34;#Techincal-Details-The-Challenges-and-How-to-Overcome-Them&#34; class=&#34;headerlink&#34; title=&#34;Techincal Details : The Challenges and How to Overcome Them&#34;&gt;&lt;/a&gt;Techincal Details : The Challenges and How to Overcome Them&lt;/h1&gt;&lt;p&gt;&amp;#xC774; &amp;#xC139;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; &amp;#xAC1C;&amp;#xBC1C; &amp;#xC138;&amp;#xBD80; &amp;#xB0B4;&amp;#xC6A9;&amp;#xACFC; &amp;#xB9C8;&amp;#xC8FC;&amp;#xCE58;&amp;#xAC8C;&amp;#xB41C; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0;&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xD37C;&amp;#xC9D5; &amp;#xC14B;&amp;#xC5C5;&amp;#xC744; &amp;#xAC16;&amp;#xCD94;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB300;&amp;#xCC98;&amp;#xD588;&amp;#xB294; &amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB3C4; &amp;#xC598;&amp;#xAE30;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;. &amp;#xC774; &lt;a href=&#34;https://github.com/cyberark/rdpfuzz&#34;&gt;&amp;#xB808;&amp;#xD3EC;&lt;/a&gt;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC2DC;&amp;#xBA74; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD639;&amp;#xC2DC; &amp;#xC774; &amp;#xCABD;&amp;#xC5D0; &amp;#xAD00;&amp;#xC2EC;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74;, &amp;#xCC98;&amp;#xC74C; &amp;#xC2DC;&amp;#xC791;&amp;#xD560; &amp;#xB54C; &amp;#xB9CE;&amp;#xC740; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB420;&amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Client-Server-Architecture&#34;&gt;&lt;a href=&#34;#Client-Server-Architecture&#34; class=&#34;headerlink&#34; title=&#34;Client-Server Architecture&#34;&gt;&lt;/a&gt;Client-Server Architecture&lt;/h2&gt;&lt;p&gt;&amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; Windows&amp;#xC758; RDP &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xBAA8;&amp;#xB450;&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. RDP &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; &amp;#xBAA9;&amp;#xD45C;&amp;#xB294; &amp;#xBA85;&amp;#xD655;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC774;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; Windows &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xC6D0;&amp;#xACA9;&amp;#xC5D0;&amp;#xC11C; &amp;#xACF5;&amp;#xACA9;&amp;#xD574; &amp;#xC811;&amp;#xADFC; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;. RDP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD588;&amp;#xB358; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xC880; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC774;&amp;#xBBF8; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD588;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8;&amp;#xB4E4;&amp;#xC740; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xC900;&amp;#xBE44;&amp;#xD558;&amp;#xACE0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xAE30;&amp;#xB9CC;&amp;#xC744; &amp;#xAE30;&amp;#xB2E4;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;. &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xAC00; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xACF5;&amp;#xACA9;&amp;#xD574; &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xC758; &amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC7A5;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xAC00; &amp;#xADF8;&amp;#xB4E4;&amp;#xC774; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xBA74; &amp;#xC774;&amp;#xB7F0; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, Hyper-V&amp;#xAC00; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC811;&amp;#xC18D;&amp;#xD560; &amp;#xB54C; RDP&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; VM Escape&amp;#xC5D0;&amp;#xB3C4; &amp;#xD65C;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;RDP &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Instrumentation engine : &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xCE21;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Mutation engine : &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Input sender : &amp;#xC801;&amp;#xC808;&amp;#xD560; &amp;#xD0C0;&amp;#xAC9F; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Target binary : intrumentation engine&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xD2B8;&amp;#xB798;&amp;#xD0B9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB9C8; &amp;#xC0C1;&amp;#xC0C1;&amp;#xB418;&amp;#xC2DC;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xB300;&amp;#xC0C1;&amp;#xC758; &amp;#xD37C;&amp;#xC9D5; &amp;#xC14B;&amp;#xC5C5;&amp;#xC740; &amp;#xC880; &amp;#xB2E4;&amp;#xB974;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xC720;&amp;#xC0AC;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xBD80;&amp;#xD130; &amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/17/j0ker/rdp_fuzzing1/1.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xD37C;&amp;#xC9D5; &amp;#xC14B;&amp;#xC5C5;(&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84; &amp;#xBAA8;&amp;#xB450;)&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F; &amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xAD6C;&amp;#xC131;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Fuzzer : &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140; afl-fuzz.exe&lt;/li&gt;
&lt;li&gt;Instrumentation engine : in-app instrumentation &amp;#xBAA8;&amp;#xB4DC;&amp;#xC758; DynamoRIO&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140; winafl.dll&lt;ul&gt;
&lt;li&gt;&amp;#xCEE4;&amp;#xC2A4;&amp;#xD140; &amp;#xBE4C;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; WinAFL&amp;#xACFC; DynamoRIO&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xC139;&amp;#xC158;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD574; &amp;#xC8FC;&amp;#xC138;&amp;#xC694;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Inputs(&amp;#xD639;&amp;#xC740; test cases) : &amp;#xD0C0;&amp;#xAC9F;&amp;#xACFC; &amp;#xC778;&amp;#xD48B; &amp;#xC13C;&amp;#xB354; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; &amp;#xACF5;&amp;#xC720;&amp;#xB418;&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC548; &amp;#xC784;&amp;#xC2DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC4F0;&amp;#xC774;&amp;#xB294; &amp;#xBCC0;&amp;#xC870;&amp;#xB41C; PDU&amp;#xB4E4;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC778;&amp;#xD48B; &amp;#xC13C;&amp;#xB354;&amp;#xC5D0;&amp;#xB294; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB9CC; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Agent : &amp;#xC784;&amp;#xC2DC; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC744; &amp;#xC77D;&amp;#xACE0; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD328;&amp;#xB110;&amp;#xC5D0; &amp;#xC778;&amp;#xD48B;&amp;#xB4E4;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xC138;&amp;#xD305;&amp;#xC744; &amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xD37C;&amp;#xC9D5; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xAC00;&amp;#xC0C1;&amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#x201C;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#x201D;&amp;#xD55C; RDP &amp;#xC5F0;&amp;#xACB0; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC778;&amp;#xD48B; &amp;#xC0DD;&amp;#xC131; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xACFC; &amp;#xBD84;&amp;#xB9AC;&amp;#xC2DC;&amp;#xCF1C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC774; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; RDP &amp;#xD55C;&amp;#xCABD;&amp;#xC5D0;&amp;#xC11C;&amp;#xBD80;&amp;#xD130; &amp;#xB2E4;&amp;#xB978; &amp;#xD55C;&amp;#xCABD;&amp;#xC778; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC5D0;&amp;#xAC8C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC804;&amp;#xB2EC; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; WinAFL&amp;#xC758; in-app instrumentation mode&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Coverage-guided fuzzing&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC785;&amp;#xB825;&amp;#xACFC; &amp;#xC785;&amp;#xB825;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xC77C;&amp;#xB300;&amp;#xC77C; &amp;#xB300;&amp;#xC751;&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xC758; PDU&amp;#xB4E4;&amp;#xACFC; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; PDU&amp;#xB4E4;&amp;#xC744; &amp;#xAD6C;&amp;#xBD84;&amp;#xD558;&amp;#xACE0; &amp;#xD37C;&amp;#xC800;&amp;#xC758; PDU&amp;#xB4E4;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xACBD;&amp;#xB85C;&amp;#xB9CC; &amp;#xD2B8;&amp;#xB798;&amp;#xD0B9;&amp;#xD558;&amp;#xB294; &amp;#x201C;background fuzzing&amp;#x201D;&amp;#xC744; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC5F0;&amp;#xACB0; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xB79C;&amp;#xB364;&amp;#xD55C; PDU&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; PDU&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD2B8;&amp;#xB798;&amp;#xD0B9;&amp;#xD558;&amp;#xAE30;&amp;#xB97C; &amp;#xC6D0;&amp;#xD588;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB294; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD574;&amp;#xB97C; &amp;#xB3D5;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; RDP &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB85C; &amp;#xC624;&amp;#xB514;&amp;#xC624;&amp;#xB97C; &amp;#xB9AC;&amp;#xB2E4;&amp;#xC774;&amp;#xB809;&amp;#xD2B8;&amp;#xD558;&amp;#xB294; RDPSND &amp;#xAC00;&amp;#xC0C1; &amp;#xCC44;&amp;#xB110;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5;&amp;#xD560; &amp;#xB54C; &amp;#xC5B4;&amp;#xB5A4;&amp;#xC9C0; &amp;#xD55C;&amp;#xBC88; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpea/bea2d5cf-e3b9-4419-92e5-0e074ff9bc5b&#34;&gt;&amp;#xACF5;&amp;#xC2DD; &amp;#xBB38;&amp;#xC11C;&lt;/a&gt;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; PDU &amp;#xC74C;&amp;#xB2F5;&amp;#xC758; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB294; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC758; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/17/j0ker/rdp_fuzzing1/2.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;msgType&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xC740; 0x01 ~ 0x0D &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xCCAB; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xCD5C;&amp;#xC0C1;&amp;#xC704; &amp;#xBE44;&amp;#xD2B8;&amp;#xB97C; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5; &amp;#xB9C8;&amp;#xCEE4;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; PDU&amp;#xB97C; &amp;#xBCF4;&amp;#xB0BC; &amp;#xB54C; &amp;#xCCAB; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xCD5C;&amp;#xC0C1;&amp;#xC704; &amp;#xBE44;&amp;#xD2B8;&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;WinAFL&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xD578;&amp;#xB4E4;&amp;#xB9C1;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xCD5C;&amp;#xC0C1;&amp;#xC704; &amp;#xBE44;&amp;#xD2B8;&amp;#xB97C; &amp;#xCCB4;&amp;#xD06C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xD574;&amp;#xB2F9; &amp;#xBE44;&amp;#xD2B8;&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74;(&amp;#xAC12;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74;), WinAFL&amp;#xC740; &amp;#xD574;&amp;#xB2F9; &amp;#xBE44;&amp;#xD2B8;&amp;#xB97C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xCE21;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xD574;&amp;#xB2F9; &amp;#xBE44;&amp;#xD2B8;&amp;#xAC00; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xBB34;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xCE21;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84; &amp;#xC14B;&amp;#xC5C5;&amp;#xC758; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xC810;&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xB2E4;&amp;#xB978; &amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xBCF4;&amp;#xC8E0;. &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Client-Fuzzing-Setup&#34;&gt;&lt;a href=&#34;#Client-Fuzzing-Setup&#34; class=&#34;headerlink&#34; title=&#34;Client Fuzzing Setup&#34;&gt;&lt;/a&gt;Client Fuzzing Setup&lt;/h2&gt;&lt;p&gt;Windwos RDP client&amp;#xB294; mstsc.exe&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xAC00;&amp;#xC0C1; &amp;#xCC44;&amp;#xB110; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xB85C;&amp;#xC9C1;&amp;#xC740; mstscax.dll&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Hyper-V &amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xC6D0;&amp;#xACA9; &amp;#xC811;&amp;#xADFC; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC778; vmconnect.exe&amp;#xB3C4; &amp;#xB611;&amp;#xAC19;&amp;#xC774; mstscax.dll&amp;#xC5D0; &amp;#xCF54;&amp;#xC5B4; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/17/j0ker/rdp_fuzzing1/3.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Windows RDP Client&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB2E8;&amp;#xC21C;&amp;#xC131;&amp;#xACFC; &amp;#xD6A8;&amp;#xC728;&amp;#xC131;&amp;#xC744; &amp;#xC704; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84;(&amp;#xD0C0;&amp;#xAC9F;&amp;#xACFC; &amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;)&amp;#xB97C; &amp;#xAC19;&amp;#xC740; &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; localhost/127.0.0.1&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;) &amp;#xB610;&amp;#xD55C; &amp;#xBCD1;&amp;#xB839; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC787;&amp;#xAC8C; mimikatz&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC5EC;&amp;#xB7EC; RDP &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/17/j0ker/rdp_fuzzing1/4.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC14B;&amp;#xC5C5; &amp;#xAD6C;&amp;#xC131;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Target : mstsc.exe&amp;#xC640; &amp;#xD0C0;&amp;#xAC9F; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC778; mstscax.dll&lt;/li&gt;
&lt;li&gt;Instrumentation : &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; DynamoRIO&amp;#xC640; &amp;#xCF54;&amp;#xB4DC;&amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB294; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; DynamoRIO &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC778; winafl.dll&lt;/li&gt;
&lt;li&gt;Mutation engine : &amp;#xAC19;&amp;#xC740; &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC4F0;&amp;#xB294; AFL-Fuzzer&lt;/li&gt;
&lt;li&gt;Input sender : &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC624;&amp;#xD508;&amp;#xD558;&amp;#xACE0; &amp;#xC120;&amp;#xD0DD;&amp;#xB41C; &amp;#xAC00;&amp;#xC0C1; &amp;#xCC44;&amp;#xB110;&amp;#xB85C; PDU&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; RDPFuzzAgent. &amp;#xC774; &amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;&amp;#xB294; AFL-Fuzz&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC77D;&amp;#xC5B4;&amp;#xC624;&amp;#xB294; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC744; &amp;#xD0C0;&amp;#xCF13; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xAD6C;&amp;#xC131;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xCD08;&amp;#xB2F9; 50 ~ 100 &amp;#xBC88; &amp;#xC2E4;&amp;#xD589;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xBE60;&amp;#xB978; &amp;#xC18D;&amp;#xB3C4;&amp;#xB294; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC55E;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD55C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC18D;&amp;#xB3C4;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294; &amp;#xBE68;&amp;#xB790;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xB9CC;&amp;#xC871;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Server-Fuzzing-Setup&#34;&gt;&lt;a href=&#34;#Server-Fuzzing-Setup&#34; class=&#34;headerlink&#34; title=&#34;Server Fuzzing Setup&#34;&gt;&lt;/a&gt;Server Fuzzing Setup&lt;/h2&gt;&lt;p&gt;RDP &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xBA54;&amp;#xC778; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC7A0;&amp;#xAE50; &lt;code&gt;Remote Desktop Service&lt;/code&gt; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xD6D1;&amp;#xACE0; &amp;#xAC00;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs powershell&#34;&gt;&lt;span class=&#34;hljs-built_in&#34;&gt;PS&lt;/span&gt; C:\&amp;gt; &lt;span class=&#34;hljs-built_in&#34;&gt;gci&lt;/span&gt; HKLM:\SYSTEM\CurrentControlSet\Services\&lt;span class=&#34;hljs-variable&#34;&gt;$&lt;/span&gt;((&lt;span class=&#34;hljs-built_in&#34;&gt;Get-Service&lt;/span&gt; &lt;span class=&#34;hljs-literal&#34;&gt;-Name&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Remote Desktop Services&amp;quot;&lt;/span&gt;).Name)
    Hive: HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\TermService
Name                           Property
----                           --------
Parameters                     ServiceDll             : C:\Windows\System32\termsrv.dll
. . .&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;RDP &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xBA54;&amp;#xC778; &amp;#xB85C;&amp;#xC9C1;&amp;#xC740; termsrv.dll&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774; dll&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xCEE4;&amp;#xB9E8;&amp;#xB4DC; &amp;#xB77C;&amp;#xC778;&amp;#xC73C;&amp;#xB85C; svchost.exe&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs latex&#34;&gt;C:&lt;span class=&#34;hljs-tag&#34;&gt;\&lt;span class=&#34;hljs-name&#34;&gt;Windows&lt;/span&gt;&lt;/span&gt;&lt;span class=&#34;hljs-tag&#34;&gt;\&lt;span class=&#34;hljs-name&#34;&gt;System&lt;/span&gt;&lt;/span&gt;32&lt;span class=&#34;hljs-tag&#34;&gt;\&lt;span class=&#34;hljs-name&#34;&gt;svchost&lt;/span&gt;&lt;/span&gt;.exe -k NetworkService -s TermService&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84; &amp;#xD37C;&amp;#xC9D5; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC720;&amp;#xC0AC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;TermService&lt;/code&gt;&amp;#xC758; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC19;&amp;#xC740; &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xB97C; &amp;#xBCD1;&amp;#xB82C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC5C8;&amp;#xC8E0;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xC11C; &amp;#xAF64;&amp;#xB098; &amp;#xD070; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0;&amp;#xAC00; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC774;&amp;#xB97C; &amp;#xACE0;&amp;#xCE58;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB178;&amp;#xB825;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &lt;code&gt;termsrv.dll&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;TermService&lt;/code&gt;&amp;#xC640; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xB4E4;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xD558;&amp;#xB4DC;&amp;#xCF54;&amp;#xB529;&amp;#xB41C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xB4E4;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xC600;&amp;#xACE0;, &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xADF8;&amp;#xB0E5; &amp;#xC5EC;&amp;#xB7EC; VM&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xBCD1;&amp;#xB82C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xD37C;&amp;#xC9D5; &amp;#xC14B;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC11C;&amp;#xBC84; &amp;#xC0AC;&amp;#xC774;&amp;#xB4DC; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &lt;a href=&#34;https://docs.microsoft.com/en-us/windows/win32/api/wtsapi32/nf-wtsapi32-wtsvirtualchannelwrite&#34;&gt;&lt;code&gt;WTSVirtualChannelWrite()&lt;/code&gt;&lt;/a&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; &amp;#xD37C;&amp;#xC9D5; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC804;&amp;#xC1A1;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; RDP &amp;#xC5F0;&amp;#xACB0; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; API&amp;#xB294; &amp;#xCC3E;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xC600;&amp;#xC8E0;. &amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140;&amp;#xD55C; &lt;a href=&#34;https://www.freerdp.com/&#34;&gt;FreeRDP&lt;/a&gt;(&amp;#xC778;&amp;#xC2DC;&amp;#xC788;&amp;#xB294; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; RDP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC8E0;)&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xC6B0;&amp;#xBD84;&amp;#xD22C; &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC774;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xD37C;&amp;#xC9D5; &amp;#xC14B;&amp;#xC5C5;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xACE0; &amp;#xC774;&amp;#xB7F0; &amp;#xC81C;&amp;#xC57D;&amp;#xC870;&amp;#xAC74; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC11C;&amp;#xBC84; &amp;#xD37C;&amp;#xC9D5; &amp;#xC2A4;&amp;#xD53C;&amp;#xB4DC;&amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xD37C;&amp;#xC9D5; &amp;#xC2A4;&amp;#xD53C;&amp;#xB4DC;&amp;#xC758; 1/10 &amp;#xC815;&amp;#xB3C4;&amp;#xB418;&amp;#xB294; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xB0B3;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/17/j0ker/rdp_fuzzing1/5.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84; &amp;#xD37C;&amp;#xC9D5; &amp;#xC0C1;&amp;#xD669;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84; &amp;#xD37C;&amp;#xC9D5; &amp;#xC14B;&amp;#xC5C5;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/17/j0ker/rdp_fuzzing1/6.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Target : &amp;#xD37C;&amp;#xC9D5;&amp;#xD560; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. tarmsrv.dll, audiodg.exe, rdpinput.exe &amp;#xB4F1;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xB2E4;&amp;#xC74C; &amp;#xC139;&amp;#xC158;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#x201C;Locating the relevant code&amp;#x201D; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;. &amp;#xAC01; &amp;#xCC44;&amp;#xB110;&amp;#xC758; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/li&gt;
&lt;li&gt;Instrumentation : &amp;#xC774;&amp;#xB7F0; &amp;#xC14B;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xAC00; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xCE21;&amp;#xC815;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; instrument&amp;#xD560; &amp;#xC218; &amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; WinAFL&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xACE0; &amp;#xD655;&amp;#xC7A5;&amp;#xC131;&amp;#xACFC; &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC744; &amp;#xC704;&amp;#xD574; DynamoRIO&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;DynamoRIO : DynamoRIO&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBC16;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; attach&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC774; &lt;a href=&#34;https://github.com/DynamoRIO/dynamorio/pull/3328&#34;&gt;pull request&lt;/a&gt;&amp;#xB97C; &amp;#xC218;&amp;#xC815; &amp;#xBC0F; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD558;&amp;#xC600;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; WinAFL&amp;#xC5D0; &amp;#xBD99;&amp;#xC5EC; &amp;#xD65C;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Mutation engine : Windows &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xACF5;&amp;#xC720; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC4F0;&amp;#xB294; AFL-Fuzzer&lt;/li&gt;
&lt;li&gt;Input sender : Windows &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xB294; FreeRDP&amp;#xB85C; &amp;#xACF5;&amp;#xC720; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC744; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xACE0; &amp;#xD0C0;&amp;#xAC9F; RDP &amp;#xCC44;&amp;#xB110;&amp;#xC5D0; &amp;#xC804;&amp;#xC1A1;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Translation] Fuzzing RDP: Holding the Stick at Both Ends (1) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; &amp;#xB9C1;&amp;#xD06C; : &lt;a href=&#34;https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-both-ends&#34;&gt;https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-both-ends&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. j0ker&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD3C9;&amp;#xC18C;&amp;#xC5D0; &amp;#xD37C;&amp;#xC9D5;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB3C4; &amp;#xAD00;&amp;#xC2EC;&amp;#xC774; &amp;#xB9CE;&amp;#xC558;&amp;#xACE0; &amp;#xD30C;&amp;#xC77C; &amp;#xD37C;&amp;#xC9D5;&amp;#xB9CC; &amp;#xD574;&amp;#xBD24;&amp;#xC9C0; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC740; &amp;#xC548;&amp;#xD574;&amp;#xBD24;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xAD1C;&amp;#xCC2E;&amp;#xC740; &amp;#xAE00;&amp;#xC774; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xBC88;&amp;#xC5ED;&amp;#xD574;&amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC758;&amp;#xC5ED;&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC624;&amp;#xD0C0;&amp;#xB098; &amp;#xBC88;&amp;#xC5ED;&amp;#xC774; &amp;#xC5B4;&amp;#xC0C9;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xB313;&amp;#xAE00;&amp;#xB85C; &amp;#xC9C0;&amp;#xC801;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;. &amp;#xD639;&amp;#xC2DC;&amp;#xB098; &amp;#xBC88;&amp;#xC5ED;&amp;#xD574;&amp;#xC92C;&amp;#xC73C;&amp;#xBA74; &amp;#xD558;&amp;#xB294; &amp;#xAE00;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xCD94;&amp;#xCC9C; &amp;#xBD80;&amp;#xD0C1;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xBE68;&amp;#xB9AC; &amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;!&lt;/p&gt;
&lt;hr&gt;
&lt;h1 id=&#34;&amp;#xC778;&amp;#xC0AC;&amp;#xB9D0;&#34;&gt;&lt;a href=&#34;#&amp;#xC778;&amp;#xC0AC;&amp;#xB9D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC778;&amp;#xC0AC;&amp;#xB9D0;&#34;&gt;&lt;/a&gt;&amp;#xC778;&amp;#xC0AC;&amp;#xB9D0;&lt;/h1&gt;&lt;p&gt;&amp;#xC774; &amp;#xD3EC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; Windows RDP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84;&amp;#xB4E4;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xACAA;&amp;#xC740; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB4E4;&amp;#xACFC; &amp;#xADF8; &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB2E4;&amp;#xB8F0; &amp;#xC608;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xC548; &amp;#xCEE4;&amp;#xBBA4;&amp;#xB2C8;&amp;#xD2F0;&amp;#xB294; Microsoft&amp;#xC758; Remote Desktop Protocol(RDP)&amp;#xB97C; &amp;#xC608;&amp;#xC804;&amp;#xBD80;&amp;#xD130; &amp;#xAD00;&amp;#xC2EC;&amp;#xC788;&amp;#xAC8C; &amp;#xC9C0;&amp;#xCF1C;&amp;#xBD10;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 2019&amp;#xB144;&amp;#xC5D0;&amp;#xB294; &lt;a href=&#34;https://www.bankinfosecurity.com/top-ransomware-attack-vectors-rdp-drive-by-phishing-a-14353&#34;&gt;&amp;#xBA87; &amp;#xBC31;&amp;#xB9CC;&amp;#xB300;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD06C;&amp;#xB9AC;&amp;#xD2F0;&amp;#xCEEC;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&lt;/a&gt;&amp;#xB4E4;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC740; &amp;#xD32C;&amp;#xB300;&amp;#xBBF9; &amp;#xC2DC;&amp;#xAE30;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xC7AC;&amp;#xD0DD;&amp;#xADFC;&amp;#xBB34;&amp;#xB97C; &amp;#xD558;&amp;#xB294; &amp;#xD68C;&amp;#xC0AC;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C;&amp;#xB294; &amp;#xBA87; &amp;#xBC30;&amp;#xB85C; &amp;#xB354; &amp;#xD070; &amp;#xC704;&amp;#xD611;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xAC00;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xCC98;&amp;#xC74C; &amp;#xC2DC;&amp;#xC791;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; VM&amp;#xC5D0; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC5D0; &amp;#xAD00;&amp;#xC2EC;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Azure&amp;#xC758; Windows &amp;#xBA38;&amp;#xC2E0; &amp;#xD639;&amp;#xC740; Hyper-V &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD560; &amp;#xB54C; RDP&amp;#xB97C; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, RDP&amp;#xC5D0; &amp;#xB208;&amp;#xC744; &amp;#xB3CC;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB4E4;&amp;#xACFC; &amp;#xB611;&amp;#xAC19;&amp;#xC774; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xAD6C;&amp;#xAE00;&amp;#xB9C1;&amp;#xC744; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &lt;a href=&#34;https://www.youtube.com/watch?v=dGLrK8tUAFs&#34;&gt;&amp;#xBC15;&amp;#xCC9C;&amp;#xC131;&amp;#xB2D8;, &amp;#xC7A5;&amp;#xC601;&amp;#xC9C4;&amp;#xB2D8;, &amp;#xAE40;&amp;#xC2B9;&amp;#xC8FC;&amp;#xB2D8;, &amp;#xC774;&amp;#xAE30;&amp;#xD0DD;&amp;#xB2D8;&amp;#xC758; RDP fuzzing&amp;#xC5D0; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; BlackHat Europe 2019 &amp;#xBC1C;&amp;#xD45C;&lt;/a&gt;&amp;#xB97C; &amp;#xC811;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xBE60;&amp;#xB974;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD588;&amp;#xC74C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBD88;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xBA87; &amp;#xC2DC;&amp;#xAC04;&amp;#xB9CC;&amp;#xC5D0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xCC3E;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xADF8;&amp;#xB4E4;&amp;#xC758; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD655;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xD37C;&amp;#xD3EC;&amp;#xBA3C;&amp;#xC2A4;&amp;#xB97C; &amp;#xAC1C;&amp;#xC120;&amp;#xD558;&amp;#xC5EC; RDP&amp;#xC5D0;&amp;#xC11C; Remote Code Execution(RCE) &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xBD88;&amp;#xD589;&amp;#xD788;&amp;#xB3C4;(&amp;#xD639;&amp;#xC740; &amp;#xC6B4;&amp;#xC774; &amp;#xC88B;&amp;#xAC8C;&amp;#xB3C4;, &amp;#xBCF4;&amp;#xB294; &amp;#xC2DC;&amp;#xAC01;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xB97C; &amp;#xC218; &amp;#xC788;&amp;#xC74C;), &amp;#xBAA8;&amp;#xB4E0; &amp;#xD37C;&amp;#xC9D5; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xB4E4;&amp;#xC774; &amp;#xD06C;&amp;#xB9AC;&amp;#xD2F0;&amp;#xCEEC;&amp;#xD55C; &amp;#xAC83;&amp;#xC740; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;(&lt;a href=&#34;https://en.wikipedia.org/wiki/Survivorship_bias&#34;&gt;Survivorship Bias&lt;/a&gt; &amp;#xCC38;&amp;#xACE0;). &amp;#xC544;&amp;#xC9C1; RDP RCE&amp;#xB97C; &amp;#xCC3E;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBC84;&amp;#xADF8;&amp;#xB4E4;&amp;#xC744; &amp;#xCC3E;&amp;#xC558;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xACFC; &amp;#xAD6C;&amp;#xC131; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD37C;&amp;#xC9D5; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBC0F; &amp;#xD234;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E0; &amp;#xD37C;&amp;#xC9D5; &amp;#xC778;&amp;#xD504;&amp;#xB77C;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xD0C0;&amp;#xAC9F;&amp;#xB4E4;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xC815;&amp;#xB3C4;&amp;#xB85D; &amp;#xC81C;&amp;#xB124;&amp;#xB7F4;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD3EC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB4E4;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA3C;&amp;#xC800; RDP&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD588;&amp;#xB294;&amp;#xC9C0;, &amp;#xC5B4;&amp;#xB5A4; &amp;#xBB38;&amp;#xC81C;&amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xD574;&amp;#xCCD0;&amp;#xB098;&amp;#xAC14;&amp;#xB294;&amp;#xC9C0; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACFC;&amp;#xC815;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xAC8C;&amp;#xB41C; &amp;#xBC84;&amp;#xADF8;&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC598;&amp;#xAE30;&amp;#xD574; &amp;#xBCF4;&amp;#xACE0;&amp;#xC790; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;RDP-Overview&#34;&gt;&lt;a href=&#34;#RDP-Overview&#34; class=&#34;headerlink&#34; title=&#34;RDP Overview&#34;&gt;&lt;/a&gt;RDP Overview&lt;/h1&gt;&lt;p&gt;Remote Desktop Protocol&amp;#xC740; Windows &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD560; &amp;#xB54C; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD5C;&amp;#xADFC; Malwaretech&amp;#xB294; RDP&amp;#xB97C; &amp;#xB450;&amp;#xACE0; &amp;#x201C;&amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xB4E4;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD45C;&amp;#xD604;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. RDP&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCEE4;&amp;#xB125;&amp;#xC158;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xC5EC; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCC44;&amp;#xB110; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC811;&amp;#xC18D;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xACE0; &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB9D0;&amp;#xC740; &amp;#xC989;&amp;#xC2A8;, &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xCC44;&amp;#xB110;&amp;#xB4E4;&amp;#xC740; &amp;#xAC01;&amp;#xC790; &amp;#xB370;&amp;#xC774;&amp;#xD130;, &amp;#xC784;&amp;#xC758; &amp;#xC815;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xC11C; &amp;#xD578;&amp;#xB4E4;&amp;#xB9C1;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xBBF8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xADFC;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; RDP&amp;#xAC00; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xBBF8;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/17/j0ker/rdp_fuzzing1/Untitled.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;RDP &amp;#xC5F0;&amp;#xACB0; &amp;#xC2DC;&amp;#xC758; &amp;#xCC44;&amp;#xB110;&amp;#xB4E4;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;RDP &amp;#xD328;&amp;#xB110;&amp;#xC740; &amp;#xC815;&amp;#xC801;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xB3D9;&amp;#xC801;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB458;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xAE00;&amp;#xC758; &amp;#xC694;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC97;&amp;#xC5B4;&amp;#xB098;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC598;&amp;#xAE30;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; RDP&amp;#xC758; &amp;#xB0B4;&amp;#xBD80; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC880; &amp;#xB354; &amp;#xC54C;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xC2DC;&amp;#xB2E4;&amp;#xBA74;, &lt;a href=&#34;https://www.cyberark.com/resources/threat-research-blog/explain-like-i-m-5-remote-desktop-protocol-rdp&#34;&gt;&amp;#xC774; &amp;#xAE00;&lt;/a&gt;&amp;#xC744; &amp;#xC77D;&amp;#xC73C;&amp;#xC2DC;&amp;#xB294;&amp;#xAC78; &amp;#xCD94;&amp;#xCC9C;&amp;#xB4DC;&amp;#xB824;&amp;#xC694;. &amp;#xBC18;&amp;#xBA74;&amp;#xC5D0; &amp;#xD37C;&amp;#xC9D5; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC880; &amp;#xB354; &amp;#xC54C;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xCC3E;&amp;#xC544;&amp;#xC624;&amp;#xC168;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC08;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;h1 id=&#34;Challenges-in-RDP-Fuzzing&#34;&gt;&lt;a href=&#34;#Challenges-in-RDP-Fuzzing&#34; class=&#34;headerlink&#34; title=&#34;Challenges in RDP Fuzzing&#34;&gt;&lt;/a&gt;Challenges in RDP Fuzzing&lt;/h1&gt;&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xD37C;&amp;#xC9D5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xD639;&amp;#xC740; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC;&amp;#xC73C;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xC778;&amp;#xD48B; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC774;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xB364;&amp;#xACA8;&amp;#xBC1B;&amp;#xC544; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0; &amp;#xD37C;&amp;#xC800;&amp;#xAC00; &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCE21;&amp;#xC815;&amp;#xD55C; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xACE0; &amp;#xBCC0;&amp;#xC870;&amp;#xB41C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xBC18;&amp;#xBCF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;RDP &amp;#xD37C;&amp;#xC9D5;&amp;#xC740; RDP &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xD56D;&amp;#xC0C1; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xC640;&amp;#xB294; &amp;#xC0AC;&amp;#xBB47; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD37C;&amp;#xC800;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xB123;&amp;#xB294; &amp;#xC778;&amp;#xD48B;&amp;#xC740; &amp;#xCEE4;&amp;#xB125;&amp;#xC158;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xCC44;&amp;#xB110;(&amp;#xD37C;&amp;#xC9D5; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC74C;)&amp;#xC758; &amp;#xCD5C;&amp;#xC0C1;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; Protocol Data Unit(PDU)&amp;#xB85C;&amp;#xC368; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xC548;&amp;#xAE09;&amp;#xD588;&amp;#xB358; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xCC44;&amp;#xB110;&amp;#xC740; &amp;#xAC01;&amp;#xC790; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC774;&amp;#xC720; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xCCBC;&amp;#xB9B0;&amp;#xC9C0;&amp;#xB4E4;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xC774;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;/&amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C;&amp;#xB3C4; &amp;#xD574;&amp;#xB2F9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC74C;)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Client-Server architecture : &amp;#xC804;&amp;#xD1B5;&amp;#xC801;&amp;#xC778; &amp;#xD37C;&amp;#xC9D5;&amp;#xC5D0;&amp;#xC11C; &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xC2EC;&amp;#xD50C;&amp;#xD558;&amp;#xAC8C; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xB123;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xB9CC; &amp;#xD55C;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;-&amp;#xC11C;&amp;#xBC84; &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD55C; &amp;#xCABD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; &amp;#xC778;&amp;#xD48B;&amp;#xC740; &amp;#xB2E4;&amp;#xB978; &amp;#xD55C;&amp;#xCABD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC804;&amp;#xB2EC;&amp;#xB41C;&amp;#xB2E4;. RDP&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;, &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC591;&amp;#xCABD;&amp;#xC740; &amp;#xB2E4;&amp;#xB978; &amp;#xBA38;&amp;#xC2E0;(&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84; &amp;#xC758;&amp;#xBBF8;)&amp;#xC774;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Statefulness : RDP&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC; &amp;#xAE30;&amp;#xBC18; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;(&amp;#xC5F0;&amp;#xACB0; &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; &amp;#xC9C0;&amp;#xC18D;&amp;#xB418;&amp;#xB294;? &amp;#xAC19;&amp;#xC740; &amp;#xC758;&amp;#xBBF8;&amp;#xC778;&amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;)&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB9D0;&amp;#xC740; &amp;#xD37C;&amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xC640;&amp;#xC911;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC5F0;&amp;#xACB0; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xACE0;&amp;#xB824;&amp;#xD574;&amp;#xC57C;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD37C;&amp;#xC815; &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC5D0; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&amp;#xD37C;&amp;#xC9D5; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC740; &amp;#xBCF4;&amp;#xD1B5; &amp;#xC77C;&amp;#xAD00;&amp;#xC131;, &amp;#xC989; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xB123;&amp;#xC73C;&amp;#xBA74; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Multi-input fuzzing : &amp;#xB9CC;&amp;#xC57D; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC778;&amp;#xD48B;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1B;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;(file-format fuzzing), &amp;#xD0C0;&amp;#xAC9F;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC778;&amp;#xD48B;&amp;#xC740; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD30C;&amp;#xC77C; &amp;#xC548;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB450; &amp;#xB2F4;&amp;#xACA8;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC18;&amp;#xB300;&amp;#xB85C;, &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xCF54;&amp;#xB4DC; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xBC1C;&amp;#xAD74;&amp;#xD574;&amp;#xB0B4;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC5F0;&amp;#xC18D;&amp;#xC801;&amp;#xC778; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC57C;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Finding the target code : coverage-guided fuzzing&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xD578;&amp;#xB4E4;&amp;#xB9C1;&amp;#xD558;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD568;&amp;#xC218; &amp;#xAC19;&amp;#xC774; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0; &amp;#xCE21;&amp;#xC815; &amp;#xC2DC;&amp;#xC791; &amp;#xC9C0;&amp;#xC810;&amp;#xC744; &amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC54C;&amp;#xB824;&amp;#xC918;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. RDP&amp;#xC5D0;&amp;#xB294; &amp;#xB3D9;&amp;#xC791;&amp;#xC5D0; &amp;#xAD00;&amp;#xC5EC;&amp;#xD558;&amp;#xB294; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB4E4;&amp;#xC774; &amp;#xB9E4;&amp;#xC6B0; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xC9C0;&amp;#xC810;&amp;#xC744; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xB294;&amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC5B4;&amp;#xB835;&amp;#xC6B8; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; 4 &amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2DC;&amp;#xC791;&amp;#xD560; &amp;#xB54C; &amp;#xC608;&amp;#xC0C1;&amp;#xD588;&amp;#xB358; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0;&amp;#xB4E4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C; &amp;#xC139;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC774; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0;&amp;#xB4E4;&amp;#xACFC; &amp;#xCD94;&amp;#xD6C4;&amp;#xC5D0; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xB610; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD574;&amp;#xACB0;&amp;#xD588;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB2E4;&amp;#xB8F0; &amp;#xC608;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Techincal-Details-The-Challenges-and-How-to-Overcome-Them&#34;&gt;&lt;a href=&#34;#Techincal-Details-The-Challenges-and-How-to-Overcome-Them&#34; class=&#34;headerlink&#34; title=&#34;Techincal Details : The Challenges and How to Overcome Them&#34;&gt;&lt;/a&gt;Techincal Details : The Challenges and How to Overcome Them&lt;/h1&gt;&lt;p&gt;&amp;#xC774; &amp;#xC139;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; &amp;#xAC1C;&amp;#xBC1C; &amp;#xC138;&amp;#xBD80; &amp;#xB0B4;&amp;#xC6A9;&amp;#xACFC; &amp;#xB9C8;&amp;#xC8FC;&amp;#xCE58;&amp;#xAC8C;&amp;#xB41C; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0;&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xD37C;&amp;#xC9D5; &amp;#xC14B;&amp;#xC5C5;&amp;#xC744; &amp;#xAC16;&amp;#xCD94;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB300;&amp;#xCC98;&amp;#xD588;&amp;#xB294; &amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB3C4; &amp;#xC598;&amp;#xAE30;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;. &amp;#xC774; &lt;a href=&#34;https://github.com/cyberark/rdpfuzz&#34;&gt;&amp;#xB808;&amp;#xD3EC;&lt;/a&gt;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC2DC;&amp;#xBA74; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD639;&amp;#xC2DC; &amp;#xC774; &amp;#xCABD;&amp;#xC5D0; &amp;#xAD00;&amp;#xC2EC;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74;, &amp;#xCC98;&amp;#xC74C; &amp;#xC2DC;&amp;#xC791;&amp;#xD560; &amp;#xB54C; &amp;#xB9CE;&amp;#xC740; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB420;&amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Client-Server-Architecture&#34;&gt;&lt;a href=&#34;#Client-Server-Architecture&#34; class=&#34;headerlink&#34; title=&#34;Client-Server Architecture&#34;&gt;&lt;/a&gt;Client-Server Architecture&lt;/h2&gt;&lt;p&gt;&amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; Windows&amp;#xC758; RDP &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xBAA8;&amp;#xB450;&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. RDP &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; &amp;#xBAA9;&amp;#xD45C;&amp;#xB294; &amp;#xBA85;&amp;#xD655;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC774;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; Windows &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xC6D0;&amp;#xACA9;&amp;#xC5D0;&amp;#xC11C; &amp;#xACF5;&amp;#xACA9;&amp;#xD574; &amp;#xC811;&amp;#xADFC; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;. RDP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD588;&amp;#xB358; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xC880; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC774;&amp;#xBBF8; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD588;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8;&amp;#xB4E4;&amp;#xC740; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xC900;&amp;#xBE44;&amp;#xD558;&amp;#xACE0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xAE30;&amp;#xB9CC;&amp;#xC744; &amp;#xAE30;&amp;#xB2E4;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;. &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xAC00; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xACF5;&amp;#xACA9;&amp;#xD574; &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xC758; &amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC7A5;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xAC00; &amp;#xADF8;&amp;#xB4E4;&amp;#xC774; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xBA74; &amp;#xC774;&amp;#xB7F0; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, Hyper-V&amp;#xAC00; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC811;&amp;#xC18D;&amp;#xD560; &amp;#xB54C; RDP&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; VM Escape&amp;#xC5D0;&amp;#xB3C4; &amp;#xD65C;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;RDP &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Instrumentation engine : &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xCE21;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Mutation engine : &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Input sender : &amp;#xC801;&amp;#xC808;&amp;#xD560; &amp;#xD0C0;&amp;#xAC9F; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Target binary : intrumentation engine&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xD2B8;&amp;#xB798;&amp;#xD0B9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB9C8; &amp;#xC0C1;&amp;#xC0C1;&amp;#xB418;&amp;#xC2DC;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xB300;&amp;#xC0C1;&amp;#xC758; &amp;#xD37C;&amp;#xC9D5; &amp;#xC14B;&amp;#xC5C5;&amp;#xC740; &amp;#xC880; &amp;#xB2E4;&amp;#xB974;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xC720;&amp;#xC0AC;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xBD80;&amp;#xD130; &amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/17/j0ker/rdp_fuzzing1/1.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xD37C;&amp;#xC9D5; &amp;#xC14B;&amp;#xC5C5;(&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84; &amp;#xBAA8;&amp;#xB450;)&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F; &amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xAD6C;&amp;#xC131;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Fuzzer : &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140; afl-fuzz.exe&lt;/li&gt;
&lt;li&gt;Instrumentation engine : in-app instrumentation &amp;#xBAA8;&amp;#xB4DC;&amp;#xC758; DynamoRIO&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140; winafl.dll&lt;ul&gt;
&lt;li&gt;&amp;#xCEE4;&amp;#xC2A4;&amp;#xD140; &amp;#xBE4C;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; WinAFL&amp;#xACFC; DynamoRIO&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xC139;&amp;#xC158;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD574; &amp;#xC8FC;&amp;#xC138;&amp;#xC694;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Inputs(&amp;#xD639;&amp;#xC740; test cases) : &amp;#xD0C0;&amp;#xAC9F;&amp;#xACFC; &amp;#xC778;&amp;#xD48B; &amp;#xC13C;&amp;#xB354; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; &amp;#xACF5;&amp;#xC720;&amp;#xB418;&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC548; &amp;#xC784;&amp;#xC2DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC4F0;&amp;#xC774;&amp;#xB294; &amp;#xBCC0;&amp;#xC870;&amp;#xB41C; PDU&amp;#xB4E4;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC778;&amp;#xD48B; &amp;#xC13C;&amp;#xB354;&amp;#xC5D0;&amp;#xB294; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB9CC; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Agent : &amp;#xC784;&amp;#xC2DC; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC744; &amp;#xC77D;&amp;#xACE0; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD328;&amp;#xB110;&amp;#xC5D0; &amp;#xC778;&amp;#xD48B;&amp;#xB4E4;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xC138;&amp;#xD305;&amp;#xC744; &amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xD37C;&amp;#xC9D5; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xAC00;&amp;#xC0C1;&amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#x201C;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#x201D;&amp;#xD55C; RDP &amp;#xC5F0;&amp;#xACB0; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC778;&amp;#xD48B; &amp;#xC0DD;&amp;#xC131; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xACFC; &amp;#xBD84;&amp;#xB9AC;&amp;#xC2DC;&amp;#xCF1C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC774; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; RDP &amp;#xD55C;&amp;#xCABD;&amp;#xC5D0;&amp;#xC11C;&amp;#xBD80;&amp;#xD130; &amp;#xB2E4;&amp;#xB978; &amp;#xD55C;&amp;#xCABD;&amp;#xC778; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC5D0;&amp;#xAC8C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC804;&amp;#xB2EC; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; WinAFL&amp;#xC758; in-app instrumentation mode&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Coverage-guided fuzzing&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC785;&amp;#xB825;&amp;#xACFC; &amp;#xC785;&amp;#xB825;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xC77C;&amp;#xB300;&amp;#xC77C; &amp;#xB300;&amp;#xC751;&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xC758; PDU&amp;#xB4E4;&amp;#xACFC; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; PDU&amp;#xB4E4;&amp;#xC744; &amp;#xAD6C;&amp;#xBD84;&amp;#xD558;&amp;#xACE0; &amp;#xD37C;&amp;#xC800;&amp;#xC758; PDU&amp;#xB4E4;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xACBD;&amp;#xB85C;&amp;#xB9CC; &amp;#xD2B8;&amp;#xB798;&amp;#xD0B9;&amp;#xD558;&amp;#xB294; &amp;#x201C;background fuzzing&amp;#x201D;&amp;#xC744; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC5F0;&amp;#xACB0; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xB79C;&amp;#xB364;&amp;#xD55C; PDU&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; PDU&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD2B8;&amp;#xB798;&amp;#xD0B9;&amp;#xD558;&amp;#xAE30;&amp;#xB97C; &amp;#xC6D0;&amp;#xD588;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB294; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD574;&amp;#xB97C; &amp;#xB3D5;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; RDP &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB85C; &amp;#xC624;&amp;#xB514;&amp;#xC624;&amp;#xB97C; &amp;#xB9AC;&amp;#xB2E4;&amp;#xC774;&amp;#xB809;&amp;#xD2B8;&amp;#xD558;&amp;#xB294; RDPSND &amp;#xAC00;&amp;#xC0C1; &amp;#xCC44;&amp;#xB110;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5;&amp;#xD560; &amp;#xB54C; &amp;#xC5B4;&amp;#xB5A4;&amp;#xC9C0; &amp;#xD55C;&amp;#xBC88; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpea/bea2d5cf-e3b9-4419-92e5-0e074ff9bc5b&#34;&gt;&amp;#xACF5;&amp;#xC2DD; &amp;#xBB38;&amp;#xC11C;&lt;/a&gt;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; PDU &amp;#xC74C;&amp;#xB2F5;&amp;#xC758; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB294; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC758; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/17/j0ker/rdp_fuzzing1/2.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;msgType&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xC740; 0x01 ~ 0x0D &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xCCAB; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xCD5C;&amp;#xC0C1;&amp;#xC704; &amp;#xBE44;&amp;#xD2B8;&amp;#xB97C; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5; &amp;#xB9C8;&amp;#xCEE4;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; PDU&amp;#xB97C; &amp;#xBCF4;&amp;#xB0BC; &amp;#xB54C; &amp;#xCCAB; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xCD5C;&amp;#xC0C1;&amp;#xC704; &amp;#xBE44;&amp;#xD2B8;&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;WinAFL&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xD578;&amp;#xB4E4;&amp;#xB9C1;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xCD5C;&amp;#xC0C1;&amp;#xC704; &amp;#xBE44;&amp;#xD2B8;&amp;#xB97C; &amp;#xCCB4;&amp;#xD06C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xD574;&amp;#xB2F9; &amp;#xBE44;&amp;#xD2B8;&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74;(&amp;#xAC12;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74;), WinAFL&amp;#xC740; &amp;#xD574;&amp;#xB2F9; &amp;#xBE44;&amp;#xD2B8;&amp;#xB97C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xCE21;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xD574;&amp;#xB2F9; &amp;#xBE44;&amp;#xD2B8;&amp;#xAC00; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xBB34;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xCE21;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84; &amp;#xC14B;&amp;#xC5C5;&amp;#xC758; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xC810;&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xB2E4;&amp;#xB978; &amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xBCF4;&amp;#xC8E0;. &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Client-Fuzzing-Setup&#34;&gt;&lt;a href=&#34;#Client-Fuzzing-Setup&#34; class=&#34;headerlink&#34; title=&#34;Client Fuzzing Setup&#34;&gt;&lt;/a&gt;Client Fuzzing Setup&lt;/h2&gt;&lt;p&gt;Windwos RDP client&amp;#xB294; mstsc.exe&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xAC00;&amp;#xC0C1; &amp;#xCC44;&amp;#xB110; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xB85C;&amp;#xC9C1;&amp;#xC740; mstscax.dll&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Hyper-V &amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xC6D0;&amp;#xACA9; &amp;#xC811;&amp;#xADFC; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC778; vmconnect.exe&amp;#xB3C4; &amp;#xB611;&amp;#xAC19;&amp;#xC774; mstscax.dll&amp;#xC5D0; &amp;#xCF54;&amp;#xC5B4; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/17/j0ker/rdp_fuzzing1/3.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Windows RDP Client&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB2E8;&amp;#xC21C;&amp;#xC131;&amp;#xACFC; &amp;#xD6A8;&amp;#xC728;&amp;#xC131;&amp;#xC744; &amp;#xC704; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84;(&amp;#xD0C0;&amp;#xAC9F;&amp;#xACFC; &amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;)&amp;#xB97C; &amp;#xAC19;&amp;#xC740; &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; localhost/127.0.0.1&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;) &amp;#xB610;&amp;#xD55C; &amp;#xBCD1;&amp;#xB839; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC787;&amp;#xAC8C; mimikatz&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC5EC;&amp;#xB7EC; RDP &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/17/j0ker/rdp_fuzzing1/4.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC14B;&amp;#xC5C5; &amp;#xAD6C;&amp;#xC131;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Target : mstsc.exe&amp;#xC640; &amp;#xD0C0;&amp;#xAC9F; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC778; mstscax.dll&lt;/li&gt;
&lt;li&gt;Instrumentation : &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; DynamoRIO&amp;#xC640; &amp;#xCF54;&amp;#xB4DC;&amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB294; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; DynamoRIO &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC778; winafl.dll&lt;/li&gt;
&lt;li&gt;Mutation engine : &amp;#xAC19;&amp;#xC740; &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC4F0;&amp;#xB294; AFL-Fuzzer&lt;/li&gt;
&lt;li&gt;Input sender : &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC624;&amp;#xD508;&amp;#xD558;&amp;#xACE0; &amp;#xC120;&amp;#xD0DD;&amp;#xB41C; &amp;#xAC00;&amp;#xC0C1; &amp;#xCC44;&amp;#xB110;&amp;#xB85C; PDU&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; RDPFuzzAgent. &amp;#xC774; &amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;&amp;#xB294; AFL-Fuzz&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC77D;&amp;#xC5B4;&amp;#xC624;&amp;#xB294; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC744; &amp;#xD0C0;&amp;#xCF13; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xAD6C;&amp;#xC131;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xCD08;&amp;#xB2F9; 50 ~ 100 &amp;#xBC88; &amp;#xC2E4;&amp;#xD589;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xBE60;&amp;#xB978; &amp;#xC18D;&amp;#xB3C4;&amp;#xB294; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC55E;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD55C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC18D;&amp;#xB3C4;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294; &amp;#xBE68;&amp;#xB790;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xB9CC;&amp;#xC871;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Server-Fuzzing-Setup&#34;&gt;&lt;a href=&#34;#Server-Fuzzing-Setup&#34; class=&#34;headerlink&#34; title=&#34;Server Fuzzing Setup&#34;&gt;&lt;/a&gt;Server Fuzzing Setup&lt;/h2&gt;&lt;p&gt;RDP &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xBA54;&amp;#xC778; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC7A0;&amp;#xAE50; &lt;code&gt;Remote Desktop Service&lt;/code&gt; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xD6D1;&amp;#xACE0; &amp;#xAC00;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs powershell&#34;&gt;&lt;span class=&#34;hljs-built_in&#34;&gt;PS&lt;/span&gt; C:\&amp;gt; &lt;span class=&#34;hljs-built_in&#34;&gt;gci&lt;/span&gt; HKLM:\SYSTEM\CurrentControlSet\Services\&lt;span class=&#34;hljs-variable&#34;&gt;$&lt;/span&gt;((&lt;span class=&#34;hljs-built_in&#34;&gt;Get-Service&lt;/span&gt; &lt;span class=&#34;hljs-literal&#34;&gt;-Name&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Remote Desktop Services&amp;quot;&lt;/span&gt;).Name)
    Hive: HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\TermService
Name                           Property
----                           --------
Parameters                     ServiceDll             : C:\Windows\System32\termsrv.dll
. . .&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;RDP &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xBA54;&amp;#xC778; &amp;#xB85C;&amp;#xC9C1;&amp;#xC740; termsrv.dll&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774; dll&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xCEE4;&amp;#xB9E8;&amp;#xB4DC; &amp;#xB77C;&amp;#xC778;&amp;#xC73C;&amp;#xB85C; svchost.exe&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs latex&#34;&gt;C:&lt;span class=&#34;hljs-tag&#34;&gt;\&lt;span class=&#34;hljs-name&#34;&gt;Windows&lt;/span&gt;&lt;/span&gt;&lt;span class=&#34;hljs-tag&#34;&gt;\&lt;span class=&#34;hljs-name&#34;&gt;System&lt;/span&gt;&lt;/span&gt;32&lt;span class=&#34;hljs-tag&#34;&gt;\&lt;span class=&#34;hljs-name&#34;&gt;svchost&lt;/span&gt;&lt;/span&gt;.exe -k NetworkService -s TermService&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84; &amp;#xD37C;&amp;#xC9D5; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC720;&amp;#xC0AC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;TermService&lt;/code&gt;&amp;#xC758; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC19;&amp;#xC740; &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xB97C; &amp;#xBCD1;&amp;#xB82C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC5C8;&amp;#xC8E0;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xC11C; &amp;#xAF64;&amp;#xB098; &amp;#xD070; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0;&amp;#xAC00; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC774;&amp;#xB97C; &amp;#xACE0;&amp;#xCE58;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB178;&amp;#xB825;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &lt;code&gt;termsrv.dll&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;TermService&lt;/code&gt;&amp;#xC640; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xB4E4;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xD558;&amp;#xB4DC;&amp;#xCF54;&amp;#xB529;&amp;#xB41C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xB4E4;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xC600;&amp;#xACE0;, &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xADF8;&amp;#xB0E5; &amp;#xC5EC;&amp;#xB7EC; VM&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xBCD1;&amp;#xB82C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xD37C;&amp;#xC9D5; &amp;#xC14B;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC11C;&amp;#xBC84; &amp;#xC0AC;&amp;#xC774;&amp;#xB4DC; API&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &lt;a href=&#34;https://docs.microsoft.com/en-us/windows/win32/api/wtsapi32/nf-wtsapi32-wtsvirtualchannelwrite&#34;&gt;&lt;code&gt;WTSVirtualChannelWrite()&lt;/code&gt;&lt;/a&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; &amp;#xD37C;&amp;#xC9D5; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC804;&amp;#xC1A1;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; RDP &amp;#xC5F0;&amp;#xACB0; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; API&amp;#xB294; &amp;#xCC3E;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xC600;&amp;#xC8E0;. &amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140;&amp;#xD55C; &lt;a href=&#34;https://www.freerdp.com/&#34;&gt;FreeRDP&lt;/a&gt;(&amp;#xC778;&amp;#xC2DC;&amp;#xC788;&amp;#xB294; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; RDP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC8E0;)&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xC6B0;&amp;#xBD84;&amp;#xD22C; &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC774;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xD37C;&amp;#xC9D5; &amp;#xC14B;&amp;#xC5C5;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xACE0; &amp;#xC774;&amp;#xB7F0; &amp;#xC81C;&amp;#xC57D;&amp;#xC870;&amp;#xAC74; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC11C;&amp;#xBC84; &amp;#xD37C;&amp;#xC9D5; &amp;#xC2A4;&amp;#xD53C;&amp;#xB4DC;&amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xD37C;&amp;#xC9D5; &amp;#xC2A4;&amp;#xD53C;&amp;#xB4DC;&amp;#xC758; 1/10 &amp;#xC815;&amp;#xB3C4;&amp;#xB418;&amp;#xB294; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xB0B3;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/17/j0ker/rdp_fuzzing1/5.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84; &amp;#xD37C;&amp;#xC9D5; &amp;#xC0C1;&amp;#xD669;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84; &amp;#xD37C;&amp;#xC9D5; &amp;#xC14B;&amp;#xC5C5;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/17/j0ker/rdp_fuzzing1/6.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Target : &amp;#xD37C;&amp;#xC9D5;&amp;#xD560; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. tarmsrv.dll, audiodg.exe, rdpinput.exe &amp;#xB4F1;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xB2E4;&amp;#xC74C; &amp;#xC139;&amp;#xC158;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#x201C;Locating the relevant code&amp;#x201D; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;. &amp;#xAC01; &amp;#xCC44;&amp;#xB110;&amp;#xC758; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/li&gt;
&lt;li&gt;Instrumentation : &amp;#xC774;&amp;#xB7F0; &amp;#xC14B;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xAC00; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xCE21;&amp;#xC815;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; instrument&amp;#xD560; &amp;#xC218; &amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; WinAFL&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xACE0; &amp;#xD655;&amp;#xC7A5;&amp;#xC131;&amp;#xACFC; &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC744; &amp;#xC704;&amp;#xD574; DynamoRIO&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;DynamoRIO : DynamoRIO&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBC16;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; attach&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC774; &lt;a href=&#34;https://github.com/DynamoRIO/dynamorio/pull/3328&#34;&gt;pull request&lt;/a&gt;&amp;#xB97C; &amp;#xC218;&amp;#xC815; &amp;#xBC0F; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD558;&amp;#xC600;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; WinAFL&amp;#xC5D0; &amp;#xBD99;&amp;#xC5EC; &amp;#xD65C;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Mutation engine : Windows &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xACF5;&amp;#xC720; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC4F0;&amp;#xB294; AFL-Fuzzer&lt;/li&gt;
&lt;li&gt;Input sender : Windows &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xB294; FreeRDP&amp;#xB85C; &amp;#xACF5;&amp;#xC720; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC744; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xACE0; &amp;#xD0C0;&amp;#xAC9F; RDP &amp;#xCC44;&amp;#xB110;&amp;#xC5D0; &amp;#xC804;&amp;#xC1A1;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/10/17/j0ker/rdp_fuzzing1/3.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/10/17/j0ker/rdp_fuzzing1/">

  <title>[Translation] Fuzzing RDP: Holding the Stick at Both Ends (1) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-10-17 14:00" pubdate>
      2021 10 17 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.6k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      91
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Translation] Fuzzing RDP: Holding the Stick at Both Ends (1)</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p>&#xC6D0;&#xBB38; &#xB9C1;&#xD06C; : <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-both-ends">https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-both-ends</a></p>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;. j0ker&#xC785;&#xB2C8;&#xB2E4;! &#xC624;&#xB298;&#xC740; &#xC624;&#xB79C;&#xB9CC;&#xC5D0; &#xBC88;&#xC5ED;&#xAE00;&#xC744; &#xAC00;&#xC838;&#xC640;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD3C9;&#xC18C;&#xC5D0; &#xD37C;&#xC9D5;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB3C4; &#xAD00;&#xC2EC;&#xC774; &#xB9CE;&#xC558;&#xACE0; &#xD30C;&#xC77C; &#xD37C;&#xC9D5;&#xB9CC; &#xD574;&#xBD24;&#xC9C0; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD37C;&#xC9D5;&#xC740; &#xC548;&#xD574;&#xBD24;&#xC5C8;&#xB294;&#xB370; &#xAD1C;&#xCC2E;&#xC740; &#xAE00;&#xC774; &#xC788;&#xC5B4;&#xC11C; &#xBC88;&#xC5ED;&#xD574;&#xBD05;&#xB2C8;&#xB2E4;. &#xC758;&#xC5ED;&#xC744; &#xB9CE;&#xC774; &#xD588;&#xB294;&#xB370; &#xC624;&#xD0C0;&#xB098; &#xBC88;&#xC5ED;&#xC774; &#xC5B4;&#xC0C9;&#xD55C; &#xBD80;&#xBD84;&#xC740; &#xB313;&#xAE00;&#xB85C; &#xC9C0;&#xC801;&#xD574;&#xC8FC;&#xC138;&#xC694;. &#xD639;&#xC2DC;&#xB098; &#xBC88;&#xC5ED;&#xD574;&#xC92C;&#xC73C;&#xBA74; &#xD558;&#xB294; &#xAE00;&#xC774; &#xC788;&#xB2E4;&#xBA74; &#xCD94;&#xCC9C; &#xBD80;&#xD0C1;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;! &#xCD5C;&#xB300;&#xD55C; &#xBE68;&#xB9AC; &#xD574;&#xBCFC;&#xAC8C;&#xC694;!</p>
<hr>
<h1 id="&#xC778;&#xC0AC;&#xB9D0;"><a href="#&#xC778;&#xC0AC;&#xB9D0;" class="headerlink" title="&#xC778;&#xC0AC;&#xB9D0;"></a>&#xC778;&#xC0AC;&#xB9D0;</h1><p>&#xC774; &#xD3EC;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; &#xC6B0;&#xB9AC;&#xAC00; Windows RDP &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84;&#xB4E4;&#xC744; &#xD37C;&#xC9D5;&#xD558;&#xBA74;&#xC11C; &#xACAA;&#xC740; &#xB0B4;&#xC6A9;&#xB4E4;&#xACFC; &#xADF8; &#xACB0;&#xACFC;&#xC5D0; &#xB300;&#xD574; &#xB2E4;&#xB8F0; &#xC608;&#xC815;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xBCF4;&#xC548; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB294; Microsoft&#xC758; Remote Desktop Protocol(RDP)&#xB97C; &#xC608;&#xC804;&#xBD80;&#xD130; &#xAD00;&#xC2EC;&#xC788;&#xAC8C; &#xC9C0;&#xCF1C;&#xBD10;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. 2019&#xB144;&#xC5D0;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.bankinfosecurity.com/top-ransomware-attack-vectors-rdp-drive-by-phishing-a-14353">&#xBA87; &#xBC31;&#xB9CC;&#xB300;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB294; &#xD06C;&#xB9AC;&#xD2F0;&#xCEEC;&#xD55C; &#xCDE8;&#xC57D;&#xC810;</a>&#xB4E4;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xACE0;, &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC740; &#xD32C;&#xB300;&#xBBF9; &#xC2DC;&#xAE30;&#xC5D0; &#xB9DE;&#xCDB0; &#xC7AC;&#xD0DD;&#xADFC;&#xBB34;&#xB97C; &#xD558;&#xB294; &#xD68C;&#xC0AC;&#xB4E4;&#xC5D0;&#xAC8C;&#xB294; &#xBA87; &#xBC30;&#xB85C; &#xB354; &#xD070; &#xC704;&#xD611;&#xC73C;&#xB85C; &#xB2E4;&#xAC00;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC0AC;&#xC2E4; &#xC800;&#xD76C;&#xAC00; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xCC98;&#xC74C; &#xC2DC;&#xC791;&#xD560; &#xB54C;&#xC5D0;&#xB294; VM&#xC5D0; &#xAD00;&#xB828;&#xB41C; &#xB0B4;&#xC6A9;&#xC5D0; &#xAD00;&#xC2EC;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; Azure&#xC758; Windows &#xBA38;&#xC2E0; &#xD639;&#xC740; Hyper-V &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC5D0; &#xC811;&#xC18D;&#xD560; &#xB54C; RDP&#xB97C; &#xC8FC;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, RDP&#xC5D0; &#xB208;&#xC744; &#xB3CC;&#xB9AC;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xD76C;&#xB294; &#xB2E4;&#xB978; &#xC131;&#xACF5;&#xC801;&#xC778; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB4E4;&#xACFC; &#xB611;&#xAC19;&#xC774; &#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xAD6C;&#xAE00;&#xB9C1;&#xC744; &#xD558;&#xB2E4;&#xAC00; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.youtube.com/watch?v=dGLrK8tUAFs">&#xBC15;&#xCC9C;&#xC131;&#xB2D8;, &#xC7A5;&#xC601;&#xC9C4;&#xB2D8;, &#xAE40;&#xC2B9;&#xC8FC;&#xB2D8;, &#xC774;&#xAE30;&#xD0DD;&#xB2D8;&#xC758; RDP fuzzing&#xC5D0; &#xAD00;&#xB828;&#xB41C; BlackHat Europe 2019 &#xBC1C;&#xD45C;</a>&#xB97C; &#xC811;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC1C;&#xD45C;&#xC790;&#xB4E4;&#xC740; &#xADF8;&#xB807;&#xAC8C; &#xBE60;&#xB974;&#xC9C0; &#xC54A;&#xC740; &#xD37C;&#xC800;&#xB97C; &#xD65C;&#xC6A9;&#xD588;&#xC74C;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0; &#xBA87; &#xC2DC;&#xAC04;&#xB9CC;&#xC5D0; &#xC5EC;&#xB7EC; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC744; &#xCC3E;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; &#xADF8;&#xB4E4;&#xC758; &#xC5F0;&#xAD6C;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD37C;&#xC9D5; &#xAE30;&#xB2A5;&#xC744; &#xD655;&#xC7A5;&#xD558;&#xACE0; &#xD37C;&#xD3EC;&#xBA3C;&#xC2A4;&#xB97C; &#xAC1C;&#xC120;&#xD558;&#xC5EC; RDP&#xC5D0;&#xC11C; Remote Code Execution(RCE) &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xAE30;&#xB85C; &#xACB0;&#xC815;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xBD88;&#xD589;&#xD788;&#xB3C4;(&#xD639;&#xC740; &#xC6B4;&#xC774; &#xC88B;&#xAC8C;&#xB3C4;, &#xBCF4;&#xB294; &#xC2DC;&#xAC01;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xB97C; &#xC218; &#xC788;&#xC74C;), &#xBAA8;&#xB4E0; &#xD37C;&#xC9D5; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xACB0;&#xACFC;&#xBB3C;&#xB4E4;&#xC774; &#xD06C;&#xB9AC;&#xD2F0;&#xCEEC;&#xD55C; &#xAC83;&#xC740; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;(<a target="_blank" rel="external nofollow noopener noreferrer" href="https://en.wikipedia.org/wiki/Survivorship_bias">Survivorship Bias</a> &#xCC38;&#xACE0;). &#xC544;&#xC9C1; RDP RCE&#xB97C; &#xCC3E;&#xC9C0; &#xBABB;&#xD588;&#xC9C0;&#xB9CC; &#xC5EC;&#xB7EC; &#xBC84;&#xADF8;&#xB4E4;&#xC744; &#xCC3E;&#xC558;&#xACE0; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xACFC; &#xAD6C;&#xC131; &#xADF8;&#xB9AC;&#xACE0; &#xD37C;&#xC9D5; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBC0F; &#xD234;&#xC744; &#xC774;&#xD574;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xAC00; &#xB9CC;&#xB4E0; &#xD37C;&#xC9D5; &#xC778;&#xD504;&#xB77C;&#xB294; &#xB2E4;&#xB978; &#xD0C0;&#xAC9F;&#xB4E4;&#xC744; &#xD37C;&#xC9D5;&#xD560; &#xC218; &#xC788;&#xC744; &#xC815;&#xB3C4;&#xB85D; &#xC81C;&#xB124;&#xB7F4;&#xD558;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xD3EC;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; &#xC55E;&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xD55C; &#xBAA8;&#xB4E0; &#xB0B4;&#xC6A9;&#xB4E4;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xB300;&#xD574; &#xACF5;&#xC720;&#xD558;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xBA3C;&#xC800; RDP&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xAC04;&#xB2E8;&#xD788; &#xC54C;&#xC544;&#xBCF4;&#xACE0; &#xD37C;&#xC9D5;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xD588;&#xB294;&#xC9C0;, &#xC5B4;&#xB5A4; &#xBB38;&#xC81C;&#xC810;&#xB4E4;&#xC744; &#xD574;&#xCCD0;&#xB098;&#xAC14;&#xB294;&#xC9C0; &#xADF8;&#xB9AC;&#xACE0; &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xC774;&#xB7EC;&#xD55C; &#xACFC;&#xC815;&#xB4E4;&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xD558;&#xAC8C;&#xB41C; &#xBC84;&#xADF8;&#xB4E4;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC598;&#xAE30;&#xD574; &#xBCF4;&#xACE0;&#xC790; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="RDP-Overview"><a href="#RDP-Overview" class="headerlink" title="RDP Overview"></a>RDP Overview</h1><p>Remote Desktop Protocol&#xC740; Windows &#xBA38;&#xC2E0;&#xC5D0; &#xC811;&#xC18D;&#xD560; &#xB54C; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xCD5C;&#xADFC; Malwaretech&#xB294; RDP&#xB97C; &#xB450;&#xACE0; &#x201C;&#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xB4E4;&#xC744; &#xC704;&#xD55C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#x201D;&#xC774;&#xB77C;&#xACE0; &#xD45C;&#xD604;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. RDP&#xB294; &#xBAA8;&#xB4E0; &#xCEE4;&#xB125;&#xC158;&#xC744; &#xC870;&#xC791;&#xD558;&#xC5EC; &#xC5EC;&#xB7EC; &#xCC44;&#xB110; &#xB3D9;&#xC2DC;&#xC811;&#xC18D;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xACE0; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xB3D9;&#xC791;&#xC744; &#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xB9D0;&#xC740; &#xC989;&#xC2A8;, &#xAC01;&#xAC01;&#xC758; &#xCC44;&#xB110;&#xB4E4;&#xC740; &#xAC01;&#xC790; &#xB370;&#xC774;&#xD130;, &#xC784;&#xC758; &#xC815;&#xC758; &#xAD6C;&#xC870;&#xCCB4; &#xADF8;&#xB9AC;&#xACE0; &#xB370;&#xC774;&#xD130; &#xD50C;&#xB85C;&#xC6B0;&#xB97C; &#xC54C;&#xC544;&#xC11C; &#xD578;&#xB4E4;&#xB9C1;&#xD55C;&#xB2E4;&#xB294; &#xC758;&#xBBF8;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xADFC;&#xBCF8;&#xC801;&#xC73C;&#xB85C; RDP&#xAC00; &#xC5EC;&#xB7EC; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xC9C0;&#xC6D0;&#xD55C;&#xB2E4;&#xB294; &#xC758;&#xBBF8;&#xAC00; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/10/17/j0ker/rdp_fuzzing1/Untitled.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p>RDP &#xC5F0;&#xACB0; &#xC2DC;&#xC758; &#xCC44;&#xB110;&#xB4E4;</p>
</blockquote>
<p>RDP &#xD328;&#xB110;&#xC740; &#xC815;&#xC801;&#xC77C; &#xC218; &#xC788;&#xACE0; &#xB3D9;&#xC801;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xB458;&#xC758; &#xCC28;&#xC774;&#xC810;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xAE00;&#xC758; &#xC694;&#xC9C0;&#xC5D0;&#xC11C; &#xBC97;&#xC5B4;&#xB098;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC598;&#xAE30;&#xD558;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; RDP&#xC758; &#xB0B4;&#xBD80; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC5D0; &#xB300;&#xD574; &#xC880; &#xB354; &#xC54C;&#xACE0; &#xC2F6;&#xC73C;&#xC2DC;&#xB2E4;&#xBA74;, <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.cyberark.com/resources/threat-research-blog/explain-like-i-m-5-remote-desktop-protocol-rdp">&#xC774; &#xAE00;</a>&#xC744; &#xC77D;&#xC73C;&#xC2DC;&#xB294;&#xAC78; &#xCD94;&#xCC9C;&#xB4DC;&#xB824;&#xC694;. &#xBC18;&#xBA74;&#xC5D0; &#xD37C;&#xC9D5; &#xACFC;&#xC815;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC880; &#xB354; &#xC54C;&#xACE0; &#xC2F6;&#xC73C;&#xC168;&#xB2E4;&#xBA74; &#xC81C;&#xB300;&#xB85C; &#xCC3E;&#xC544;&#xC624;&#xC168;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB4E4;&#xC5B4;&#xAC08;&#xAC8C;&#xC694;.</p>
<h1 id="Challenges-in-RDP-Fuzzing"><a href="#Challenges-in-RDP-Fuzzing" class="headerlink" title="Challenges in RDP Fuzzing"></a>Challenges in RDP Fuzzing</h1><p>&#xC77C;&#xBC18;&#xC801;&#xC778; &#xD37C;&#xC9D5;&#xC5D0;&#xC11C;&#xB294; &#xD30C;&#xC77C; &#xD639;&#xC740; &#xC2A4;&#xD2B8;&#xB9BC;&#xC73C;&#xB85C; &#xB418;&#xC5B4; &#xC788;&#xB294; &#xC778;&#xD48B; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD37C;&#xC800;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xC77D;&#xC5B4;&#xB4E4;&#xC774;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB364;&#xACA8;&#xBC1B;&#xC544; &#xCC98;&#xB9AC;&#xD558;&#xACE0; &#xD37C;&#xC800;&#xAC00; &#xC774; &#xACFC;&#xC815;&#xC758; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB97C; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1; &#xD569;&#xB2C8;&#xB2E4;. &#xCE21;&#xC815;&#xD55C; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB97C; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; &#xD37C;&#xC800;&#xB294; &#xB2E4;&#xC2DC; &#xC778;&#xD48B;&#xC744; &#xBCC0;&#xC870;&#xD558;&#xACE0; &#xBCC0;&#xC870;&#xB41C; &#xC778;&#xD48B;&#xC744; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xBC18;&#xBCF5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>RDP &#xD37C;&#xC9D5;&#xC740; RDP &#xC5F0;&#xACB0;&#xC774; &#xD56D;&#xC0C1; &#xC874;&#xC7AC;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xC640;&#xB294; &#xC0AC;&#xBB47; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;. &#xD37C;&#xC800;&#xAC00; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xB123;&#xB294; &#xC778;&#xD48B;&#xC740; &#xCEE4;&#xB125;&#xC158;&#xC758; &#xD2B9;&#xC815; &#xCC44;&#xB110;(&#xD37C;&#xC9D5; &#xACFC;&#xC815;&#xC5D0;&#xC11C;&#xB3C4; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xC74C;)&#xC758; &#xCD5C;&#xC0C1;&#xC704;&#xC5D0;&#xC11C; Protocol Data Unit(PDU)&#xB85C;&#xC368; &#xBCF4;&#xB0B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC55E;&#xC5D0;&#xC11C; &#xC548;&#xAE09;&#xD588;&#xB358; &#xAC83;&#xCC98;&#xB7FC;, &#xBAA8;&#xB4E0; &#xCC44;&#xB110;&#xC740; &#xAC01;&#xC790; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBAA8;&#xB4E0; &#xCC44;&#xB110;&#xC5D0; &#xD37C;&#xC9D5;&#xC744; &#xC9C4;&#xD589;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xC774;&#xC720; &#xB54C;&#xBB38;&#xC5D0; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xCCBC;&#xB9B0;&#xC9C0;&#xB4E4;&#xC774; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.(&#xC774;&#xB294; &#xB2E4;&#xB978; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;/&#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xD37C;&#xC800;&#xB4E4;&#xC5D0;&#xAC8C;&#xB3C4; &#xD574;&#xB2F9;&#xB420; &#xC218; &#xC788;&#xC74C;)</p>
<ul>
<li>Client-Server architecture : &#xC804;&#xD1B5;&#xC801;&#xC778; &#xD37C;&#xC9D5;&#xC5D0;&#xC11C; &#xD37C;&#xC800;&#xB294; &#xC2EC;&#xD50C;&#xD558;&#xAC8C; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xC778;&#xD48B;&#xC744; &#xB123;&#xB294; &#xC5ED;&#xD560;&#xB9CC; &#xD55C;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;-&#xC11C;&#xBC84; &#xAD6C;&#xC870;&#xC5D0;&#xC11C;&#xB294; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xD55C; &#xCABD;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xACE0; &#xC788;&#xACE0; &#xC778;&#xD48B;&#xC740; &#xB2E4;&#xB978; &#xD55C;&#xCABD;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xB418;&#xC5B4; &#xC804;&#xB2EC;&#xB41C;&#xB2E4;. RDP&#xC758; &#xACBD;&#xC6B0;, &#xB300;&#xBD80;&#xBD84; &#xC591;&#xCABD;&#xC740; &#xB2E4;&#xB978; &#xBA38;&#xC2E0;(&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84; &#xC758;&#xBBF8;)&#xC774;&#xB2E4;.</li>
<li>Statefulness : RDP&#xB294; &#xC0C1;&#xD0DC; &#xAE30;&#xBC18; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;(&#xC5F0;&#xACB0; &#xC0C1;&#xD0DC;&#xAC00; &#xC9C0;&#xC18D;&#xB418;&#xB294;? &#xAC19;&#xC740; &#xC758;&#xBBF8;&#xC778;&#xAC70; &#xAC19;&#xB124;&#xC694;)&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xB9D0;&#xC740; &#xD37C;&#xD37C;&#xC9D5;&#xC744; &#xD558;&#xB294; &#xC640;&#xC911;&#xC5D0;&#xB3C4; &#xC5F0;&#xACB0; &#xC0C1;&#xD0DC;&#xB97C; &#xACE0;&#xB824;&#xD574;&#xC57C;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD37C;&#xC815; &#xC548;&#xC815;&#xC131;&#xC5D0; &#xC2EC;&#xAC01;&#xD55C; &#xC601;&#xD5A5;&#xC744; &#xC904; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<ul>
<li>&#xD37C;&#xC9D5; &#xACFC;&#xC815;&#xC5D0;&#xC11C;&#xC758; &#xC548;&#xC815;&#xC131;&#xC740; &#xBCF4;&#xD1B5; &#xC77C;&#xAD00;&#xC131;, &#xC989; &#xB3D9;&#xC77C;&#xD55C; &#xC778;&#xD48B;&#xC744; &#xB123;&#xC73C;&#xBA74; &#xB3D9;&#xC77C;&#xD55C; &#xCF54;&#xB4DC; &#xACBD;&#xB85C;&#xB97C; &#xC0DD;&#xC131;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>Multi-input fuzzing : &#xB9CC;&#xC57D; &#xD30C;&#xC77C;&#xC744; &#xC778;&#xD48B;&#xC73C;&#xB85C; &#xBC1B;&#xB294; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xD37C;&#xC9D5;&#xD560; &#xACBD;&#xC6B0;(file-format fuzzing), &#xD0C0;&#xAC9F;&#xC5D0; &#xC804;&#xB2EC;&#xB418;&#xB294; &#xD37C;&#xC800;&#xC758; &#xC778;&#xD48B;&#xC740; &#xD558;&#xB098;&#xC758; &#xD30C;&#xC77C; &#xC548;&#xC5D0; &#xBAA8;&#xB450; &#xB2F4;&#xACA8;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC18;&#xB300;&#xB85C;, &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xD37C;&#xC9D5;&#xD560; &#xB54C;&#xC5D0;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xCF54;&#xB4DC; &#xACBD;&#xB85C;&#xB97C; &#xBC1C;&#xAD74;&#xD574;&#xB0B4;&#xAE30; &#xC704;&#xD574; &#xC5EC;&#xB7EC; &#xC5F0;&#xC18D;&#xC801;&#xC778; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xBCF4;&#xB0B4;&#xC57C;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>Finding the target code : coverage-guided fuzzing&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xB54C;&#xB294; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC778;&#xD48B;&#xC744; &#xD578;&#xB4E4;&#xB9C1;&#xD558;&#xB294; &#xD0C0;&#xAC9F; &#xD568;&#xC218; &#xAC19;&#xC774; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0; &#xCE21;&#xC815; &#xC2DC;&#xC791; &#xC9C0;&#xC810;&#xC744; &#xD37C;&#xC800;&#xC5D0;&#xAC8C; &#xC54C;&#xB824;&#xC918;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. RDP&#xC5D0;&#xB294; &#xB3D9;&#xC791;&#xC5D0; &#xAD00;&#xC5EC;&#xD558;&#xB294; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB4E4;&#xC774; &#xB9E4;&#xC6B0; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC815;&#xD655;&#xD55C; &#xC9C0;&#xC810;&#xC744; &#xC9C0;&#xC815;&#xD558;&#xB294;&#xAC8C; &#xC0DD;&#xAC01;&#xBCF4;&#xB2E4; &#xC5B4;&#xB835;&#xC6B8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xC774;&#xB807;&#xAC8C; 4 &#xAC00;&#xC9C0;&#xAC00; &#xC800;&#xD76C;&#xAC00; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC2DC;&#xC791;&#xD560; &#xB54C; &#xC608;&#xC0C1;&#xD588;&#xB358; &#xCC4C;&#xB9B0;&#xC9C0;&#xB4E4;&#xC785;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C; &#xC139;&#xC158;&#xC5D0;&#xC11C;&#xB294; &#xC6B0;&#xB9AC;&#xAC00; &#xC774; &#xCC4C;&#xB9B0;&#xC9C0;&#xB4E4;&#xACFC; &#xCD94;&#xD6C4;&#xC5D0; &#xBC1C;&#xC0DD;&#xD55C; &#xB610; &#xD558;&#xB098;&#xC758; &#xCC4C;&#xB9B0;&#xC9C0;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xD574;&#xACB0;&#xD588;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD574; &#xB2E4;&#xB8F0; &#xC608;&#xC815;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h1 id="Techincal-Details-The-Challenges-and-How-to-Overcome-Them"><a href="#Techincal-Details-The-Challenges-and-How-to-Overcome-Them" class="headerlink" title="Techincal Details : The Challenges and How to Overcome Them"></a>Techincal Details : The Challenges and How to Overcome Them</h1><p>&#xC774; &#xC139;&#xC158;&#xC5D0;&#xC11C;&#xB294; &#xC6B0;&#xB9AC;&#xC758; &#xAC1C;&#xBC1C; &#xC138;&#xBD80; &#xB0B4;&#xC6A9;&#xACFC; &#xB9C8;&#xC8FC;&#xCE58;&#xAC8C;&#xB41C; &#xCC4C;&#xB9B0;&#xC9C0;&#xB4E4;&#xC5D0; &#xB300;&#xD574; &#xB2E4;&#xB8E8;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xC6B0;&#xB9AC;&#xAC00; &#xD37C;&#xC9D5; &#xC14B;&#xC5C5;&#xC744; &#xAC16;&#xCD94;&#xAE30; &#xC704;&#xD574; &#xC5B4;&#xB5BB;&#xAC8C; &#xB300;&#xCC98;&#xD588;&#xB294; &#xC9C0;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB3C4; &#xC598;&#xAE30;&#xD574;&#xBCFC;&#xAC8C;&#xC694;. &#xC774; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/cyberark/rdpfuzz">&#xB808;&#xD3EC;</a>&#xC5D0; &#xB4E4;&#xC5B4;&#xAC00;&#xC2DC;&#xBA74; &#xC6B0;&#xB9AC;&#xAC00; &#xC774; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xBA74;&#xC11C; &#xC791;&#xC131;&#xD55C; &#xCF54;&#xB4DC;&#xB4E4;&#xC774; &#xBAA8;&#xB450; &#xB4E4;&#xC5B4;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD639;&#xC2DC; &#xC774; &#xCABD;&#xC5D0; &#xAD00;&#xC2EC;&#xC774; &#xC788;&#xB2E4;&#xBA74;, &#xCC98;&#xC74C; &#xC2DC;&#xC791;&#xD560; &#xB54C; &#xB9CE;&#xC740; &#xB3C4;&#xC6C0;&#xC774; &#xB420;&#xAC81;&#xB2C8;&#xB2E4;.</p>
<h2 id="Client-Server-Architecture"><a href="#Client-Server-Architecture" class="headerlink" title="Client-Server Architecture"></a>Client-Server Architecture</h2><p>&#xC774; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; Windows&#xC758; RDP &#xC11C;&#xBC84;&#xC640; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xBAA8;&#xB450;&#xB97C; &#xD37C;&#xC9D5;&#xD558;&#xACE0; &#xC2F6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. RDP &#xC11C;&#xBC84;&#xB97C; &#xD37C;&#xC9D5;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xBAA9;&#xD45C;&#xB294; &#xBA85;&#xD655;&#xD569;&#xB2C8;&#xB2E4;. &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC774;&#xB97C; &#xC774;&#xC6A9;&#xD574; Windows &#xC11C;&#xBC84;&#xB97C; &#xC6D0;&#xACA9;&#xC5D0;&#xC11C; &#xACF5;&#xACA9;&#xD574; &#xC811;&#xADFC; &#xAD8C;&#xD55C;&#xC744; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xC8E0;. RDP &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xD37C;&#xC9D5;&#xD558;&#xACE0;&#xC790; &#xD588;&#xB358; &#xC774;&#xC720;&#xB294; &#xC880; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC774;&#xBBF8; &#xC11C;&#xBC84;&#xB97C; &#xD0C8;&#xCDE8;&#xD588;&#xB2E4;&#xBA74; &#xADF8;&#xB4E4;&#xC740; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xC900;&#xBE44;&#xD558;&#xACE0; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC811;&#xC18D;&#xD558;&#xAE30;&#xB9CC;&#xC744; &#xAE30;&#xB2E4;&#xB9B4; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xC8E0;. &#xD53C;&#xD574;&#xC790;&#xAC00; &#xC811;&#xC18D;&#xD558;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xACF5;&#xACA9;&#xD574; &#xD53C;&#xD574;&#xC790;&#xC758; &#xBA38;&#xC2E0;&#xC744; &#xC7A5;&#xC545;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xAD00;&#xB9AC;&#xC790;&#xAC00; &#xADF8;&#xB4E4;&#xC774; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xC11C;&#xBC84;&#xC5D0; &#xC811;&#xC18D;&#xD558;&#xBA74; &#xC774;&#xB7F0; &#xC0C1;&#xD669;&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xACE0;, Hyper-V&#xAC00; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC744; &#xC811;&#xC18D;&#xD560; &#xB54C; RDP&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; VM Escape&#xC5D0;&#xB3C4; &#xD65C;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>RDP &#xD37C;&#xC800;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB85C; &#xAD6C;&#xC131;&#xB429;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Instrumentation engine : &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB97C; &#xCE21;&#xC815;&#xD558;&#xACE0; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xD0D0;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>Mutation engine : &#xC0C8;&#xB85C;&#xC6B4; &#xC778;&#xD48B;&#xC744; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>Input sender : &#xC801;&#xC808;&#xD560; &#xD0C0;&#xAC9F; &#xCC44;&#xB110;&#xC5D0;&#xAC8C; &#xD37C;&#xC800;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xB41C; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB97C; &#xC804;&#xC1A1;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>Target binary : intrumentation engine&#xC5D0; &#xC758;&#xD574; &#xD2B8;&#xB798;&#xD0B9;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xC544;&#xB9C8; &#xC0C1;&#xC0C1;&#xB418;&#xC2DC;&#xACA0;&#xC9C0;&#xB9CC;, &#xC11C;&#xBC84;&#xC640; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xB300;&#xC0C1;&#xC758; &#xD37C;&#xC9D5; &#xC14B;&#xC5C5;&#xC740; &#xC880; &#xB2E4;&#xB974;&#xC9C0;&#xB9CC; &#xBA87; &#xAC00;&#xC9C0; &#xC720;&#xC0AC;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xBD80;&#xBD84;&#xBD80;&#xD130; &#xBCF4;&#xC2DC;&#xC8E0;.</p>
<p><img src="/2021/10/17/j0ker/rdp_fuzzing1/1.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p>&#xAE30;&#xBCF8;&#xC801;&#xC778; &#xD37C;&#xC9D5; &#xC14B;&#xC5C5;(&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84; &#xBAA8;&#xB450;)</p>
</blockquote>
<p>&#xD0C0;&#xAC9F; &#xBD80;&#xBD84;&#xC758; &#xAD6C;&#xC131;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Fuzzer : &#xCEE4;&#xC2A4;&#xD140; afl-fuzz.exe</li>
<li>Instrumentation engine : in-app instrumentation &#xBAA8;&#xB4DC;&#xC758; DynamoRIO&#xB97C; &#xC0AC;&#xC6A9;&#xD55C; &#xCEE4;&#xC2A4;&#xD140; winafl.dll<ul>
<li>&#xCEE4;&#xC2A4;&#xD140; &#xBE4C;&#xB4DC;&#xC5D0;&#xC11C; WinAFL&#xACFC; DynamoRIO&#xC5D0; &#xCD94;&#xAC00;&#xB41C; &#xAE30;&#xB2A5;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xB2E4;&#xC74C; &#xC139;&#xC158;&#xC744; &#xCC38;&#xACE0;&#xD574; &#xC8FC;&#xC138;&#xC694;.</li>
</ul>
</li>
<li>Inputs(&#xD639;&#xC740; test cases) : &#xD0C0;&#xAC9F;&#xACFC; &#xC778;&#xD48B; &#xC13C;&#xB354; &#xC0AC;&#xC774;&#xC5D0; &#xACF5;&#xC720;&#xB418;&#xB294; &#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xC548; &#xC784;&#xC2DC; &#xD30C;&#xC77C;&#xC5D0; &#xC4F0;&#xC774;&#xB294; &#xBCC0;&#xC870;&#xB41C; PDU&#xB4E4;</li>
</ul>
<p>&#xC778;&#xD48B; &#xC13C;&#xB354;&#xC5D0;&#xB294; &#xD558;&#xB098;&#xC758; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB9CC; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Agent : &#xC784;&#xC2DC; &#xD30C;&#xC77C;&#xB4E4;&#xC744; &#xC77D;&#xACE0; &#xD0C0;&#xAC9F; &#xD328;&#xB110;&#xC5D0; &#xC778;&#xD48B;&#xB4E4;&#xC744; &#xC804;&#xB2EC;</li>
</ul>
<p>&#xC774;&#xB7F0; &#xC138;&#xD305;&#xC744; &#xD55C; &#xC774;&#xC720;&#xB294; &#xAC04;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xB294; &#xD37C;&#xC9D5; &#xC778;&#xD48B;&#xC744; &#xAC00;&#xC0C1;&#xD658;&#xACBD;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2CC; &#x201C;&#xB77C;&#xC774;&#xBE0C;&#x201D;&#xD55C; RDP &#xC5F0;&#xACB0; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xC9C4;&#xD589;&#xD558;&#xACE0; &#xC2F6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; &#xC778;&#xD48B; &#xC0DD;&#xC131; &#xBD80;&#xBD84;&#xC744; &#xD0C0;&#xAC9F;&#xC5D0; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xACFC; &#xBD84;&#xB9AC;&#xC2DC;&#xCF1C; &#xD0C0;&#xAC9F;&#xC774; &#xC778;&#xD48B;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xAE30; &#xC804;&#xC5D0; RDP &#xD55C;&#xCABD;&#xC5D0;&#xC11C;&#xBD80;&#xD130; &#xB2E4;&#xB978; &#xD55C;&#xCABD;&#xC778; &#xD0C0;&#xAC9F;&#xC5D0;&#xAC8C;&#xAE4C;&#xC9C0; &#xC804;&#xB2EC; &#xB420; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD94;&#xAC00;&#xC801;&#xC73C;&#xB85C; &#xC6B0;&#xB9AC;&#xB294; WinAFL&#xC758; in-app instrumentation mode&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xC8FC;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Coverage-guided fuzzing&#xC774; &#xB3D9;&#xC791;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xC785;&#xB825;&#xACFC; &#xC785;&#xB825;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xD2B8;&#xB9AC;&#xAC70;&#xB41C; &#xCF54;&#xB4DC; &#xACBD;&#xB85C;&#xAC00; &#xC77C;&#xB300;&#xC77C; &#xB300;&#xC751;&#xC774; &#xB418;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; &#xD37C;&#xC800;&#xC758; PDU&#xB4E4;&#xACFC; &#xC77C;&#xBC18;&#xC801;&#xC778; PDU&#xB4E4;&#xC744; &#xAD6C;&#xBD84;&#xD558;&#xACE0; &#xD37C;&#xC800;&#xC758; PDU&#xB4E4;&#xC758; &#xCF54;&#xB4DC; &#xACBD;&#xB85C;&#xB9CC; &#xD2B8;&#xB798;&#xD0B9;&#xD558;&#xB294; &#x201C;background fuzzing&#x201D;&#xC744; &#xAC1C;&#xBC1C;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xB294; &#xC5F0;&#xACB0; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C;&#xC758; &#xB79C;&#xB364;&#xD55C; PDU&#xAC00; &#xC544;&#xB2C8;&#xB77C; &#xD37C;&#xC800;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xD55C; PDU&#xB4E4;&#xC5D0; &#xB300;&#xD55C; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB9CC; &#xD2B8;&#xB798;&#xD0B9;&#xD558;&#xAE30;&#xB97C; &#xC6D0;&#xD588;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB294; &#xC911;&#xC694;&#xD55C; &#xC791;&#xC5C5;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xD574;&#xB97C; &#xB3D5;&#xAE30; &#xC704;&#xD574;&#xC11C; RDP &#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB85C; &#xC624;&#xB514;&#xC624;&#xB97C; &#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xD2B8;&#xD558;&#xB294; RDPSND &#xAC00;&#xC0C1; &#xCC44;&#xB110;&#xC744; &#xD37C;&#xC9D5;&#xD560; &#xB54C; &#xC5B4;&#xB5A4;&#xC9C0; &#xD55C;&#xBC88; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpea/bea2d5cf-e3b9-4419-92e5-0e074ff9bc5b">&#xACF5;&#xC2DD; &#xBB38;&#xC11C;</a>&#xC5D0; &#xB530;&#xB974;&#xBA74; PDU &#xC74C;&#xB2F5;&#xC758; &#xCCAB; &#xBC88;&#xC9F8; &#xBC14;&#xC774;&#xD2B8;&#xB294; &#xBA54;&#xC2DC;&#xC9C0;&#xC758; &#xD0C0;&#xC785;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/10/17/j0ker/rdp_fuzzing1/2.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p><code>msgType</code> &#xD544;&#xB4DC;&#xC5D0;&#xC11C; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xAC12;&#xC740; 0x01 ~ 0x0D &#xC785;&#xB2C8;&#xB2E4;.&#xC5EC;&#xAE30;&#xC5D0;&#xC11C;&#xB294; &#xCCAB; &#xBC14;&#xC774;&#xD2B8;&#xC758; &#xCD5C;&#xC0C1;&#xC704; &#xBE44;&#xD2B8;&#xB97C; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD37C;&#xC9D5; &#xB9C8;&#xCEE4;&#xB85C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  </p>
<ul>
<li>&#xC5D0;&#xC774;&#xC804;&#xD2B8;&#xC5D0;&#xC11C; PDU&#xB97C; &#xBCF4;&#xB0BC; &#xB54C; &#xCCAB; &#xBC14;&#xC774;&#xD2B8;&#xC758; &#xCD5C;&#xC0C1;&#xC704; &#xBE44;&#xD2B8;&#xB97C; &#xC870;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>WinAFL&#xC5D0;&#xC11C;&#xB294; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xD578;&#xB4E4;&#xB9C1;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xCD5C;&#xC0C1;&#xC704; &#xBE44;&#xD2B8;&#xB97C; &#xCCB4;&#xD06C;&#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xD574;&#xB2F9; &#xBE44;&#xD2B8;&#xAC00; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xB2E4;&#xBA74;(&#xAC12;&#xC774; &#xC788;&#xB2E4;&#xBA74;), WinAFL&#xC740; &#xD574;&#xB2F9; &#xBE44;&#xD2B8;&#xB97C; &#xB2E4;&#xC2DC; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xD558;&#xACE0; &#xD574;&#xB2F9; &#xBA54;&#xC2DC;&#xC9C0;&#xC758; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB97C; &#xCE21;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xD574;&#xB2F9; &#xBE44;&#xD2B8;&#xAC00; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xB2E4;&#xBA74; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xBB34;&#xC2DC;&#xD558;&#xACE0; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB97C; &#xCE21;&#xC815;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xC5EC;&#xAE30;&#xAE4C;&#xC9C0; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84; &#xC14B;&#xC5C5;&#xC758; &#xBE44;&#xC2B7;&#xD55C; &#xC810;&#xB4E4;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC54C;&#xC544;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC; &#xC774;&#xC81C; &#xB2E4;&#xB978; &#xC810;&#xB4E4;&#xC744; &#xBCF4;&#xC8E0;. &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xBA3C;&#xC800; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<h2 id="Client-Fuzzing-Setup"><a href="#Client-Fuzzing-Setup" class="headerlink" title="Client Fuzzing Setup"></a>Client Fuzzing Setup</h2><p>Windwos RDP client&#xB294; mstsc.exe&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xAC00;&#xC0C1; &#xCC44;&#xB110; &#xB370;&#xC774;&#xD130;&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xB85C;&#xC9C1;&#xC740; mstscax.dll&#xC5D0; &#xB4E4;&#xC5B4;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Hyper-V &#xAC00;&#xC0C1; &#xBA38;&#xC2E0;&#xC758; &#xC6D0;&#xACA9; &#xC811;&#xADFC; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC778; vmconnect.exe&#xB3C4; &#xB611;&#xAC19;&#xC774; mstscax.dll&#xC5D0; &#xCF54;&#xC5B4; &#xAE30;&#xB2A5;&#xB4E4;&#xC774; &#xB4E4;&#xC5B4;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/10/17/j0ker/rdp_fuzzing1/3.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p>Windows RDP Client</p>
</blockquote>
<p>&#xB2E8;&#xC21C;&#xC131;&#xACFC; &#xD6A8;&#xC728;&#xC131;&#xC744; &#xC704; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84;(&#xD0C0;&#xAC9F;&#xACFC; &#xC5D0;&#xC774;&#xC804;&#xD2B8;)&#xB97C; &#xAC19;&#xC740; &#xBA38;&#xC2E0;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.(&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; localhost/127.0.0.1&#xC5D0; &#xC811;&#xC18D;) &#xB610;&#xD55C; &#xBCD1;&#xB839; &#xD37C;&#xC9D5;&#xC744; &#xD560; &#xC218; &#xC787;&#xAC8C; mimikatz&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC5EC;&#xB7EC; RDP &#xC5F0;&#xACB0;&#xC744; &#xD5C8;&#xC6A9;&#xD558;&#xB3C4;&#xB85D; &#xC11C;&#xBC84;&#xB97C; &#xD328;&#xCE58;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/10/17/j0ker/rdp_fuzzing1/4.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xD37C;&#xC9D5;&#xC744; &#xC704;&#xD55C; &#xC14B;&#xC5C5; &#xAD6C;&#xC131;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Target : mstsc.exe&#xC640; &#xD0C0;&#xAC9F; &#xBAA8;&#xB4C8;&#xC778; mstscax.dll</li>
<li>Instrumentation : &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; DynamoRIO&#xC640; &#xCF54;&#xB4DC;&#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB294; &#xC804;&#xB2EC;&#xD558;&#xB294; DynamoRIO &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC778; winafl.dll</li>
<li>Mutation engine : &#xAC19;&#xC740; &#xBA38;&#xC2E0;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xACE0; &#xD30C;&#xC77C;&#xC5D0; &#xC0C8;&#xB85C;&#xC6B4; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB97C; &#xC4F0;&#xB294; AFL-Fuzzer</li>
<li>Input sender : &#xC11C;&#xBC84;&#xC5D0; &#xB300;&#xD55C; &#xD578;&#xB4E4;&#xC744; &#xC624;&#xD508;&#xD558;&#xACE0; &#xC120;&#xD0DD;&#xB41C; &#xAC00;&#xC0C1; &#xCC44;&#xB110;&#xB85C; PDU&#xB97C; &#xC804;&#xB2EC;&#xD558;&#xB294; RDPFuzzAgent. &#xC774; &#xC5D0;&#xC774;&#xC804;&#xD2B8;&#xB294; AFL-Fuzz&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xD30C;&#xC77C;&#xC73C;&#xB85C;&#xBD80;&#xD130; &#xC77D;&#xC5B4;&#xC624;&#xB294; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB4E4;&#xC744; &#xD0C0;&#xCF13; &#xCC44;&#xB110;&#xC5D0; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xC774;&#xB807;&#xAC8C; &#xAD6C;&#xC131;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xC6B0;&#xB9AC;&#xB294; &#xCD08;&#xB2F9; 50 ~ 100 &#xBC88; &#xC2E4;&#xD589;&#xC774;&#xB77C;&#xB294; &#xC18D;&#xB3C4;&#xB97C; &#xB0BC; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAC8C; &#xBE60;&#xB978; &#xC18D;&#xB3C4;&#xB294; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC; &#xC55E;&#xC11C; &#xC5B8;&#xAE09;&#xD55C; &#xC5F0;&#xAD6C;&#xC5D0;&#xC11C;&#xC758; &#xC18D;&#xB3C4;&#xBCF4;&#xB2E4;&#xB294; &#xBE68;&#xB790;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC6B0;&#xB9AC;&#xB294; &#xB9CC;&#xC871;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Server-Fuzzing-Setup"><a href="#Server-Fuzzing-Setup" class="headerlink" title="Server Fuzzing Setup"></a>Server Fuzzing Setup</h2><p>RDP &#xC11C;&#xBC84;&#xC758; &#xBA54;&#xC778; &#xB85C;&#xC9C1;&#xC744; &#xB2F4;&#xACE0; &#xC788;&#xB294; &#xD0C0;&#xAC9F; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xCC3E;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xC7A0;&#xAE50; <code>Remote Desktop Service</code> &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xD6D1;&#xACE0; &#xAC00;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs powershell"><span class="hljs-built_in">PS</span> C:\&gt; <span class="hljs-built_in">gci</span> HKLM:\SYSTEM\CurrentControlSet\Services\<span class="hljs-variable">$</span>((<span class="hljs-built_in">Get-Service</span> <span class="hljs-literal">-Name</span> <span class="hljs-string">&quot;Remote Desktop Services&quot;</span>).Name)
    Hive: HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\TermService
Name                           Property
----                           --------
Parameters                     ServiceDll             : C:\Windows\System32\termsrv.dll
. . .</code></pre>
<p>RDP &#xC11C;&#xBC84;&#xC758; &#xBA54;&#xC778; &#xB85C;&#xC9C1;&#xC740; termsrv.dll&#xC5D0; &#xB4E4;&#xC5B4; &#xC788;&#xB294;&#xB370;, &#xC774; dll&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xCEE4;&#xB9E8;&#xB4DC; &#xB77C;&#xC778;&#xC73C;&#xB85C; svchost.exe&#xC5D0; &#xB85C;&#xB4DC;&#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs latex">C:<span class="hljs-tag">\<span class="hljs-name">Windows</span></span><span class="hljs-tag">\<span class="hljs-name">System</span></span>32<span class="hljs-tag">\<span class="hljs-name">svchost</span></span>.exe -k NetworkService -s TermService</code></pre>
<p>&#xC11C;&#xBC84; &#xD37C;&#xC9D5; &#xBC29;&#xBC95;&#xC740; &#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC720;&#xC0AC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. <code>TermService</code>&#xC758; &#xC5EC;&#xB7EC; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC19;&#xC740; &#xBA38;&#xC2E0;&#xC5D0;&#xC11C; &#xC5EC;&#xB7EC; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xBCD1;&#xB82C;&#xC801;&#xC73C;&#xB85C; &#xD37C;&#xC9D5;&#xD558;&#xB294; &#xAC83;&#xC774;&#xC5C8;&#xC8E0;. &#xD558;&#xC9C0;&#xB9CC; Windows&#xC5D0;&#xC11C; &#xC774;&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xC544;&#xC11C; &#xAF64;&#xB098; &#xD070; &#xCC4C;&#xB9B0;&#xC9C0;&#xAC00; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xB294; &#xC774;&#xB97C; &#xACE0;&#xCE58;&#xAE30; &#xC704;&#xD574; &#xB178;&#xB825;&#xD588;&#xC9C0;&#xB9CC; <code>termsrv.dll</code>&#xC5D0;&#xC11C; <code>TermService</code>&#xC640; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xB4E4;&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xD558;&#xB4DC;&#xCF54;&#xB529;&#xB41C; &#xBB38;&#xC790;&#xC5F4;&#xB4E4;&#xC744; &#xBC1C;&#xACAC;&#xD558;&#xC600;&#xACE0;, &#xB530;&#xB77C;&#xC11C; &#xADF8;&#xB0E5; &#xC5EC;&#xB7EC; VM&#xC744; &#xD65C;&#xC6A9;&#xD574; &#xC11C;&#xBC84;&#xB97C; &#xBCD1;&#xB82C; &#xD37C;&#xC9D5;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xACB0;&#xC815;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xD37C;&#xC9D5; &#xC14B;&#xC5C5;&#xC5D0;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; &#xC11C;&#xBC84; &#xC0AC;&#xC774;&#xB4DC; API&#xB97C; &#xD65C;&#xC6A9;&#xD574; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/windows/win32/api/wtsapi32/nf-wtsapi32-wtsvirtualchannelwrite"><code>WTSVirtualChannelWrite()</code></a> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC5EC; &#xD37C;&#xC9D5; &#xC778;&#xD48B;&#xC744; &#xD0C0;&#xAC9F;&#xC5D0;&#xAC8C; &#xC804;&#xC1A1;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; RDP &#xC5F0;&#xACB0; &#xC0C1;&#xD669;&#xC5D0;&#xC11C; &#xC11C;&#xBC84;&#xB85C; &#xC778;&#xD48B;&#xC744; &#xC804;&#xB2EC;&#xD560; &#xC218; &#xC788;&#xB294; API&#xB294; &#xCC3E;&#xC9C0; &#xBABB;&#xD558;&#xC600;&#xC8E0;. &#xC774;&#xB85C; &#xC778;&#xD574; &#xC800;&#xD76C;&#xB294; &#xCEE4;&#xC2A4;&#xD140;&#xD55C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.freerdp.com/">FreeRDP</a>(&#xC778;&#xC2DC;&#xC788;&#xB294; &#xC624;&#xD508;&#xC18C;&#xC2A4; RDP &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC8E0;)&#xB97C; &#xD65C;&#xC6A9;&#xD574; &#xC6B0;&#xBD84;&#xD22C; &#xBA38;&#xC2E0;&#xC5D0;&#xC11C; &#xC11C;&#xBC84;&#xB85C; &#xC778;&#xD48B;&#xC744; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC120;&#xD0DD;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xBC29;&#xBC95;&#xC740; &#xC774;&#xC0C1;&#xC801;&#xC778; &#xD37C;&#xC9D5; &#xC14B;&#xC5C5;&#xC774; &#xC544;&#xB2C8;&#xACE0; &#xC774;&#xB7F0; &#xC81C;&#xC57D;&#xC870;&#xAC74; &#xB54C;&#xBB38;&#xC5D0; &#xC11C;&#xBC84; &#xD37C;&#xC9D5; &#xC2A4;&#xD53C;&#xB4DC;&#xAC00; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xD37C;&#xC9D5; &#xC2A4;&#xD53C;&#xB4DC;&#xC758; 1/10 &#xC815;&#xB3C4;&#xB418;&#xB294; &#xACB0;&#xACFC;&#xB97C; &#xB0B3;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/10/17/j0ker/rdp_fuzzing1/5.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p>&#xC11C;&#xBC84; &#xD37C;&#xC9D5; &#xC0C1;&#xD669;</p>
</blockquote>
<p>&#xC11C;&#xBC84; &#xD37C;&#xC9D5; &#xC14B;&#xC5C5;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/10/17/j0ker/rdp_fuzzing1/6.png" srcset="/img/loading.gif" alt="Untitled"></p>
<ul>
<li>Target : &#xD37C;&#xC9D5;&#xD560; &#xCC44;&#xB110;&#xC5D0; &#xB530;&#xB77C; &#xB2EC;&#xB77C;&#xC9D1;&#xB2C8;&#xB2E4;. tarmsrv.dll, audiodg.exe, rdpinput.exe &#xB4F1;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.(&#xB2E4;&#xC74C; &#xC139;&#xC158;&#xC5D0; &#xC788;&#xB294; &#x201C;Locating the relevant code&#x201D; &#xBD80;&#xBD84;&#xC744; &#xCC38;&#xACE0;&#xD574;&#xC8FC;&#xC138;&#xC694;. &#xAC01; &#xCC44;&#xB110;&#xC758; &#xD0C0;&#xAC9F;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xC774;&#xD574;&#xD558;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.)</li>
<li>Instrumentation : &#xC774;&#xB7F0; &#xC14B;&#xC5C5;&#xC5D0;&#xC11C;&#xB294; &#xD37C;&#xC800;&#xAC00; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xCD08;&#xAE30;&#xD654;&#xB97C; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC800;&#xD76C;&#xB294; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB97C; &#xCE21;&#xC815;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xACE0; &#xC788;&#xB294; &#xD0C0;&#xAC9F;&#xC744; instrument&#xD560; &#xC218; &#xBC16;&#xC5D0; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; WinAFL&#xC744; &#xC120;&#xD0DD;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xACE0; &#xD655;&#xC7A5;&#xC131;&#xACFC; &#xC548;&#xC815;&#xC131;&#xC744; &#xC704;&#xD574; DynamoRIO&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>DynamoRIO : DynamoRIO&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBC16;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; attach&#xD558;&#xB294; &#xAC83;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; &#xC774; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/DynamoRIO/dynamorio/pull/3328">pull request</a>&#xB97C; &#xC218;&#xC815; &#xBC0F; &#xAC1C;&#xBC1C;&#xD558;&#xC600;&#xACE0; &#xC774;&#xB97C; WinAFL&#xC5D0; &#xBD99;&#xC5EC; &#xD65C;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>Mutation engine : Windows &#xBA38;&#xC2E0;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xACE0; &#xACF5;&#xC720; &#xD3F4;&#xB354;&#xC5D0; &#xC788;&#xB294; &#xD30C;&#xC77C;&#xC5D0; &#xC0C8;&#xB85C;&#xC6B4; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB97C; &#xC4F0;&#xB294; AFL-Fuzzer</li>
<li>Input sender : Windows &#xBA38;&#xC2E0;&#xC5D0; &#xC788;&#xB294; &#xC11C;&#xBC84;&#xC5D0; &#xC5F0;&#xACB0;&#xD558;&#xB294; FreeRDP&#xB85C; &#xACF5;&#xC720; &#xD3F4;&#xB354;&#xC5D0; &#xC788;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB4E4;&#xC744; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1;&#xD558;&#xACE0; &#xD0C0;&#xAC9F; RDP &#xCC44;&#xB110;&#xC5D0; &#xC804;&#xC1A1;</li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Translation/">Translation</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/network/">network</a>
                  
                  <a class="hover-with-bg" href="/tags/rdp/">rdp</a>
                  
                  <a class="hover-with-bg" href="/tags/winafl/">winafl</a>
                  
                  <a class="hover-with-bg" href="/tags/fuzzing/">fuzzing</a>
                  
                  <a class="hover-with-bg" href="/tags/j0ker/">j0ker</a>
                  
                  <a class="hover-with-bg" href="/tags/server/">server</a>
                  
                  <a class="hover-with-bg" href="/tags/instrumentation/">instrumentation</a>
                  
                  <a class="hover-with-bg" href="/tags/dynamorio/">dynamorio</a>
                  
                  <a class="hover-with-bg" href="/tags/client/">client</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_j0ker.jpg" srcset="/img/loading.gif" alt="j0ker">
                  </div>

                  <div class="link-text">
                    <div class="link-title">j0ker</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/j0ker">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/10/19/fabu1ous/2021-10-19/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] Bypassing required reviews using GitHub Actions</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/10/16/l0ch/2021-10-16/">
                    <span class="hidden-mobile">[] Broadcom SDK Buffer Overflow </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/10/17/j0ker/rdp_fuzzing1/';
        this.page.identifier = '/2021/10/17/j0ker/rdp_fuzzing1/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Translation] Fuzzing RDP: Holding the Stick at Both Ends (1)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
