

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h2 id=&#34;URL&#34;&gt;&lt;a href=&#34;#URL&#34; class=&#34;headerlink&#34; title=&#34;URL&#34;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://securelist.com/toolshell-explained/117045/&#34;&gt;https://securelist.com/toolshell-explained/117045/&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC628;&amp;#xD504;&amp;#xB808;&amp;#xBBF8;&amp;#xC2A4; Microsoft SharePoint Server (Subscription Edition, 2019, 2016 &amp;#xB4F1; &amp;#xC9C0;&amp;#xC6D0;&amp;#xB418;&amp;#xB294; &amp;#xC628;&amp;#xD504;&amp;#xB808;&amp;#xBBF8;&amp;#xC2A4; &amp;#xBC84;&amp;#xC804;)&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Explain&#34;&gt;&lt;a href=&#34;#Explain&#34; class=&#34;headerlink&#34; title=&#34;Explain&#34;&gt;&lt;/a&gt;Explain&lt;/h2&gt;&lt;p&gt;CVE-2025-53770/CVE-2025-53771&amp;#xC740; &amp;#xC628;&amp;#xD504;&amp;#xB808;&amp;#xBBF8;&amp;#xC2A4; SharePoint &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBE44;&amp;#xBC00;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC774;&amp;#xC804; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; CVE-2025-49704&amp;#xC640; CVE-2025-49706&amp;#xC758; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774;&amp;#xBA70;, &amp;#xC5ED;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654; &amp;#xAE30;&amp;#xBC95;&amp;#xACFC; Viewstate &amp;#xC545;&amp;#xC6A9;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; RCE &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xCD08;&amp;#xAE30; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;(CVE-2025-49706, CVE-2025-49704)&amp;#xC740;  Pwn2Own Berlin 2025&amp;#xC5D0;&amp;#xC11C; &amp;#xC2DC;&amp;#xC5F0;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xC774;&amp;#xD6C4; 7&amp;#xC6D4;&amp;#xC5D0; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCD94;&amp;#xAC00; &amp;#xBD84;&amp;#xC11D; &amp;#xACB0;&amp;#xACFC; &amp;#xCD08;&amp;#xAE30; &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; CVE-2025-53770/CVE-2025-53771&amp;#xC774; &amp;#xC0C8;&amp;#xB85C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;CVE-2025-59704&#34;&gt;&lt;a href=&#34;#CVE-2025-59704&#34; class=&#34;headerlink&#34; title=&#34;CVE-2025-59704&#34;&gt;&lt;/a&gt;CVE-2025-59704&lt;/h3&gt;&lt;p&gt;&amp;#xCD08;&amp;#xAE30; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; CVE-2025-49704&amp;#xC740; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC804;&amp;#xB2EC;&amp;#xB41C; WebPart &amp;#xB9C8;&amp;#xD06C;&amp;#xC5C5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC5ED;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; POST &amp;#xC694;&amp;#xCCAD;&amp;#xC758; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218; &lt;code&gt;MSOtlPn_Uri&lt;/code&gt;&amp;#xC640; &lt;code&gt;MSOtlPn_DWP&lt;/code&gt;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xB370;, Microsoft.SharePoint.dll&amp;#xC758; GetPartPreviewAndPropertiesFromMarkup &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xBCC0;&amp;#xC218;&amp;#xB4E4;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;MSOtlPn_Uri&lt;/code&gt;&amp;#xB294; CONTROLTEMPLATES &amp;#xD3F4;&amp;#xB354; &amp;#xB0B4;&amp;#xBD80; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xC774;&amp;#xACE0;, &lt;code&gt;MSOtlPn_DWP&lt;/code&gt;&amp;#xB294; WebPart &amp;#xD615;&amp;#xC2DD;&amp;#xC758; &amp;#xB9C8;&amp;#xD06C;&amp;#xC5C5;(XML &amp;#xC720;&amp;#xC0AC; &amp;#xAD6C;&amp;#xBB38;)&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB3FC;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;MSOtlPn_DWP&lt;/code&gt;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; XML &amp;#xC790;&amp;#xCCB4;&amp;#xC5D0;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; CompressDataTable &amp;#xC18D;&amp;#xC131;&amp;#xC5D0; &amp;#xC545;&amp;#xC131; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xB123;&amp;#xC73C;&amp;#xBA74; Microsoft.PerformancePoint.Scorecards.Client.dll&amp;#xC758; ExcelDataSet&amp;#xC774; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xD654; &amp;#xB418;&amp;#xACE0;, &amp;#xD574;&amp;#xB2F9; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xC758; DataTable getter&amp;#xAC00; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC5ED;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654;&amp;#xAC00; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image1.png&#34; alt=&#34;image1.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;BinarySerialization.Deserialize()&lt;/code&gt;&amp;#xB294; XML&amp;#xC5D0; &amp;#xC801;&amp;#xD78C; &amp;#xD0C0;&amp;#xC785;&amp;#xB4E4;&amp;#xC774; &amp;#xD5C8;&amp;#xC6A9; &amp;#xBAA9;&amp;#xB85D;&amp;#xC5D0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &lt;code&gt;XmlValidator&lt;/code&gt;&amp;#xB85C; &amp;#xAC80;&amp;#xC0AC;&amp;#xD574; &amp;#xC5ED;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654;&amp;#xB97C; &amp;#xB9C9;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &lt;code&gt;ExpandedWrapper&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xC704;&amp;#xD5D8;&amp;#xD55C; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xB123;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xD5C8;&amp;#xC6A9;&amp;#xB41C; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;(List &amp;#xB4F1;) &amp;#xC548;&amp;#xC5D0; &amp;#xC228;&amp;#xACA8; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD588;&amp;#xACE0;, &amp;#xC5ED;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654;&amp;#xAC00; &amp;#xD1B5;&amp;#xACFC;&amp;#xB418;&amp;#xC5B4; &amp;#xAC00;&amp;#xC82F; &amp;#xCCB4;&amp;#xC778;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;CVE-2025-53770&#34;&gt;&lt;a href=&#34;#CVE-2025-53770&#34; class=&#34;headerlink&#34; title=&#34;CVE-2025-53770&#34;&gt;&lt;/a&gt;CVE-2025-53770&lt;/h3&gt;&lt;p&gt;CVE-2025-53770&amp;#xC740; CVE-2025-49704&amp;#xC758; &amp;#xBCC0;&amp;#xC885;&amp;#xC73C;&amp;#xB85C;, CVE-2025-49704&amp;#xC758; &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xC77C;&amp;#xBD80; &amp;#xACBD;&amp;#xB85C;&amp;amp;&amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC5EC;&amp;#xC9C0;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;Microsoft&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xBC1C;&amp;#xD45C;&amp;#xD558;&amp;#xACE0; XML&amp;#xC758; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xB294; XmlValidator&amp;#xB97C; &amp;#xAC15;&amp;#xD654;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image2.png&#34; alt=&#34;image2.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xC751;&amp;#xBC29;&amp;#xC548;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Microsoft&amp;#xC758; &amp;#xCD5C;&amp;#xC2E0; &amp;#xBCF4;&amp;#xC548; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xC801;&amp;#xC6A9;&lt;/li&gt;
&lt;li&gt;AMSI &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xBC0F; antivirus &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&lt;/li&gt;
&lt;li&gt;Machinekey &amp;#xC7AC;&amp;#xC124;&amp;#xC815;&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;CVE-2025-53771&#34;&gt;&lt;a href=&#34;#CVE-2025-53771&#34; class=&#34;headerlink&#34; title=&#34;CVE-2025-53771&#34;&gt;&lt;/a&gt;CVE-2025-53771&lt;/h3&gt;&lt;p&gt;Sharepoint&amp;#xB294; &amp;#xC6F9; &amp;#xC11C;&amp;#xBC84;(IIS)&amp;#xC640; ASP.NET &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. IIS&amp;#xC640; ASP.NET&amp;#xC5D0;&amp;#xB294; &amp;#xAC01;&amp;#xAC01; &amp;#xC778;&amp;#xC99D; &amp;#xC808;&amp;#xCC28;&amp;#xAC00; &amp;#xC788;&amp;#xACE0;, SharePoint&amp;#xB294; IIS&amp;#xB97C; &amp;#xD1B5;&amp;#xD569;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; IIS&amp;#xC758; &amp;#xC778;&amp;#xC99D;&amp;#xACFC; ASP.NET &amp;#xC778;&amp;#xC99D;&amp;#xC774; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &amp;#xD569;&amp;#xCCD0;&amp;#xC838; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; PostAuthenticateRequest &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC778;&amp;#xC99D; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xC815;&amp;#xB9AC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;PostAuthenticateRequestHandler&amp;#xB294; &amp;#xC774; &amp;#xCD5C;&amp;#xC885; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB85C;, &lt;/p&gt;
&lt;p&gt;&amp;#xCD08;&amp;#xAE30; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &lt;code&gt;CVE-2025-49706&lt;/code&gt;&amp;#xB294; Microsoft.SharePoint.dll&amp;#xC758; PostAuthenticateRequestHandler &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image3.png&#34; alt=&#34;image3.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xB294; PostAuthenticateRequestHandler&amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xC694;&amp;#xCCAD;&amp;#xC758; Referer &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xB294; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&amp;#xB294; Referer&amp;#xAC00; &amp;#xB2E4;&amp;#xC74C; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC640; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xB300;&amp;#xC18C;&amp;#xBB38;&amp;#xC790; &amp;#xAD6C;&amp;#xBD84; x)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;/_layouts/SignOut.aspx&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;/_layouts/14/SignOut.aspx&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;/_layouts/15/SignOut.aspx&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC138; URL&amp;#xC740; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3; &amp;#xD750;&amp;#xB984;&amp;#xACFC; &amp;#xC5F0;&amp;#xAD00;&amp;#xB41C; &amp;#xACBD;&amp;#xB85C;&amp;#xC778;&amp;#xB370;, &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC774;&amp;#xB97C; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3; &amp;#xC694;&amp;#xCCAD;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xBA74; &amp;#xB0B4;&amp;#xBD80; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &lt;code&gt;flag6 = false&lt;/code&gt; &amp;#xBC0F; &lt;code&gt;flag7 = true&lt;/code&gt;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD50C;&amp;#xB798;&amp;#xADF8; &amp;#xC870;&amp;#xD569;&amp;#xC774; &lt;code&gt;flag6=false&lt;/code&gt;, &lt;code&gt;flag7=true&lt;/code&gt; &amp;#xC73C;&amp;#xB85C; &amp;#xB418;&amp;#xBA74;, &lt;code&gt;!flag7&lt;/code&gt; &amp;#xBD84;&amp;#xAE30;&amp;#xB97C; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xACE0;, &lt;code&gt;flag6&lt;/code&gt; &amp;#xBD84;&amp;#xAE30;&amp;#xB294; &amp;#xCFE0;&amp;#xD0A4; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xCD94;&amp;#xAC00; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC80;&amp;#xC0AC;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xBA74; &amp;#xC778;&amp;#xC99D; &amp;#xAC70;&amp;#xBD80; &amp;#xD638;&amp;#xCD9C;(&lt;code&gt;SendAccessDeniedHeader&lt;/code&gt;)&amp;#xC774; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC778;&amp;#xC99D; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image4.png&#34; alt=&#34;image4.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC694;&amp;#xCCAD;&amp;#xC758; Referer &amp;#xD5E4;&amp;#xB354;&amp;#xB9CC; &amp;#xC704;&amp;#xC870;&amp;#xD558;&amp;#xC5EC; &amp;#xB0B4;&amp;#xBD80; &amp;#xAD00;&amp;#xB9AC; &amp;#xC5D4;&amp;#xB4DC;&amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xBE44;&amp;#xC778;&amp;#xC99D; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;p&gt;Microsoft&amp;#xB294; 2025&amp;#xB144; 7&amp;#xC6D4; 8&amp;#xC77C; &amp;#xD328;&amp;#xCE58;&amp;#xC5D0;&amp;#xC11C; Referrer&amp;#xAC00; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC77C; &amp;#xB54C;, &amp;#xC694;&amp;#xCCAD; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#x201C;ToolPane.aspx&amp;#x201D;&amp;#xB85C; &amp;#xB05D;&amp;#xB098;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image5.png&#34; alt=&#34;image5.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC694;&amp;#xCCAD; url&amp;#xC5D0; /&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xBA74; &amp;#xC694;&amp;#xCCAD; &amp;#xACBD;&amp;#xB85C;&amp;#xC758; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; endsWith(&amp;#x201C;ToolPane.aspx&amp;#x201D;) = false&amp;#xAC00; &amp;#xB418;&amp;#xC5B4;  &lt;code&gt;CVE-2025-49706&lt;/code&gt;&amp;#xC758; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image6.png&#34; alt=&#34;image6.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC5D0; 7&amp;#xC6D4; 20&amp;#xC77C; &amp;#xBCF4;&amp;#xAC15;&amp;#xD328;&amp;#xCE58;&amp;#xB85C; endsWith&amp;#xC5D0;&amp;#xC11C; &amp;#xD654;&amp;#xC774;&amp;#xD2B8;&amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8; &amp;#xAE30;&amp;#xBC18; &amp;#xD5C8;&amp;#xC6A9; &amp;#xACBD;&amp;#xB85C; &amp;#xAC80;&amp;#xC0AC;&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xC5B4; &amp;#xD328;&amp;#xCE58;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image7.png&#34; alt=&#34;image7.png&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://socprime.com/ko/blog/latest-threats/detect-cve-2025-53770-exploitation/&#34;&gt;https://socprime.com/ko/blog/latest-threats/detect-cve-2025-53770-exploitation/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.sans.org/blog/critical-sharepoint-zero-day-exploited-what-you-need-to-know-about-cve-2025-53770?utm_source=chatgpt.com&#34;&gt;https://www.sans.org/blog/critical-sharepoint-zero-day-exploited-what-you-need-to-know-about-cve-2025-53770&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[하루한줄] CVE-2025-53770(RCE), CVE-2025-53771(Authentication bypass) :Microsoft SharePoint 취약점 - hackyboiz">
  <meta property="og:description" content="&lt;h2 id=&#34;URL&#34;&gt;&lt;a href=&#34;#URL&#34; class=&#34;headerlink&#34; title=&#34;URL&#34;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://securelist.com/toolshell-explained/117045/&#34;&gt;https://securelist.com/toolshell-explained/117045/&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC628;&amp;#xD504;&amp;#xB808;&amp;#xBBF8;&amp;#xC2A4; Microsoft SharePoint Server (Subscription Edition, 2019, 2016 &amp;#xB4F1; &amp;#xC9C0;&amp;#xC6D0;&amp;#xB418;&amp;#xB294; &amp;#xC628;&amp;#xD504;&amp;#xB808;&amp;#xBBF8;&amp;#xC2A4; &amp;#xBC84;&amp;#xC804;)&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Explain&#34;&gt;&lt;a href=&#34;#Explain&#34; class=&#34;headerlink&#34; title=&#34;Explain&#34;&gt;&lt;/a&gt;Explain&lt;/h2&gt;&lt;p&gt;CVE-2025-53770/CVE-2025-53771&amp;#xC740; &amp;#xC628;&amp;#xD504;&amp;#xB808;&amp;#xBBF8;&amp;#xC2A4; SharePoint &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBE44;&amp;#xBC00;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC774;&amp;#xC804; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; CVE-2025-49704&amp;#xC640; CVE-2025-49706&amp;#xC758; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774;&amp;#xBA70;, &amp;#xC5ED;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654; &amp;#xAE30;&amp;#xBC95;&amp;#xACFC; Viewstate &amp;#xC545;&amp;#xC6A9;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; RCE &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xCD08;&amp;#xAE30; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;(CVE-2025-49706, CVE-2025-49704)&amp;#xC740;  Pwn2Own Berlin 2025&amp;#xC5D0;&amp;#xC11C; &amp;#xC2DC;&amp;#xC5F0;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xC774;&amp;#xD6C4; 7&amp;#xC6D4;&amp;#xC5D0; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCD94;&amp;#xAC00; &amp;#xBD84;&amp;#xC11D; &amp;#xACB0;&amp;#xACFC; &amp;#xCD08;&amp;#xAE30; &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; CVE-2025-53770/CVE-2025-53771&amp;#xC774; &amp;#xC0C8;&amp;#xB85C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;CVE-2025-59704&#34;&gt;&lt;a href=&#34;#CVE-2025-59704&#34; class=&#34;headerlink&#34; title=&#34;CVE-2025-59704&#34;&gt;&lt;/a&gt;CVE-2025-59704&lt;/h3&gt;&lt;p&gt;&amp;#xCD08;&amp;#xAE30; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; CVE-2025-49704&amp;#xC740; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC804;&amp;#xB2EC;&amp;#xB41C; WebPart &amp;#xB9C8;&amp;#xD06C;&amp;#xC5C5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC5ED;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; POST &amp;#xC694;&amp;#xCCAD;&amp;#xC758; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218; &lt;code&gt;MSOtlPn_Uri&lt;/code&gt;&amp;#xC640; &lt;code&gt;MSOtlPn_DWP&lt;/code&gt;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xB370;, Microsoft.SharePoint.dll&amp;#xC758; GetPartPreviewAndPropertiesFromMarkup &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xBCC0;&amp;#xC218;&amp;#xB4E4;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;MSOtlPn_Uri&lt;/code&gt;&amp;#xB294; CONTROLTEMPLATES &amp;#xD3F4;&amp;#xB354; &amp;#xB0B4;&amp;#xBD80; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xC774;&amp;#xACE0;, &lt;code&gt;MSOtlPn_DWP&lt;/code&gt;&amp;#xB294; WebPart &amp;#xD615;&amp;#xC2DD;&amp;#xC758; &amp;#xB9C8;&amp;#xD06C;&amp;#xC5C5;(XML &amp;#xC720;&amp;#xC0AC; &amp;#xAD6C;&amp;#xBB38;)&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB3FC;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;MSOtlPn_DWP&lt;/code&gt;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; XML &amp;#xC790;&amp;#xCCB4;&amp;#xC5D0;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; CompressDataTable &amp;#xC18D;&amp;#xC131;&amp;#xC5D0; &amp;#xC545;&amp;#xC131; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xB123;&amp;#xC73C;&amp;#xBA74; Microsoft.PerformancePoint.Scorecards.Client.dll&amp;#xC758; ExcelDataSet&amp;#xC774; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xD654; &amp;#xB418;&amp;#xACE0;, &amp;#xD574;&amp;#xB2F9; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xC758; DataTable getter&amp;#xAC00; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC5ED;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654;&amp;#xAC00; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image1.png&#34; alt=&#34;image1.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;BinarySerialization.Deserialize()&lt;/code&gt;&amp;#xB294; XML&amp;#xC5D0; &amp;#xC801;&amp;#xD78C; &amp;#xD0C0;&amp;#xC785;&amp;#xB4E4;&amp;#xC774; &amp;#xD5C8;&amp;#xC6A9; &amp;#xBAA9;&amp;#xB85D;&amp;#xC5D0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &lt;code&gt;XmlValidator&lt;/code&gt;&amp;#xB85C; &amp;#xAC80;&amp;#xC0AC;&amp;#xD574; &amp;#xC5ED;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654;&amp;#xB97C; &amp;#xB9C9;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &lt;code&gt;ExpandedWrapper&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xC704;&amp;#xD5D8;&amp;#xD55C; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xB123;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xD5C8;&amp;#xC6A9;&amp;#xB41C; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;(List &amp;#xB4F1;) &amp;#xC548;&amp;#xC5D0; &amp;#xC228;&amp;#xACA8; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD588;&amp;#xACE0;, &amp;#xC5ED;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654;&amp;#xAC00; &amp;#xD1B5;&amp;#xACFC;&amp;#xB418;&amp;#xC5B4; &amp;#xAC00;&amp;#xC82F; &amp;#xCCB4;&amp;#xC778;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;CVE-2025-53770&#34;&gt;&lt;a href=&#34;#CVE-2025-53770&#34; class=&#34;headerlink&#34; title=&#34;CVE-2025-53770&#34;&gt;&lt;/a&gt;CVE-2025-53770&lt;/h3&gt;&lt;p&gt;CVE-2025-53770&amp;#xC740; CVE-2025-49704&amp;#xC758; &amp;#xBCC0;&amp;#xC885;&amp;#xC73C;&amp;#xB85C;, CVE-2025-49704&amp;#xC758; &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xC77C;&amp;#xBD80; &amp;#xACBD;&amp;#xB85C;&amp;amp;&amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC5EC;&amp;#xC9C0;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;Microsoft&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xBC1C;&amp;#xD45C;&amp;#xD558;&amp;#xACE0; XML&amp;#xC758; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xB294; XmlValidator&amp;#xB97C; &amp;#xAC15;&amp;#xD654;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image2.png&#34; alt=&#34;image2.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xC751;&amp;#xBC29;&amp;#xC548;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Microsoft&amp;#xC758; &amp;#xCD5C;&amp;#xC2E0; &amp;#xBCF4;&amp;#xC548; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xC801;&amp;#xC6A9;&lt;/li&gt;
&lt;li&gt;AMSI &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xBC0F; antivirus &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&lt;/li&gt;
&lt;li&gt;Machinekey &amp;#xC7AC;&amp;#xC124;&amp;#xC815;&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;CVE-2025-53771&#34;&gt;&lt;a href=&#34;#CVE-2025-53771&#34; class=&#34;headerlink&#34; title=&#34;CVE-2025-53771&#34;&gt;&lt;/a&gt;CVE-2025-53771&lt;/h3&gt;&lt;p&gt;Sharepoint&amp;#xB294; &amp;#xC6F9; &amp;#xC11C;&amp;#xBC84;(IIS)&amp;#xC640; ASP.NET &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. IIS&amp;#xC640; ASP.NET&amp;#xC5D0;&amp;#xB294; &amp;#xAC01;&amp;#xAC01; &amp;#xC778;&amp;#xC99D; &amp;#xC808;&amp;#xCC28;&amp;#xAC00; &amp;#xC788;&amp;#xACE0;, SharePoint&amp;#xB294; IIS&amp;#xB97C; &amp;#xD1B5;&amp;#xD569;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; IIS&amp;#xC758; &amp;#xC778;&amp;#xC99D;&amp;#xACFC; ASP.NET &amp;#xC778;&amp;#xC99D;&amp;#xC774; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &amp;#xD569;&amp;#xCCD0;&amp;#xC838; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; PostAuthenticateRequest &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC778;&amp;#xC99D; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xC815;&amp;#xB9AC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;PostAuthenticateRequestHandler&amp;#xB294; &amp;#xC774; &amp;#xCD5C;&amp;#xC885; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB85C;, &lt;/p&gt;
&lt;p&gt;&amp;#xCD08;&amp;#xAE30; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &lt;code&gt;CVE-2025-49706&lt;/code&gt;&amp;#xB294; Microsoft.SharePoint.dll&amp;#xC758; PostAuthenticateRequestHandler &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image3.png&#34; alt=&#34;image3.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xB294; PostAuthenticateRequestHandler&amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xC694;&amp;#xCCAD;&amp;#xC758; Referer &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xB294; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&amp;#xB294; Referer&amp;#xAC00; &amp;#xB2E4;&amp;#xC74C; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC640; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xB300;&amp;#xC18C;&amp;#xBB38;&amp;#xC790; &amp;#xAD6C;&amp;#xBD84; x)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;/_layouts/SignOut.aspx&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;/_layouts/14/SignOut.aspx&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;/_layouts/15/SignOut.aspx&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC138; URL&amp;#xC740; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3; &amp;#xD750;&amp;#xB984;&amp;#xACFC; &amp;#xC5F0;&amp;#xAD00;&amp;#xB41C; &amp;#xACBD;&amp;#xB85C;&amp;#xC778;&amp;#xB370;, &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC774;&amp;#xB97C; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3; &amp;#xC694;&amp;#xCCAD;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xBA74; &amp;#xB0B4;&amp;#xBD80; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &lt;code&gt;flag6 = false&lt;/code&gt; &amp;#xBC0F; &lt;code&gt;flag7 = true&lt;/code&gt;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD50C;&amp;#xB798;&amp;#xADF8; &amp;#xC870;&amp;#xD569;&amp;#xC774; &lt;code&gt;flag6=false&lt;/code&gt;, &lt;code&gt;flag7=true&lt;/code&gt; &amp;#xC73C;&amp;#xB85C; &amp;#xB418;&amp;#xBA74;, &lt;code&gt;!flag7&lt;/code&gt; &amp;#xBD84;&amp;#xAE30;&amp;#xB97C; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xACE0;, &lt;code&gt;flag6&lt;/code&gt; &amp;#xBD84;&amp;#xAE30;&amp;#xB294; &amp;#xCFE0;&amp;#xD0A4; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xCD94;&amp;#xAC00; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC80;&amp;#xC0AC;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xBA74; &amp;#xC778;&amp;#xC99D; &amp;#xAC70;&amp;#xBD80; &amp;#xD638;&amp;#xCD9C;(&lt;code&gt;SendAccessDeniedHeader&lt;/code&gt;)&amp;#xC774; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC778;&amp;#xC99D; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image4.png&#34; alt=&#34;image4.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC694;&amp;#xCCAD;&amp;#xC758; Referer &amp;#xD5E4;&amp;#xB354;&amp;#xB9CC; &amp;#xC704;&amp;#xC870;&amp;#xD558;&amp;#xC5EC; &amp;#xB0B4;&amp;#xBD80; &amp;#xAD00;&amp;#xB9AC; &amp;#xC5D4;&amp;#xB4DC;&amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xBE44;&amp;#xC778;&amp;#xC99D; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;p&gt;Microsoft&amp;#xB294; 2025&amp;#xB144; 7&amp;#xC6D4; 8&amp;#xC77C; &amp;#xD328;&amp;#xCE58;&amp;#xC5D0;&amp;#xC11C; Referrer&amp;#xAC00; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC77C; &amp;#xB54C;, &amp;#xC694;&amp;#xCCAD; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#x201C;ToolPane.aspx&amp;#x201D;&amp;#xB85C; &amp;#xB05D;&amp;#xB098;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image5.png&#34; alt=&#34;image5.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC694;&amp;#xCCAD; url&amp;#xC5D0; /&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xBA74; &amp;#xC694;&amp;#xCCAD; &amp;#xACBD;&amp;#xB85C;&amp;#xC758; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; endsWith(&amp;#x201C;ToolPane.aspx&amp;#x201D;) = false&amp;#xAC00; &amp;#xB418;&amp;#xC5B4;  &lt;code&gt;CVE-2025-49706&lt;/code&gt;&amp;#xC758; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image6.png&#34; alt=&#34;image6.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC5D0; 7&amp;#xC6D4; 20&amp;#xC77C; &amp;#xBCF4;&amp;#xAC15;&amp;#xD328;&amp;#xCE58;&amp;#xB85C; endsWith&amp;#xC5D0;&amp;#xC11C; &amp;#xD654;&amp;#xC774;&amp;#xD2B8;&amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8; &amp;#xAE30;&amp;#xBC18; &amp;#xD5C8;&amp;#xC6A9; &amp;#xACBD;&amp;#xB85C; &amp;#xAC80;&amp;#xC0AC;&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xC5B4; &amp;#xD328;&amp;#xCE58;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image7.png&#34; alt=&#34;image7.png&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://socprime.com/ko/blog/latest-threats/detect-cve-2025-53770-exploitation/&#34;&gt;https://socprime.com/ko/blog/latest-threats/detect-cve-2025-53770-exploitation/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.sans.org/blog/critical-sharepoint-zero-day-exploited-what-you-need-to-know-about-cve-2025-53770?utm_source=chatgpt.com&#34;&gt;https://www.sans.org/blog/critical-sharepoint-zero-day-exploited-what-you-need-to-know-about-cve-2025-53770&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/1day1line.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/09/20/bekim/2025-09-20/">

  <title>[하루한줄] CVE-2025-53770(RCE), CVE-2025-53771(Authentication bypass) :Microsoft SharePoint 취약점 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-09-20 17:00" pubdate>
      2025년 9월 20일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.2k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      24
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[하루한줄] CVE-2025-53770(RCE), CVE-2025-53771(Authentication bypass) :Microsoft SharePoint 취약점</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://securelist.com/toolshell-explained/117045/">https://securelist.com/toolshell-explained/117045/</a></p>
<h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul>
<li>&#xC628;&#xD504;&#xB808;&#xBBF8;&#xC2A4; Microsoft SharePoint Server (Subscription Edition, 2019, 2016 &#xB4F1; &#xC9C0;&#xC6D0;&#xB418;&#xB294; &#xC628;&#xD504;&#xB808;&#xBBF8;&#xC2A4; &#xBC84;&#xC804;)</li>
</ul>
<h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>CVE-2025-53770/CVE-2025-53771&#xC740; &#xC628;&#xD504;&#xB808;&#xBBF8;&#xC2A4; SharePoint &#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C;, &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC545;&#xC131; &#xD30C;&#xC77C;&#xC744; &#xC5C5;&#xB85C;&#xB4DC;&#xD558;&#xACE0; &#xC554;&#xD638;&#xD654; &#xBE44;&#xBC00;&#xC744; &#xCD94;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC774;&#xC804; &#xCDE8;&#xC57D;&#xC810; CVE-2025-49704&#xC640; CVE-2025-49706&#xC758; &#xD328;&#xCE58;&#xB97C; &#xC6B0;&#xD68C;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC774;&#xBA70;, &#xC5ED;&#xC9C1;&#xB82C;&#xD654; &#xAE30;&#xBC95;&#xACFC; Viewstate &#xC545;&#xC6A9;&#xC744; &#xD1B5;&#xD574; RCE &#xACF5;&#xACA9;&#xC744; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  &#xCD08;&#xAE30; &#xCDE8;&#xC57D;&#xC810;(CVE-2025-49706, CVE-2025-49704)&#xC740;  Pwn2Own Berlin 2025&#xC5D0;&#xC11C; &#xC2DC;&#xC5F0;&#xB418;&#xC5C8;&#xACE0;, &#xC774;&#xD6C4; 7&#xC6D4;&#xC5D0; &#xD328;&#xCE58;&#xB418;&#xC5C8;&#xC9C0;&#xB9CC; &#xCD94;&#xAC00; &#xBD84;&#xC11D; &#xACB0;&#xACFC; &#xCD08;&#xAE30; &#xD328;&#xCE58;&#xAC00; &#xD574;&#xACB0;&#xB418;&#xC9C0; &#xC54A;&#xC544; CVE-2025-53770/CVE-2025-53771&#xC774; &#xC0C8;&#xB85C; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="CVE-2025-59704"><a href="#CVE-2025-59704" class="headerlink" title="CVE-2025-59704"></a>CVE-2025-59704</h3><p>&#xCD08;&#xAE30; &#xCDE8;&#xC57D;&#xC810; CVE-2025-49704&#xC740; &#xC678;&#xBD80;&#xC5D0;&#xC11C; &#xC804;&#xB2EC;&#xB41C; WebPart &#xB9C8;&#xD06C;&#xC5C5;&#xC744; &#xD1B5;&#xD574; &#xC11C;&#xBC84;&#xAC00; &#xC2E0;&#xB8B0;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC5ED;&#xC9C1;&#xB82C;&#xD654;&#xD558;&#xBA74;&#xC11C; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xACF5;&#xACA9;&#xC790;&#xB294; POST &#xC694;&#xCCAD;&#xC758; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218; <code>MSOtlPn_Uri</code>&#xC640; <code>MSOtlPn_DWP</code>&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xB294;&#xB370;, Microsoft.SharePoint.dll&#xC758; GetPartPreviewAndPropertiesFromMarkup &#xBA54;&#xC11C;&#xB4DC; &#xCF54;&#xB4DC;&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; &#xD574;&#xB2F9; &#xBCC0;&#xC218;&#xB4E4;&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; &#xCC98;&#xB9AC;&#xB418;&#xB294;&#xC9C0; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <code>MSOtlPn_Uri</code>&#xB294; CONTROLTEMPLATES &#xD3F4;&#xB354; &#xB0B4;&#xBD80; &#xD30C;&#xC77C;&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xACBD;&#xB85C;&#xC774;&#xACE0;, <code>MSOtlPn_DWP</code>&#xB294; WebPart &#xD615;&#xC2DD;&#xC758; &#xB9C8;&#xD06C;&#xC5C5;(XML &#xC720;&#xC0AC; &#xAD6C;&#xBB38;)&#xC774; &#xD3EC;&#xD568;&#xB3FC;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image.png" srcset="/img/loading.gif" alt="image.png"></p>
<p><code>MSOtlPn_DWP</code>&#xC5D0; &#xD3EC;&#xD568;&#xB41C; XML &#xC790;&#xCCB4;&#xC5D0;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC5C6;&#xC9C0;&#xB9CC; &#xACF5;&#xACA9;&#xC790;&#xAC00; CompressDataTable &#xC18D;&#xC131;&#xC5D0; &#xC545;&#xC131; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xB123;&#xC73C;&#xBA74; Microsoft.PerformancePoint.Scorecards.Client.dll&#xC758; ExcelDataSet&#xC774; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xD654; &#xB418;&#xACE0;, &#xD574;&#xB2F9; &#xCEE8;&#xD2B8;&#xB864;&#xC758; DataTable getter&#xAC00; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xBA74;&#xC11C; &#xC5ED;&#xC9C1;&#xB82C;&#xD654;&#xAC00; &#xD2B8;&#xB9AC;&#xAC70;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="image1.png" srcset="/img/loading.gif" alt="image1.png"></p>
<p><code>BinarySerialization.Deserialize()</code>&#xB294; XML&#xC5D0; &#xC801;&#xD78C; &#xD0C0;&#xC785;&#xB4E4;&#xC774; &#xD5C8;&#xC6A9; &#xBAA9;&#xB85D;&#xC5D0; &#xC788;&#xB294;&#xC9C0; <code>XmlValidator</code>&#xB85C; &#xAC80;&#xC0AC;&#xD574; &#xC5ED;&#xC9C1;&#xB82C;&#xD654;&#xB97C; &#xB9C9;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xACF5;&#xACA9;&#xC790;&#xB294; <code>ExpandedWrapper</code> &#xAC19;&#xC740; &#xC704;&#xD5D8;&#xD55C; &#xD0C0;&#xC785;&#xC744; &#xC9C1;&#xC811; &#xB123;&#xC9C0; &#xC54A;&#xACE0; &#xD5C8;&#xC6A9;&#xB41C; &#xCEEC;&#xB809;&#xC158;(List &#xB4F1;) &#xC548;&#xC5D0; &#xC228;&#xACA8; &#xAC80;&#xC0AC;&#xB97C; &#xC6B0;&#xD68C;&#xD588;&#xACE0;, &#xC5ED;&#xC9C1;&#xB82C;&#xD654;&#xAC00; &#xD1B5;&#xACFC;&#xB418;&#xC5B4; &#xAC00;&#xC82F; &#xCCB4;&#xC778;&#xC774; &#xC2E4;&#xD589;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="CVE-2025-53770"><a href="#CVE-2025-53770" class="headerlink" title="CVE-2025-53770"></a>CVE-2025-53770</h3><p>CVE-2025-53770&#xC740; CVE-2025-49704&#xC758; &#xBCC0;&#xC885;&#xC73C;&#xB85C;, CVE-2025-49704&#xC758; &#xD328;&#xCE58;&#xAC00; &#xC77C;&#xBD80; &#xACBD;&#xB85C;&amp;&#xCEE8;&#xD2B8;&#xB864;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB9CC; &#xD328;&#xCE58;&#xB418;&#xC5C8;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC6B0;&#xD68C;&#xD560; &#xC5EC;&#xC9C0;&#xAC00; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>Microsoft&#xB294; &#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xB300;&#xD55C; &#xD328;&#xCE58;&#xB97C; &#xBC1C;&#xD45C;&#xD558;&#xACE0; XML&#xC758; &#xC694;&#xC18C;&#xB97C; &#xAC80;&#xC99D;&#xD558;&#xB294; XmlValidator&#xB97C; &#xAC15;&#xD654;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;</p>
<p><img src="image2.png" srcset="/img/loading.gif" alt="image2.png"></p>
<p>&#xB300;&#xC751;&#xBC29;&#xC548;</p>
<ul>
<li>Microsoft&#xC758; &#xCD5C;&#xC2E0; &#xBCF4;&#xC548; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xC801;&#xC6A9;</li>
<li>AMSI &#xD65C;&#xC131;&#xD654; &#xBC0F; antivirus &#xC5C5;&#xB370;&#xC774;&#xD2B8;</li>
<li>Machinekey &#xC7AC;&#xC124;&#xC815;</li>
</ul>
<h3 id="CVE-2025-53771"><a href="#CVE-2025-53771" class="headerlink" title="CVE-2025-53771"></a>CVE-2025-53771</h3><p>Sharepoint&#xB294; &#xC6F9; &#xC11C;&#xBC84;(IIS)&#xC640; ASP.NET &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. IIS&#xC640; ASP.NET&#xC5D0;&#xB294; &#xAC01;&#xAC01; &#xC778;&#xC99D; &#xC808;&#xCC28;&#xAC00; &#xC788;&#xACE0;, SharePoint&#xB294; IIS&#xB97C; &#xD1B5;&#xD569;&#xBAA8;&#xB4DC;&#xB85C; &#xC6B4;&#xC601;&#xD558;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; IIS&#xC758; &#xC778;&#xC99D;&#xACFC; ASP.NET &#xC778;&#xC99D;&#xC774; &#xD558;&#xB098;&#xC758; &#xD750;&#xB984;&#xC73C;&#xB85C; &#xD569;&#xCCD0;&#xC838; &#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; PostAuthenticateRequest &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xC778;&#xC99D; &#xACB0;&#xACFC;&#xAC00; &#xC815;&#xB9AC;&#xB429;&#xB2C8;&#xB2E4;. </p>
<p>PostAuthenticateRequestHandler&#xB294; &#xC774; &#xCD5C;&#xC885; &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xD638;&#xCD9C;&#xB418;&#xB294; &#xD568;&#xC218;&#xB85C;, </p>
<p>&#xCD08;&#xAE30; &#xCDE8;&#xC57D;&#xC810; <code>CVE-2025-49706</code>&#xB294; Microsoft.SharePoint.dll&#xC758; PostAuthenticateRequestHandler &#xBA54;&#xC11C;&#xB4DC;&#xC5D0; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p><img src="image3.png" srcset="/img/loading.gif" alt="image3.png"></p>
<p>&#xBB38;&#xC81C;&#xB294; PostAuthenticateRequestHandler&#xAC00; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xC694;&#xCCAD;&#xC758; Referer &#xD5E4;&#xB354;&#xC5D0; &#xB530;&#xB77C; &#xD50C;&#xB798;&#xADF8;&#xB97C; &#xBCC0;&#xACBD;&#xD558;&#xB294; &#xB85C;&#xC9C1;&#xC5D0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xBA54;&#xC11C;&#xB4DC;&#xB294; Referer&#xAC00; &#xB2E4;&#xC74C; &#xC911; &#xD558;&#xB098;&#xC640; &#xC77C;&#xCE58;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. (&#xB300;&#xC18C;&#xBB38;&#xC790; &#xAD6C;&#xBD84; x)</p>
<ul>
<li><code>/_layouts/SignOut.aspx</code></li>
<li><code>/_layouts/14/SignOut.aspx</code></li>
<li><code>/_layouts/15/SignOut.aspx</code></li>
</ul>
<p>&#xC774; &#xC138; URL&#xC740; &#xB85C;&#xADF8;&#xC544;&#xC6C3; &#xD750;&#xB984;&#xACFC; &#xC5F0;&#xAD00;&#xB41C; &#xACBD;&#xB85C;&#xC778;&#xB370;, &#xCF54;&#xB4DC;&#xAC00; &#xC774;&#xB97C; &#xB85C;&#xADF8;&#xC544;&#xC6C3; &#xC694;&#xCCAD;&#xC73C;&#xB85C; &#xC778;&#xC2DD;&#xD558;&#xBA74; &#xB0B4;&#xBD80; &#xD50C;&#xB798;&#xADF8;&#xB97C; <code>flag6 = false</code> &#xBC0F; <code>flag7 = true</code>&#xB85C; &#xC124;&#xC815;&#xD569;&#xB2C8;&#xB2E4;.<br>&#xD558;&#xC9C0;&#xB9CC; &#xD50C;&#xB798;&#xADF8; &#xC870;&#xD569;&#xC774; <code>flag6=false</code>, <code>flag7=true</code> &#xC73C;&#xB85C; &#xB418;&#xBA74;, <code>!flag7</code> &#xBD84;&#xAE30;&#xB97C; &#xAC74;&#xB108;&#xB6F0;&#xACE0;, <code>flag6</code> &#xBD84;&#xAE30;&#xB294; &#xCFE0;&#xD0A4; &#xAE30;&#xBC18;&#xC758; &#xCD94;&#xAC00; &#xAC80;&#xC0AC;&#xB97C; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xAC80;&#xC0AC;&#xC5D0; &#xC2E4;&#xD328;&#xD558;&#xBA74; &#xC778;&#xC99D; &#xAC70;&#xBD80; &#xD638;&#xCD9C;(<code>SendAccessDeniedHeader</code>)&#xC774; &#xB418;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xC778;&#xC99D; &#xAC80;&#xC0AC;&#xB97C; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image4.png" srcset="/img/loading.gif" alt="image4.png"></p>
<p>&#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC694;&#xCCAD;&#xC758; Referer &#xD5E4;&#xB354;&#xB9CC; &#xC704;&#xC870;&#xD558;&#xC5EC; &#xB0B4;&#xBD80; &#xAD00;&#xB9AC; &#xC5D4;&#xB4DC;&#xD3EC;&#xC778;&#xD2B8;&#xC640; &#xAC19;&#xC740; &#xACBD;&#xB85C;&#xC5D0; &#xBE44;&#xC778;&#xC99D; &#xC0C1;&#xD0DC;&#xB85C; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;</p>
<p>Microsoft&#xB294; 2025&#xB144; 7&#xC6D4; 8&#xC77C; &#xD328;&#xCE58;&#xC5D0;&#xC11C; Referrer&#xAC00; &#xB85C;&#xADF8;&#xC544;&#xC6C3; &#xD398;&#xC774;&#xC9C0;&#xC77C; &#xB54C;, &#xC694;&#xCCAD; &#xACBD;&#xB85C;&#xAC00; &#x201C;ToolPane.aspx&#x201D;&#xB85C; &#xB05D;&#xB098;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xB294; &#xAC80;&#xC0AC;&#xB97C; &#xCD94;&#xAC00;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image5.png" srcset="/img/loading.gif" alt="image5.png"></p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xC694;&#xCCAD; url&#xC5D0; /&#xC744; &#xCD94;&#xAC00;&#xD558;&#xBA74; &#xC694;&#xCCAD; &#xACBD;&#xB85C;&#xC758; &#xBB38;&#xC790;&#xC5F4;&#xC774; endsWith(&#x201C;ToolPane.aspx&#x201D;) = false&#xAC00; &#xB418;&#xC5B4;  <code>CVE-2025-49706</code>&#xC758; &#xD328;&#xCE58;&#xB97C; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image6.png" srcset="/img/loading.gif" alt="image6.png"></p>
<p>&#xC774;&#xC5D0; 7&#xC6D4; 20&#xC77C; &#xBCF4;&#xAC15;&#xD328;&#xCE58;&#xB85C; endsWith&#xC5D0;&#xC11C; &#xD654;&#xC774;&#xD2B8;&#xB9AC;&#xC2A4;&#xD2B8; &#xAE30;&#xBC18; &#xD5C8;&#xC6A9; &#xACBD;&#xB85C; &#xAC80;&#xC0AC;&#xB85C; &#xBC14;&#xAFB8;&#xC5B4; &#xD328;&#xCE58;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image7.png" srcset="/img/loading.gif" alt="image7.png"></p>
<h2 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h2><ul>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://socprime.com/ko/blog/latest-threats/detect-cve-2025-53770-exploitation/">https://socprime.com/ko/blog/latest-threats/detect-cve-2025-53770-exploitation/</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.sans.org/blog/critical-sharepoint-zero-day-exploited-what-you-need-to-know-about-cve-2025-53770?utm_source=chatgpt.com">https://www.sans.org/blog/critical-sharepoint-zero-day-exploited-what-you-need-to-know-about-cve-2025-53770</a></p>
</li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/1day1line/">1day1line</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/RCE/">RCE</a>
                  
                  <a class="hover-with-bg" href="/tags/bekim/">bekim</a>
                  
                  <a class="hover-with-bg" href="/tags/CVE-2025-53770/">CVE-2025-53770</a>
                  
                  <a class="hover-with-bg" href="/tags/CVE-2025-53771/">CVE-2025-53771</a>
                  
                  <a class="hover-with-bg" href="/tags/Microsoft/">Microsoft</a>
                  
                  <a class="hover-with-bg" href="/tags/Sharepoint/">Sharepoint</a>
                  
                  <a class="hover-with-bg" href="/tags/Toolshell/">Toolshell</a>
                  
                  <a class="hover-with-bg" href="/tags/bypass/">bypass</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_bekim.jpg" srcset="/img/loading.gif" alt="bekim">
                  </div>

                  <div class="link-text">
                    <div class="link-title">bekim</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/bekim">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/09/22/l0ch/llmxcpg_paper_review/kr/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] “LLMxCPG: Context-Aware Vulnerability Detection Through Code Property Graph-Guided Large Language Models” Paper Review (KR)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/09/17/newp1ayer48/CVE-2025-6752/">
                    <span class="hidden-mobile">[하루한줄] CVE-2025-6752 : Linksys WRT1900ACS, EA7200, EA7450, EA7500의 Stack-based Buffer Overflow로 인한 RCE 취약점</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/09/20/bekim/2025-09-20/';
        this.page.identifier = '/2025/09/20/bekim/2025-09-20/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[하루한줄] CVE-2025-53770(RCE), CVE-2025-53771(Authentication bypass) :Microsoft SharePoint 취약점&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
