

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;&amp;#xBC88;&amp;#xC5ED;-&amp;#xCD94;&amp;#xC2E0;&#34;&gt;&lt;a href=&#34;#&amp;#xBC88;&amp;#xC5ED;-&amp;#xCD94;&amp;#xC2E0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBC88;&amp;#xC5ED; &amp;#xCD94;&amp;#xC2E0;&#34;&gt;&lt;/a&gt;&amp;#xBC88;&amp;#xC5ED; &amp;#xCD94;&amp;#xC2E0;&lt;/h1&gt;&lt;p&gt;WinAFL &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xC4F0;&amp;#xBA74;&amp;#xC11C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xD568;&amp;#xC218; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC880; &amp;#xB354; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC77D;&amp;#xC740; &amp;#xAE00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC38; &amp;#xC560;&amp;#xB9E4;&amp;#xD55C; &amp;#xC8FC;&amp;#xC81C;&amp;#xC778; &amp;#xAC8C; &amp;#xD0C0;&amp;#xAC9F; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xB108;&amp;#xBB34; &amp;#xB9CE;&amp;#xC774;&amp;#xD558;&amp;#xBA74; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xC758;&amp;#xBBF8;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACE0; &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xB108;&amp;#xBB34; &amp;#xC801;&amp;#xAC8C; &amp;#xD558;&amp;#xBA74; Harness &amp;#xC791;&amp;#xC131; &amp;#xBC0F; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xB3CC;&amp;#xB9AC;&amp;#xB294; &amp;#xAC70; &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xBC88;&amp;#xAC70;&amp;#xC6CC;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xC0AC;&amp;#xC774; &amp;#xC5B4;&amp;#xB518;&amp;#xAC00; &amp;#xC801;&amp;#xC815; &amp;#xC120;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD55C;&amp;#xB370; &amp;#xC774; &amp;#xAE00;&amp;#xC774; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB420; &amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAE00;&amp;#xC744; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xC2E4;&amp;#xC2B5;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC7AC;&amp;#xAD6C;&amp;#xC131;&amp;#xD55C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;&amp;#xD560; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC885;&amp;#xAC15; &amp;#xAE30;&amp;#xB150;&amp;#xC73C;&amp;#xB85C; &amp;#xB180;&amp;#xB2E4; &amp;#xC640;&amp;#xC11C; &amp;#xC9C4;&amp;#xB4DD;&amp;#xD558;&amp;#xAC8C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xC4F8; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x314E;&amp;#x314E; &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC77C;&amp;#xB2E8; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC744; &amp;#xC62C;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD604;&amp;#xC7AC; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xC911;&amp;#xC778; WinAFL &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC758; &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00;&amp;#xC740; &amp;#xC774;&amp;#xBC88; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC744; &amp;#xC880; &amp;#xB354; &amp;#xAE4A;&amp;#xAC8C; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xBCF8;&amp;#xAE00; :  &lt;a href=&#34;https://research.checkpoint.com/2018/50-adobe-cves-in-50-days/&#34;&gt;https://research.checkpoint.com/2018/50-adobe-cves-in-50-days/&lt;/a&gt;&lt;/p&gt;
&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;2017&amp;#xB144;&amp;#xC5D0; &amp;#xD070; &amp;#xBCC0;&amp;#xD654;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xD574;&amp;#xC5D0; &amp;#xBCF4;&amp;#xACE0;&amp;#xB41C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC218;&amp;#xB294; &amp;#xC57D; 14,000&amp;#xAC1C;&amp;#xB85C;, &amp;#xC804;&amp;#xB144;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB450; &amp;#xBC30; &amp;#xC774;&amp;#xC0C1; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB9C8; &amp;#xADF8; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xC790;&amp;#xB3D9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD0D0;&amp;#xC0C9; &amp;#xD234;&amp;#xC778; &amp;#x201C;&amp;#xD37C;&amp;#xC800;&amp;#x201D;&amp;#xC758; &amp;#xC778;&amp;#xAE30;&amp;#xAC00; &amp;#xB192;&amp;#xC544;&amp;#xC84C;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC77C; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800; &amp;#xC790;&amp;#xCCB4;&amp;#xB294; 20&amp;#xB144; &amp;#xC774;&amp;#xC0C1; &amp;#xC874;&amp;#xC7AC;&amp;#xD574; &amp;#xC654;&amp;#xACE0; &amp;#xADF8;&amp;#xB9AC; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC740; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC774; &amp;#xBC1C;&amp;#xC804;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB4E4;&amp;#xC740; &amp;#xB354;&amp;#xC6B1; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB09C; &amp;#xAE30;&amp;#xB2A5;&amp;#xACFC; &amp;#xC26C;&amp;#xC6B4; &amp;#xC811;&amp;#xADFC;&amp;#xC131;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB410;&amp;#xC73C;&amp;#xBA70; &amp;#xBB34;&amp;#xC5C7;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC644;&amp;#xC131;&amp;#xB3C4;&amp;#xAC00; &amp;#xB192;&amp;#xC544;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBD88;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0;, &amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#x201C;&amp;#xC5B4;&amp;#xB450;&amp;#xC6B4; &amp;#xC608;&amp;#xC220;&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xD3C9;&amp;#xD310;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9CE;&amp;#xC740; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xAEBC;&amp;#xB824;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC744; &amp;#xACE0;&amp;#xB824;&amp;#xD574; &amp;#xBCFC; &amp;#xB54C;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC9C8;&amp;#xBB38;&amp;#xC744; &amp;#xD574;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x201C;&amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &lt;em&gt;&amp;#xBAA8;&amp;#xB4E0;&lt;/em&gt; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &lt;em&gt;&amp;#xBAA8;&amp;#xB4E0;&lt;/em&gt; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;?&amp;#x201D; &amp;#x201C;FUZZ&amp;#xB77C;&amp;#xACE0; &amp;#xC801;&amp;#xD78C; &amp;#xCEE4;&amp;#xB2E4;&amp;#xB780; &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB204;&amp;#xB974;&amp;#xAE30;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294;, &amp;#xAC70;&amp;#xC800;&amp;#xBA39;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC774; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;?&amp;#x201D;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xB2F5;&amp;#xC744; &amp;#xC54C;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC00;&amp;#xC7A5; &amp;#xD754;&amp;#xD55C; &amp;#xC2E4;&amp;#xD5D8;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC00;&amp;#xC7A5; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; Windows &amp;#xD37C;&amp;#xC9D5; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC778; WinAFL&amp;#xACFC; &amp;#xC138;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC7A5; &amp;#xC778;&amp;#xAE30; &amp;#xC788;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC81C;&amp;#xD488; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC778; Adobe Reader&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0;, &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC744; &amp;#xB9CC;&amp;#xD55C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544; harness&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5; &amp;#xB4F1; &amp;#xC804;&amp;#xCCB4; &amp;#xC791;&amp;#xC5C5;&amp;#xC5D0; 50&amp;#xC77C;&amp;#xC758; &amp;#xAE30;&amp;#xAC04;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xACFC;&amp;#xB294; &amp;#xB9E4;&amp;#xC6B0; &amp;#xCDA9;&amp;#xACA9;&amp;#xC801;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 50&amp;#xC77C; &amp;#xB3D9;&amp;#xC548; Adobe Reader&amp;#xC5D0;&amp;#xC11C; 50&amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD558;&amp;#xB8E8; &amp;#xD3C9;&amp;#xADE0; 1&amp;#xAC1C;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C;, &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC720;&amp;#xD615;&amp;#xC758; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD754;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC18D;&amp;#xB3C4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAE00;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC758; &amp;#xC804;&amp;#xB9D0;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xB4DC;&amp;#xB9AC;&amp;#xB824; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC80;&amp;#xC0C9; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xB113;&amp;#xD788;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBC29;&amp;#xBC95;&amp;#xB860;, WinAFL&amp;#xC744; &amp;#xAC1C;&amp;#xC120;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xADF8; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5BB;&amp;#xC740; &amp;#xC9C0;&amp;#xC2DD;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB824; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;What-is-WinAFL&#34;&gt;&lt;a href=&#34;#What-is-WinAFL&#34; class=&#34;headerlink&#34; title=&#34;What is WinAFL?&#34;&gt;&lt;/a&gt;What is WinAFL?&lt;/h1&gt;&lt;p&gt;AFL&amp;#xC740; coverage guided genetic fuzzer&amp;#xB85C;, &amp;#xC2E4;&amp;#xC81C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xB370; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC601;&amp;#xB9AC;&amp;#xD55C; &amp;#xD734;&amp;#xB9AC;&amp;#xC2A4;&amp;#xD2F1;&amp;#xC744; &amp;#xAC16;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;WinAFL&amp;#xC740; Windows&amp;#xC6A9; AFL&amp;#xB85C; Ivan Fratric(Google Project Zero)&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACE0; &amp;#xAD00;&amp;#xB9AC;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Closed source &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xC5EC;&amp;#xB7EC; instrumentation&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; AFL&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC790;&amp;#xC138;&amp;#xD558;&amp;#xAC8C; &amp;#xC801;&amp;#xD600;&amp;#xC788;&amp;#xB294; AFL &amp;#xAE30;&amp;#xC220; &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xC77D;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xCD94;&amp;#xCC9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xC9C0;&amp;#xC801;&amp;#xD558;&amp;#xACE0; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB3C4;&amp;#xC640;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;WinAFL&amp;#xC740; &amp;#xC555;&amp;#xCD95; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD615;&amp;#xC2DD;(&amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;, &amp;#xBE44;&amp;#xB514;&amp;#xC624;, &amp;#xC544;&amp;#xCE74;&amp;#xC774;&amp;#xBE0C;)&amp;#xC758; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xB9F7; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294;&amp;#xB370; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Attacking-Acrobat-Reader-DC&#34;&gt;&lt;a href=&#34;#Attacking-Acrobat-Reader-DC&#34; class=&#34;headerlink&#34; title=&#34;Attacking Acrobat Reader DC&#34;&gt;&lt;/a&gt;Attacking Acrobat Reader DC&lt;/h1&gt;&lt;p&gt;&amp;#xC6B0;&amp;#xC120; &amp;#xBA54;&amp;#xC778; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; AcroRd32.exe&amp;#xBD80;&amp;#xD130; &amp;#xC2DC;&amp;#xC791;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.  AcroRD32.dll &amp;#xC8FC;&amp;#xBCC0;&amp;#xC758; (&amp;#xC0C1;&amp;#xB300;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;) &amp;#xC587;&amp;#xC740; wrapper&amp;#xC774;&amp;#xBA70; &amp;#xB300;&amp;#xB7B5; 30MB&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. AcroRD32.dll&amp;#xC740; &amp;#xB9CE;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC911; &amp;#xC77C;&amp;#xBD80;&amp;#xB294; PDF &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD30C;&amp;#xC11C;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xACE0; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC740; GUI &amp;#xCF54;&amp;#xB4DC;(&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; GUI &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC120; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xCC3E;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C;)&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;WinAFL&amp;#xC740; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC5D0; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xD2B9;&amp;#xC815; &amp;#xD30C;&amp;#xC11C;&amp;#xB97C; &amp;#xACF5;&amp;#xACA9;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC9D1;&amp;#xC911;&amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xD30C;&amp;#xC11C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xD30C;&amp;#xC11C;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; harness&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Harness&amp;#xB780; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xC7A0;&amp;#xC2DC; &amp;#xD6C4;&amp;#xC5D0; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC804;&amp;#xCCB4; Reader &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;&amp;#xB3C4; &amp;#xB85C;&amp;#xB4DC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC758; &amp;#xD30C;&amp;#xC11C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Acrobat&amp;#xC758; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0;&amp;#xC11C; DLL&amp;#xC744; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC; JP2KLib.dll&amp;#xC774; &amp;#xC774;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC784;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;JP2KLib.dll&amp;#xC740; JPEG2000 &amp;#xD3EC;&amp;#xB9F7;&amp;#xC758; &amp;#xD30C;&amp;#xC11C;&amp;#xB85C; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xC720;&amp;#xC6A9;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; export &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC758; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Acrobat Reader DC &amp;#x2264; 2018.011.238&lt;/p&gt;
&lt;p&gt;JP2KLib.dll 1.2.2.39492&lt;/p&gt;
&lt;h1 id=&#34;What-is-a-Target-Function&#34;&gt;&lt;a href=&#34;#What-is-a-Target-Function&#34; class=&#34;headerlink&#34; title=&#34;What is a Target Function?&#34;&gt;&lt;/a&gt;What is a Target Function?&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://github.com/googleprojectzero/winafl#how-to-select-a-target-function&#34;&gt;&amp;#xD0C0;&amp;#xAC9F;&amp;#xD568;&amp;#xC218;&lt;/a&gt;&amp;#xB294; WinAFL&amp;#xC774; &amp;#xD37C;&amp;#xC9D5; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC5D4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. fuzz_iteration &amp;#xD69F;&amp;#xC218;&amp;#xB9CC;&amp;#xD07C; &amp;#xBC18;&amp;#xBCF5; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xBA70; &amp;#xAC01; &amp;#xC2E4;&amp;#xD589;&amp;#xB9C8;&amp;#xB2E4; input &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xD2B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F; &amp;#xD568;&amp;#xC218;&amp;#xB294;:&lt;/p&gt;
&lt;p&gt;input &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xACE0;, &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC77D;&amp;#xACE0;, &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD30C;&amp;#xC2F1; &amp;#xD55C; &amp;#xD6C4; &amp;#xB2EB;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;C++ exception &amp;#xD639;&amp;#xC740; TermainateProcess&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB9AC;&amp;#xD134;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xCC3E;&amp;#xAE30;&amp;#xB780; &amp;#xC27D;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC77C; &amp;#xB550; &amp;#xB300;&amp;#xAC1C; harness&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;What-is-a-Harness&#34;&gt;&lt;a href=&#34;#What-is-a-Harness&#34; class=&#34;headerlink&#34; title=&#34;What is a Harness?&#34;&gt;&lt;/a&gt;What is a Harness?&lt;/h1&gt;&lt;p&gt;Harness&amp;#xB294; &amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD558;&amp;#xB294; &amp;#xC791;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Harness&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; WinAFL &amp;#xB808;&amp;#xD3EC;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; gdiplus&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C; harness&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;main&amp;#xC758; &amp;#xCCAB; argument&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xB824;&amp;#xB294; API&amp;#xC778; Image::Image parser&amp;#xB97C; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB958; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC885;&amp;#xB8CC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB97C; &amp;#xD574;&amp;#xC81C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xBB38;&amp;#xC11C;&amp;#xD654;&amp;#xB41C; API&amp;#xC5D0;&amp;#xC11C; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xC27D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC0D8;&amp;#xD50C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xB108;&amp;#xBB34; &amp;#xC27D;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;Closed Source &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC778; Adobe Reader&amp;#xB97C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC73C;&amp;#xB85C; &amp;#xC120;&amp;#xD0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC758; Harness &amp;#xC791;&amp;#xC131;&amp;#xBC95;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD37C;&amp;#xC9D5; &amp;#xD560;&amp;#xB9CC;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBD84;&amp;#xC11D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD574;&amp;#xB2F9; API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC798; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; Harness&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBC18;&amp;#xBCF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xC139;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; JP2KLib.dll&amp;#xC744; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD558;&amp;#xACE0; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xD558;&amp;#xB2C8;&amp;#xC2A4;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC04;&amp;#xB7B5;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xB860;&amp;#xC5D0;&amp;#xB9CC; &amp;#xAD00;&amp;#xC2EC;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xB3C5;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C; &amp;#xC139;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xC2DC;&amp;#xAE38; &amp;#xBC14;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Writing-a-Harness-for-JP2KLib-dll&#34;&gt;&lt;a href=&#34;#Writing-a-Harness-for-JP2KLib-dll&#34; class=&#34;headerlink&#34; title=&#34;Writing a Harness for JP2KLib.dll&#34;&gt;&lt;/a&gt;Writing a Harness for JP2KLib.dll&lt;/h1&gt;&lt;p&gt;JP2KLib.dll&amp;#xC758; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0;, &amp;#xBA3C;&amp;#xC800; &amp;#xD574;&amp;#xB2F9; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xAC00; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4;&amp;#xC778;&amp;#xC9C0; &amp;#xD639;&amp;#xC740; public &amp;#xC2EC;&amp;#xBCFC;&amp;#xC744; &amp;#xAC16;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CE;&amp;#xC740; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xC808;&amp;#xC57D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xD754;&amp;#xD55C; &amp;#xC77C;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC800;&amp;#xD76C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC6B4;&amp;#xC774; &amp;#xBCC4;&amp;#xB85C; &amp;#xC88B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; Adobe Reader&amp;#xAC00; JP2KLib&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xACFC; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; Harness&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBA3C;&amp;#xC800; &amp;#xC801;&amp;#xC808;&amp;#xD55C; PDF&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC81C;&amp;#xD488; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC6A9; PDF corpus&amp;#xB97C; &amp;#xB9CE;&amp;#xC774; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC911; JPEG2000&amp;#xC6A9; PDF &amp;#xD544;&amp;#xD130;&amp;#xC778; &amp;#x201C;/JPXdecode&amp;#x201D;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC7A5; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6C;&amp;#xAE00;&amp;#xB9C1; &amp;#xB610;&amp;#xB294; Abrocat Pro/Phantom PDF&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; testcase&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Pro Tip 1: reader&amp;#xC5D0; &amp;#xC0CC;&amp;#xB4DC;&amp;#xBC15;&amp;#xC2A4;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4; debugging/triaging&amp;#xC5D0; &amp;#xC131;&amp;#xAC00;&amp;#xC2E0; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xC808;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://forums.adobe.com/thread/2110951&#34;&gt;https://forums.adobe.com/thread/2110951&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Pro Tip 2: &lt;a href=&#34;https://docs.microsoft.com/en-us/windows-hardware/drivers/debugger/gflags-and-pageheap&#34;&gt;PageHeap&lt;/a&gt;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xD560;&amp;#xB2F9; &amp;#xC704;&amp;#xCE58;&amp;#xC640; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xC6D4;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;PDF wrapper &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; harness&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC0D8;&amp;#xD50C; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; jp2 &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB098;&amp;#xC911;&amp;#xC5D0; harness&amp;#xC758; test input&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xB4E4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xCD5C;&amp;#xC18C; &amp;#xC0D8;&amp;#xD50C;&amp;#xC744; &amp;#xC5BB;&amp;#xC5C8;&amp;#xC73C;&amp;#xB2C8; &amp;#x201C;sxe ld jp2klib&amp;#x201D;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; JP2KLib.dll&amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xC5B4;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xAC00; &amp;#xAC78;&amp;#xB9AC;&amp;#xBA74; JP2KLib&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; export &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xC5B4; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; call stack, &amp;#xC778;&amp;#xC790;, &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC744; &amp;#xAE30;&amp;#xB85D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;bm /a jp2klib!* &amp;#x201C;.&lt;span class=&#34;hljs-built_in&#34;&gt;echo&lt;/span&gt; callstack; k L5; .&lt;span class=&#34;hljs-built_in&#34;&gt;echo&lt;/span&gt; parameters:;  dc esp L8;  .&lt;span class=&#34;hljs-built_in&#34;&gt;echo&lt;/span&gt; &lt;span class=&#34;hljs-built_in&#34;&gt;return&lt;/span&gt; value: ; pt; &amp;#x201D;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC0D8;&amp;#xD50C; PDF&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD574; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; output&amp;#xC744; &amp;#xC5BB;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;JP2KLib&amp;#xAC00; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xD6C4; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB294; JP2KLibInitEx&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. JP2KLibInitEx&amp;#xAC00; &amp;#xBC1B;&amp;#xB294; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;AcrobRd32.dll&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xAC00; &amp;#xB2F4;&amp;#xAE34; 0x20 &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xBC14;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB824;&amp;#xB4E4;&amp;#xBA74; &amp;#xC548;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xD0C0;&amp;#xAC9F; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC4F0;&amp;#xC77C;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xC120; &amp;#x201C;nopX&amp;#x201D;(X&amp;#xB294; &amp;#xC22B;&amp;#xC790;)&amp;#xB77C;&amp;#xB294; &amp;#xC774;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &amp;#xBE48; &amp;#xD568;&amp;#xC218; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB123;&amp;#xC5B4;&amp;#xB193;&amp;#xACE0; Harness&amp;#xC758; &amp;#xBF08;&amp;#xB300;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Command line argument&amp;#xB85C;&amp;#xBD80;&amp;#xD130; input file&amp;#xC744; &amp;#xBC1B;&amp;#xB294;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;JP2KLib.dll&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xB454; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; JP2KLibInitEx&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;LOAD_FUNC&amp;#xB294; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. nopX &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; NOP&amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xD558;&amp;#xACE0; sample.jp2&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC798; &amp;#xC791;&amp;#xB3D9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#x201C;g&amp;#x201D;&amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB2E4;&amp;#xC74C; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB294; JP2KGetMemObjEx&amp;#xC774;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xC778;&amp;#xC790;&amp;#xB3C4; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xB9CC; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB2E4;&amp;#xC74C; &amp;#xD568;&amp;#xC218;&amp;#xC778; JP2KDecOptCreat &amp;#xB610;&amp;#xD55C; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xB9CC; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. JP2KDecOptCreat &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; nop4&amp;#xC640; nop7 &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294;&amp;#xAD70;&amp;#xC694;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xAC01;&amp;#xAC01; &amp;#xAD6C;&amp;#xD604;&amp;#xC744; &amp;#xD574;&amp;#xC918;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; nop4&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. nop4&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xD568;&amp;#xC218; AcroRd32!CTJPEGDecoderRelease+0xa992 &amp;#xC5D0; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xC5B4;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xACC4;&amp;#xC18D; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB2E4;&amp;#xBCF4;&amp;#xBA74;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xACF3;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC989;, nop4&amp;#xB294; malloc&amp;#xC758; wrapper&amp;#xD568;&amp;#xC218;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; &amp;#xAD6C;&amp;#xD604;&amp;#xD55C; &amp;#xB4A4; nop4&amp;#xC640; &amp;#xBC14;&amp;#xAFD4;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. nop7(memset), nop5(free), nop6(memcpy)&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB3C4; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB2E4;&amp;#xC74C; &amp;#xD568;&amp;#xC218;&amp;#xC778; JP2KDecOptInitToDefaults &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC; harness&amp;#xC758; &amp;#xBAA8;&amp;#xC2B5;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD568;&amp;#xC218;&amp;#xC778; JP2KImageInitDecoderEx&amp;#xB294; 5&amp;#xAC1C;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;5&amp;#xAC1C;&amp;#xC758; &amp;#xC778;&amp;#xC790; &amp;#xC911; 3&amp;#xAC1C;&amp;#xB294; JP2KImageCreate, JP2KDecOptCreate, JP2KGetMemObjEx&amp;#xC758; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC138; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xB294; vtable&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xD2B8;&amp;#xB9AD;&amp;#xC744; &amp;#xB611;&amp;#xAC19;&amp;#xC774; &amp;#xBC18;&amp;#xBCF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. nop&amp;#xC744; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD568;&amp;#xC218; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC0C1;&amp;#xC218;&amp;#xAC12; 0xbaaddaab&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC; harness&amp;#xC758; &amp;#xBAA8;&amp;#xC2B5;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;harness&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; nop10&amp;#xC73C;&amp;#xB85C; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. nop10&amp;#xC758; &amp;#xC2E4;&amp;#xC81C; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; call stack&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;JP2KCodeStm::IsSeekable&amp;#xB97C; IDA&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;JP2KCodeStm&amp;#xC758; 0x24 &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC5D0; &amp;#xC774;&amp;#xC804; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0; &amp;#xB123;&amp;#xC5B4;&amp;#xC900; vtable&amp;#xC774;, 0x18 &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC5D0; 0xbaaddaab &amp;#xC0C1;&amp;#xC218;&amp;#xAC12;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; Windbg&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. JP2KCodeStm::IsSeekable&amp;#xC740; 0xbaaddaab&amp;#xB97C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; vtable&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC01; &amp;#xD30C;&amp;#xC11C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB2E4;&amp;#xB974;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC775;&amp;#xC219;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;(FILE/ifstream)&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; input stream&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xC885;&amp;#xC758; input stream(network/file/memory) &amp;#xCD94;&amp;#xC0C1;&amp;#xD654;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xB294; JP2KCodeStm&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBCF4;&amp;#xACE0; &amp;#xBC14;&amp;#xB85C; &amp;#xC54C;&amp;#xC544;&amp;#xCC28;&amp;#xB838;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;0xbaaddaab&amp;#xB294; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC774;&amp;#xACE0; vtable&amp;#xC740; &amp;#xADF8; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. IDA&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00; JP2KCodeStm::XXX &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xD30C;&amp;#xC77C; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/17.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB958;&amp;#xAC00; &amp;#xB098;&amp;#xBA74; &amp;#xBC84;&amp;#xB9AC;&amp;#xACE0; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;&amp;#xBA74; JP2KImageInitDecoderEx&amp;#xC758; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC744; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. JP2KImageInitDecoderEx&amp;#xC740; &amp;#xC131;&amp;#xACF5; &amp;#xC2DC; 0&amp;#xC744; &amp;#xB9AC;&amp;#xD134;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xBA87; &amp;#xBC88;&amp;#xC758; &amp;#xC2DC;&amp;#xD589;&amp;#xCC29;&amp;#xC624;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC6D0;&amp;#xD558;&amp;#xB358; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC744; &amp;#xC5BB;&amp;#xB294; &amp;#xB370; &amp;#xC131;&amp;#xACF5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD568;&amp;#xC218;&amp;#xC778; JP2KImageDataCreate&amp;#xB294; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA70; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC744; &amp;#xADF8;&amp;#xB2E4;&amp;#xC74C; &amp;#xD568;&amp;#xC218;&amp;#xC778; JP2KImageGetMaxRes&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC740; 7&amp;#xAC1C;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBC1B;&amp;#xB294; JP2KImageDecodeTileInterleaved &amp;#xD568;&amp;#xC218;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. 7&amp;#xAC1C;&amp;#xC758; &amp;#xC778;&amp;#xC790; &amp;#xC911; 3&amp;#xAC1C;&amp;#xB294; JP2KImageCreate, JP2KImageGetMaxRes, JP2KImageDataCreate&amp;#xC758; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;IDA&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF8; &amp;#xACB0;&amp;#xACFC; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; 6&amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xB294; NULL&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB124; &amp;#xBC88;&amp;#xC9F8;, &amp;#xB2E4;&amp;#xC12F; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xB294; color depth&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC774; &amp;#xB450; &amp;#xAC12;&amp;#xC774; &amp;#xACE0;&amp;#xC815;&amp;#xB41C; &amp;#xCCB4;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/18.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; JP2KImageDataDestroy, JP2KImageDestroy, JP2KDecOptDestroy &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD574; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E0; &amp;#xC624;&amp;#xD504;&amp;#xC81D;&amp;#xD2B8;&amp;#xB4E4;&amp;#xC744; &amp;#xD574;&amp;#xC81C;&amp;#xD574; memory leak&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC791;&amp;#xC5C5;&amp;#xC740; WinAFL&amp;#xB85C; fuzz_iterations&amp;#xAC00; &amp;#xB192;&amp;#xC740; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xD560; &amp;#xB54C; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC790; &amp;#xC774;&amp;#xC81C; &amp;#xC798; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; Harness&amp;#xB97C; &amp;#xC644;&amp;#xC131;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC18C;&amp;#xD55C; &amp;#xC218;&amp;#xC815;&amp;#xC744; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. JP2KLib&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBC1B;&amp;#xC544;&amp;#xC624;&amp;#xB294; &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xBD84;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9E4; &amp;#xC2E4;&amp;#xD589;&amp;#xB9C8;&amp;#xB2E4; &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD574; &amp;#xC904; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xB97C; &amp;#xBD84;&amp;#xB9AC;&amp;#xD574;&amp;#xC90C;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xD5A5;&amp;#xC0C1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; fuzzme&amp;#xB77C;&amp;#xB294; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xC9C0;&amp;#xC5B4;&amp;#xC8FC;&amp;#xACE0; export &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xBCF4;&amp;#xB2E4; export &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xD6E8;&amp;#xC52C; &amp;#xC27D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Fuzzing-Methodology&#34;&gt;&lt;a href=&#34;#Fuzzing-Methodology&#34; class=&#34;headerlink&#34; title=&#34;Fuzzing Methodology&#34;&gt;&lt;/a&gt;Fuzzing Methodology&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;Basic tests for the harness&lt;ol&gt;
&lt;li&gt;Stability&lt;/li&gt;
&lt;li&gt;Paths&lt;/li&gt;
&lt;li&gt;Timeouts&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;Fuzzing Setup&lt;/li&gt;
&lt;li&gt;Initial corpus&lt;/li&gt;
&lt;li&gt;Initial line coverage&lt;/li&gt;
&lt;li&gt;Fuzzing loop&lt;ol&gt;
&lt;li&gt;Fuzz&lt;/li&gt;
&lt;li&gt;Check coverage / crashes&lt;/li&gt;
&lt;li&gt;cmin &amp;amp; repeat&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;Triage&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Basic-Tests-for-the-Harness&#34;&gt;&lt;a href=&#34;#Basic-Tests-for-the-Harness&#34; class=&#34;headerlink&#34; title=&#34;Basic Tests for the Harness&#34;&gt;&lt;/a&gt;Basic Tests for the Harness&lt;/h1&gt;&lt;p&gt;&amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xAE30; &amp;#xC55E;&amp;#xC11C; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; sanity test&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC800; &amp;#xC11C;&amp;#xBC84;&amp;#xC2E4; &amp;#xC628;&amp;#xB3C4;&amp;#xB9CC; &amp;#xB192;&amp;#xC774;&amp;#xB294; &amp;#xC77C;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8;. &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xC740; &amp;#xD37C;&amp;#xC800;&amp;#xAC00; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC2E4;&amp;#xD589; path&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xB294;&amp;#xAC00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, total path count&amp;#xAC00; &amp;#xAFB8;&amp;#xC900;&amp;#xD788; &amp;#xC0C1;&amp;#xC2B9;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; path count&amp;#xAC00; 0&amp;#xC774;&amp;#xAC70;&amp;#xB098; &amp;#xAC70;&amp;#xC758; 0&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD568;&amp;#xC815;&amp;#xB4E4;&amp;#xC744; &amp;#xC870;&amp;#xC0AC;&amp;#xD574;&amp;#xBD10;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xD0C0;&amp;#xAC9F;&amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC778;&amp;#xB77C;&amp;#xC778; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xC5B4; WinAFL&amp;#xC774; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC778;&amp;#xC790; &amp;#xAC1C;&amp;#xC218;&amp;#xB098; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xADDC;&amp;#xC57D;&amp;#xC774; &amp;#xC798;&amp;#xBABB;&amp;#xB410;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD0C0;&amp;#xC784;&amp;#xC544;&amp;#xC6C3;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xB0AE;&amp;#xC544; harness&amp;#xAC00; &amp;#xB108;&amp;#xBB34; &amp;#xC77C;&amp;#xCC0D; &amp;#xC885;&amp;#xB8CC;&amp;#xB41C;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xBA87; &amp;#xBD84; &amp;#xC815;&amp;#xB3C4; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C; &amp;#xB4A4; &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC774; &amp;#xB0AE;&amp;#xC544;(80% &amp;#xBBF8;&amp;#xB9CC;) &amp;#xC774;&amp;#xC288;&amp;#xB97C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Harness&amp;#xC758; &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC740; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC131;&amp;#xB2A5;&amp;#xACFC; &amp;#xC9C1;&amp;#xACB0;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD754;&amp;#xD788; &amp;#xBE60;&amp;#xC9C0;&amp;#xB294; &amp;#xD568;&amp;#xC815;&amp;#xB4E4;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB09C;&amp;#xC218; element&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD10;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xBA87;&amp;#xBA87; hash table&amp;#xB4E4;&amp;#xC740; collision&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB09C;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; coverage&amp;#xC758; &amp;#xC815;&amp;#xD655;&amp;#xB3C4;&amp;#xB97C; &amp;#xB5A8;&amp;#xC5B4;&amp;#xB728;&amp;#xB9AC;&amp;#xB294; &amp;#xC791;&amp;#xC5C5;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xB09C;&amp;#xC218;&amp;#xC758; seed&amp;#xB97C; &amp;#xC0C1;&amp;#xC218;&amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xACE0;&amp;#xC815;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xBA87;&amp;#xBA87; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; global object&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; cach&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. nop run&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Windows 10 64-bit &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB294; 32-bit &amp;#xD0C0;&amp;#xAC9F;&amp;#xC758; stack alignment&amp;#xB294; &amp;#xD56D;&amp;#xC0C1; 8&amp;#xC774; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; memcpy&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xB2E4;&amp;#xB978; AVX &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xCF54;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xBA70; coverage &amp;#xB610;&amp;#xD55C; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. harness&amp;#xC5D0; stack aligne&amp;#xC744; &amp;#xB9DE;&amp;#xCD94;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xACB0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xC704; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &amp;#xC2E4;&amp;#xD328;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; DynamoRIO&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; harness&amp;#xC758; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC744; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xACE0; output&amp;#xC744; &amp;#xBE44;&amp;#xAD50;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Fuzzing-Setup&#34;&gt;&lt;a href=&#34;#Fuzzing-Setup&#34; class=&#34;headerlink&#34; title=&#34;Fuzzing Setup&#34;&gt;&lt;/a&gt;Fuzzing Setup&lt;/h1&gt;&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xACFC; &amp;#xAC19;&amp;#xC740; VM&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;8~16 core, 32 GB of RAM, Windows 10 x64&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &lt;a href=&#34;https://sourceforge.net/projects/imdisk-toolkit/&#34;&gt;ImDisk toolkit&lt;/a&gt;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; RAM disk drive&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE60;&amp;#xB978; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0; test case&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBCD1;&amp;#xBAA9; &amp;#xD604;&amp;#xC0C1;&amp;#xC744; &amp;#xC720;&amp;#xBC1C;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows Defender &amp;#xB610;&amp;#xD55C; &amp;#xC131;&amp;#xB2A5;&amp;#xC5D0; &amp;#xC545;&amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xB07C;&amp;#xCE58;&amp;#xB2C8; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. WinAFL&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; test case&amp;#xB4E4; &amp;#xC911; Windows Defender&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; exploit&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/19.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Windows Indexing Service&amp;#xB3C4; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC9D5; &amp;#xB3C4;&amp;#xC911; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xC7AC;&amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xB358; dll&amp;#xC744; &amp;#xB300;&amp;#xCCB4;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; Windows Update&amp;#xB3C4; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBC84;&amp;#xADF8; &amp;#xD0D0;&amp;#xC0C9;&amp;#xC5D0; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xBBC0;&amp;#xB85C; harness &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; page heap&amp;#xC740; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC18D;&amp;#xB3C4;&amp;#xB294; &amp;#xB290;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBC84;&amp;#xADF8; &amp;#xD0D0;&amp;#xC0C9;&amp;#xC5D0; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC774;&amp;#xB77C;&amp;#xB294; edge coverage type&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;afl-fuzz.exe -i R:\\jp2k\\&lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; -o R:\\jp2k\\out -t 20000+ -D c:\\DynamoRIO-Windows-7.0.0-RC1\\bin32 -S Slav02 &amp;#x2014; -fuzz_iterations 10000 -coverage_module JP2KLib.dll -target_module adobe_jp2k.exe -target_method fuzzme -nargs 1 -covtype edge &amp;#x2014; adobe_jp2k.exe @@&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;Initial-Corpus&#34;&gt;&lt;a href=&#34;#Initial-Corpus&#34; class=&#34;headerlink&#34; title=&#34;Initial Corpus&#34;&gt;&lt;/a&gt;Initial Corpus&lt;/h1&gt;&lt;p&gt;Harness&amp;#xB97C; &amp;#xC644;&amp;#xC131;&amp;#xD588;&amp;#xB2E4;&amp;#xBA74; &amp;#xC544;&amp;#xB798; &amp;#xBC29;&amp;#xBC95;&amp;#xB4E4;&amp;#xB85C; &amp;#xCD08;&amp;#xAE30; corpus&amp;#xB97C; &amp;#xD655;&amp;#xBCF4;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Online corpuses ( &lt;a href=&#34;https://lcamtuf.coredump.cx/afl/demo/&#34;&gt;afl corpus&lt;/a&gt;, &lt;a href=&#34;https://github.com/uclouvain/openjpeg-data&#34;&gt;openjpeg-data&lt;/a&gt; )&lt;/li&gt;
&lt;li&gt;Test suites from open source projects&lt;/li&gt;
&lt;li&gt;Crawlling google / duckduckgo&lt;/li&gt;
&lt;li&gt;Corpuses from our older fuzzing projects&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Corpus-Minimization&#34;&gt;&lt;a href=&#34;#Corpus-Minimization&#34; class=&#34;headerlink&#34; title=&#34;Corpus Minimization&#34;&gt;&lt;/a&gt;Corpus Minimization&lt;/h1&gt;&lt;p&gt;&amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; coverage&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xC6A9;&amp;#xB7C9;&amp;#xC774; &amp;#xD070; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC131;&amp;#xB2A5;&amp;#xC774; &amp;#xC800;&amp;#xD558;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. AFL&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; afl-cmin&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; corpus&amp;#xB97C; &amp;#xAC04;&amp;#xC18C;&amp;#xD654; &amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. WinAFL&amp;#xC740; winafl-cmin.py&amp;#xB77C;&amp;#xB294; &amp;#xD234;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD655;&amp;#xBCF4;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; winafl-cmin.py&amp;#xC5D0; &amp;#xB123;&amp;#xACE0; &amp;#xAC04;&amp;#xC18C;&amp;#xD654;&amp;#xB41C; corpus&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC19;&amp;#xC740; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; winafl-cmin&amp;#xC744; &amp;#xB450; &amp;#xBC88; &amp;#xB3CC;&amp;#xB824;&amp;#xBCF4;&amp;#xACE0; &amp;#xAC19;&amp;#xC740; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xB098;&amp;#xC624;&amp;#xB294;&amp;#xC9C0; &amp;#xBE44;&amp;#xAD50;&amp;#xD574;&amp;#xBD10;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xB450; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xB2E4;&amp;#xB974;&amp;#xB2E4;&amp;#xBA74; harness&amp;#xAC00; &amp;#xBE44;&amp;#xACB0;&amp;#xC815;&amp;#xB860; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC548;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Initial-Line-Coverage&#34;&gt;&lt;a href=&#34;#Initial-Line-Coverage&#34; class=&#34;headerlink&#34; title=&#34;Initial Line Coverage&#34;&gt;&lt;/a&gt;Initial Line Coverage&lt;/h1&gt;&lt;p&gt;Corpus&amp;#xB97C; &amp;#xC5BB;&amp;#xC5C8;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xC820; line coverage&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC; &amp;#xCC28;&amp;#xB840;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Line coverage&amp;#xB780; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB9AC; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. DynamoRIO&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; line coverage&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;[dynamoriodir]\\bin32\\drrun.exe -t drcov &amp;#x2014; harness.exe testcase&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xAC01; test case&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC704; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xACB0;&amp;#xACFC;&amp;#xAC12;&amp;#xC744; IDA &lt;a href=&#34;https://github.com/gaasedelen/lighthouse&#34;&gt;Lighthouse&lt;/a&gt;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/20.png&#34; alt&gt;&amp;#xB294;&amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Fuzzing-Cycle&#34;&gt;&lt;a href=&#34;#Fuzzing-Cycle&#34; class=&#34;headerlink&#34; title=&#34;Fuzzing Cycle&#34;&gt;&lt;/a&gt;Fuzzing Cycle&lt;/h1&gt;&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xB2E8;&amp;#xACC4;&amp;#xB294; &amp;#xB9E4;&amp;#xC6B0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Coverage&amp;#xC640; Crash &amp;#xBD84;&amp;#xC11D;&lt;/li&gt;
&lt;li&gt;Coverage &amp;#xC870;&amp;#xC0AC;, cmin &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBC18;&amp;#xBCF5;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xB3CC;&amp;#xB9AC;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xD2B9;&amp;#xBCC4;&amp;#xD788; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xC77C;&amp;#xC774; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xAD6C;&amp;#xC131;&amp;#xB300;&amp;#xB85C; &amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xAE30;&amp;#xB2A5;&amp;#xC758; &amp;#xBD07;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;(&lt;a href=&#34;http://winafl-whatsapp.py&#34;&gt;winafl-whatsapp.py&lt;/a&gt;)&lt;/li&gt;
&lt;li&gt;&amp;#xAC01; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC2DC;&amp;#xAC04;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; path &amp;#xBCC0;&amp;#xD654; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&lt;/li&gt;
&lt;li&gt;Crash triage (&amp;#xB2E4;&amp;#xC74C; &amp;#xC139;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8F8;)&lt;/li&gt;
&lt;li&gt;&amp;#xBA48;&amp;#xCD98; &amp;#xD37C;&amp;#xC800; &amp;#xC7AC;&amp;#xC2DC;&amp;#xC791;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC791;&amp;#xC5C5;&amp;#xB4E4;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xC911;&amp;#xC694;&amp;#xD55C;&amp;#xC9C0; &amp;#xAD73;&amp;#xC774; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xB294; &amp;#xC5C6;&amp;#xACA0;&amp;#xC8E0;? &amp;#xD37C;&amp;#xC9D5;&amp;#xC740; &amp;#xC9C0;&amp;#xB8E8;&amp;#xD558;&amp;#xACE0; &amp;#xC624;&amp;#xB958;&amp;#xAC00; &amp;#xB118;&amp;#xCE58;&amp;#xB294; &amp;#xC791;&amp;#xC5C5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC640; path&amp;#xB97C; &amp;#xBA87; &amp;#xC2DC;&amp;#xAC04; &amp;#xC8FC;&amp;#xAE30;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&amp;#xC5D0; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC138;&amp;#xAC00; &amp;#xBCF4;&amp;#xC778;&amp;#xB2E4;&amp;#xBA74; coverage&amp;#xB97C; &amp;#xC870;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/21.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; queue&amp;#xB97C; &amp;#xBAA8;&amp;#xC544; cmin&amp;#xC744; &amp;#xAC70;&amp;#xCE58;&amp;#xACE0; &amp;#xADF8; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; IDA&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C1;&amp;#xB300;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; coverage&amp;#xAC00; &amp;#xC791;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xD070; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB824; &amp;#xB178;&amp;#xB825;&amp;#xD558;&amp;#xACE0; &amp;#xAC01; &amp;#xC0D8;&amp;#xD50C;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xB2E8;&amp;#xACC4;&amp;#xB294; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xC0D8;&amp;#xD50C;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xBA87; &amp;#xC2DC;&amp;#xAC04;&amp;#xC758; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; 3&amp;#xAC1C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Coverage&amp;#xAC00; &amp;#xB354; &amp;#xC774;&amp;#xC0C1; &amp;#xB298;&amp;#xC5B4;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC774; &amp;#xC0AC;&amp;#xC774;&amp;#xD074;&amp;#xC744; &amp;#xBC18;&amp;#xBCF5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Coverage&amp;#xAC00; &amp;#xB298;&amp;#xC5B4;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC740; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xAC70;&amp;#xB098; harness&amp;#xB97C; &amp;#xAC1C;&amp;#xC120;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Triage&#34;&gt;&lt;a href=&#34;#Triage&#34; class=&#34;headerlink&#34; title=&#34;Triage&#34;&gt;&lt;/a&gt;Triage&lt;/h1&gt;&lt;p&gt;Crash&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; test case&amp;#xB97C; &amp;#xC5BB;&amp;#xC73C;&amp;#xBA74; &amp;#xC9C1;&amp;#xC811; crash&amp;#xC640; &amp;#xADF8; &amp;#xC785;&amp;#xB825;&amp;#xAC12;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC911;&amp;#xBCF5;&amp;#xB41C; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xB9CE;&amp;#xC544; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC804;&amp;#xB7B5;&amp;#xC744; &amp;#xBC14;&amp;#xAFE8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;a href=&#34;https://github.com/SkyLined/BugId&#34;&gt;Bugld&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC911;&amp;#xBCF5;&amp;#xB41C; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC0DD;&amp;#xB7B5;&amp;#xD558;&amp;#xACE0; unique crash&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; minimize &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/22.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;What-We-Found&#34;&gt;&lt;a href=&#34;#What-We-Found&#34; class=&#34;headerlink&#34; title=&#34;What We Found&#34;&gt;&lt;/a&gt;What We Found&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xC804;&amp;#xB7B5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Adobe Reader&amp;#xC640; Adobe Pro&amp;#xC5D0;&amp;#xC11C; 53&amp;#xAC1C;&amp;#xC758; critical &amp;#xD55C; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xD30C;&amp;#xC11C; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xB514;&amp;#xCF54;&amp;#xB354; &amp;#xB4F1;&amp;#xC5D0; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC801;&amp;#xC6A9;&amp;#xD574;&amp;#xBD24;&amp;#xACE0; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; CVE&amp;#xB4E4;&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;CVE-2018-4985, CVE-2018-5063, CVE-2018-5064, CVE-2018-5065, CVE-2018-5068, CVE-2018-5069, CVE-2018-5070, CVE-2018-12754, CVE-2018-12755, CVE-2018-12764, CVE-2018-12765, CVE-2018-12766, CVE-2018-12767, CVE-2018-12768, CVE-2018-12848, CVE-2018-12849, CVE-2018-12850, CVE-2018-12840, CVE-2018-15956, CVE-2018-15955, CVE-2018-15954,CVE-2018-15953, CVE-2018-15952, CVE-2018-15938, CVE-2018-15937, CVE-2018-15936, CVE-2018-15935, CVE-2018-15934, CVE-2018-15933, CVE-2018-15932 , CVE-2018-15931, CVE-2018-15930 , CVE-2018-15929, CVE-2018-15928, CVE-2018-15927, CVE-2018-12875, CVE-2018-12874 , CVE-2018-12873, CVE-2018-12872,CVE-2018-12871, CVE-2018-12870, CVE-2018-12869, CVE-2018-12867 , CVE-2018-12866, CVE-2018-12865 , CVE-2018-12864 , CVE-2018-12863, CVE-2018-12862, CVE-2018-12861, CVE-2018-12860, CVE-2018-12859, CVE-2018-12857, CVE-2018-12839, CVE-2018-8464&lt;/p&gt;
&lt;p&gt;jp2k&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB294; &lt;a href=&#34;https://www.welivesecurity.com/2018/05/15/tale-two-zero-days/&#34;&gt;&amp;#xC2E4;&amp;#xC81C; &amp;#xACF5;&amp;#xACA9;&lt;/a&gt;&amp;#xC5D0; &amp;#xC545;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5B4; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xACE0; &amp;#xC5BC;&amp;#xB9C8; &amp;#xC9C0;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; Adobe&amp;#xC5D0; &amp;#xC81C;&amp;#xBCF4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBB3C;&amp;#xB860; Adobe Reader&amp;#xC758; &amp;#xC0CC;&amp;#xB4DC;&amp;#xBC15;&amp;#xC2A4;&amp;#xC640; Reader Protected Mode&amp;#xB294; exploit&amp;#xC758; &amp;#xBCF5;&amp;#xC7A1;&amp;#xB3C4;&amp;#xB97C; &amp;#xD06C;&amp;#xAC8C; &amp;#xC99D;&amp;#xAC00;&amp;#xC2DC;&amp;#xCF30;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9; &amp;#xC0AC;&amp;#xB840;&amp;#xCC98;&amp;#xB7FC; &amp;#xC0CC;&amp;#xB4DC; &amp;#xBC15;&amp;#xC2A4;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCE58;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC120; &amp;#xB610; &amp;#xB2E4;&amp;#xB978; PE exploit&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; WinAFL&amp;#xC744; &amp;#xC0AC;&amp;#xB791;&amp;#xD558;&amp;#xACE0; &amp;#xB354; &amp;#xB9CE;&amp;#xC774; &amp;#xC4F0;&amp;#xC774;&amp;#xAE38; &amp;#xBC14;&amp;#xB77C;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;WinAFL&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBC84;&amp;#xADF8;&amp;#xB098; &amp;#xAE30;&amp;#xB2A5; &amp;#xB204;&amp;#xB77D; &amp;#xB4F1;&amp;#xC744; &amp;#xC790;&amp;#xC8FC; &amp;#xB9C8;&amp;#xC8FC;&amp;#xCCE4;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Windows 10 Appifier&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC9C0;&amp;#xC6D0; &amp;#xCD94;&amp;#xAC00;, CPU &amp;#xC120;&amp;#xD638;&amp;#xB3C4;, &amp;#xBC84;&amp;#xADF8; &amp;#xC218;&amp;#xC815; &amp;#xBC0F; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; GUI &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xC5C5;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C; &amp;#xCEE4;&amp;#xBC0B; &amp;#xB9C1;&amp;#xD06C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Netanel&amp;#x2019;s commits &amp;#x2013; &lt;a href=&#34;https://github.com/googleprojectzero/winafl/commits?author=netanel01&#34;&gt;https://github.com/googleprojectzero/winafl/commits?author=netanel01&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Yoava&amp;#x2019;s commits &amp;#x2013; &lt;a href=&#34;https://github.com/googleprojectzero/winafl/commits?author=yoava333&#34;&gt;https://github.com/googleprojectzero/winafl/commits?author=yoava333&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Translation] 50 CVEs in 50 Days: Fuzzing Adobe Reader - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;&amp;#xBC88;&amp;#xC5ED;-&amp;#xCD94;&amp;#xC2E0;&#34;&gt;&lt;a href=&#34;#&amp;#xBC88;&amp;#xC5ED;-&amp;#xCD94;&amp;#xC2E0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBC88;&amp;#xC5ED; &amp;#xCD94;&amp;#xC2E0;&#34;&gt;&lt;/a&gt;&amp;#xBC88;&amp;#xC5ED; &amp;#xCD94;&amp;#xC2E0;&lt;/h1&gt;&lt;p&gt;WinAFL &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xC4F0;&amp;#xBA74;&amp;#xC11C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xD568;&amp;#xC218; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC880; &amp;#xB354; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC77D;&amp;#xC740; &amp;#xAE00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC38; &amp;#xC560;&amp;#xB9E4;&amp;#xD55C; &amp;#xC8FC;&amp;#xC81C;&amp;#xC778; &amp;#xAC8C; &amp;#xD0C0;&amp;#xAC9F; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xB108;&amp;#xBB34; &amp;#xB9CE;&amp;#xC774;&amp;#xD558;&amp;#xBA74; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xC758;&amp;#xBBF8;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACE0; &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xB108;&amp;#xBB34; &amp;#xC801;&amp;#xAC8C; &amp;#xD558;&amp;#xBA74; Harness &amp;#xC791;&amp;#xC131; &amp;#xBC0F; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xB3CC;&amp;#xB9AC;&amp;#xB294; &amp;#xAC70; &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xBC88;&amp;#xAC70;&amp;#xC6CC;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xC0AC;&amp;#xC774; &amp;#xC5B4;&amp;#xB518;&amp;#xAC00; &amp;#xC801;&amp;#xC815; &amp;#xC120;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD55C;&amp;#xB370; &amp;#xC774; &amp;#xAE00;&amp;#xC774; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB420; &amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAE00;&amp;#xC744; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xC2E4;&amp;#xC2B5;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC7AC;&amp;#xAD6C;&amp;#xC131;&amp;#xD55C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;&amp;#xD560; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC885;&amp;#xAC15; &amp;#xAE30;&amp;#xB150;&amp;#xC73C;&amp;#xB85C; &amp;#xB180;&amp;#xB2E4; &amp;#xC640;&amp;#xC11C; &amp;#xC9C4;&amp;#xB4DD;&amp;#xD558;&amp;#xAC8C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xC4F8; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x314E;&amp;#x314E; &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC77C;&amp;#xB2E8; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC744; &amp;#xC62C;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD604;&amp;#xC7AC; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xC911;&amp;#xC778; WinAFL &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC758; &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00;&amp;#xC740; &amp;#xC774;&amp;#xBC88; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC744; &amp;#xC880; &amp;#xB354; &amp;#xAE4A;&amp;#xAC8C; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xBCF8;&amp;#xAE00; :  &lt;a href=&#34;https://research.checkpoint.com/2018/50-adobe-cves-in-50-days/&#34;&gt;https://research.checkpoint.com/2018/50-adobe-cves-in-50-days/&lt;/a&gt;&lt;/p&gt;
&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;2017&amp;#xB144;&amp;#xC5D0; &amp;#xD070; &amp;#xBCC0;&amp;#xD654;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xD574;&amp;#xC5D0; &amp;#xBCF4;&amp;#xACE0;&amp;#xB41C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC218;&amp;#xB294; &amp;#xC57D; 14,000&amp;#xAC1C;&amp;#xB85C;, &amp;#xC804;&amp;#xB144;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB450; &amp;#xBC30; &amp;#xC774;&amp;#xC0C1; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB9C8; &amp;#xADF8; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xC790;&amp;#xB3D9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD0D0;&amp;#xC0C9; &amp;#xD234;&amp;#xC778; &amp;#x201C;&amp;#xD37C;&amp;#xC800;&amp;#x201D;&amp;#xC758; &amp;#xC778;&amp;#xAE30;&amp;#xAC00; &amp;#xB192;&amp;#xC544;&amp;#xC84C;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC77C; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800; &amp;#xC790;&amp;#xCCB4;&amp;#xB294; 20&amp;#xB144; &amp;#xC774;&amp;#xC0C1; &amp;#xC874;&amp;#xC7AC;&amp;#xD574; &amp;#xC654;&amp;#xACE0; &amp;#xADF8;&amp;#xB9AC; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC740; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC774; &amp;#xBC1C;&amp;#xC804;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB4E4;&amp;#xC740; &amp;#xB354;&amp;#xC6B1; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB09C; &amp;#xAE30;&amp;#xB2A5;&amp;#xACFC; &amp;#xC26C;&amp;#xC6B4; &amp;#xC811;&amp;#xADFC;&amp;#xC131;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB410;&amp;#xC73C;&amp;#xBA70; &amp;#xBB34;&amp;#xC5C7;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC644;&amp;#xC131;&amp;#xB3C4;&amp;#xAC00; &amp;#xB192;&amp;#xC544;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBD88;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0;, &amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#x201C;&amp;#xC5B4;&amp;#xB450;&amp;#xC6B4; &amp;#xC608;&amp;#xC220;&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xD3C9;&amp;#xD310;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9CE;&amp;#xC740; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xAEBC;&amp;#xB824;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC744; &amp;#xACE0;&amp;#xB824;&amp;#xD574; &amp;#xBCFC; &amp;#xB54C;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC9C8;&amp;#xBB38;&amp;#xC744; &amp;#xD574;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x201C;&amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &lt;em&gt;&amp;#xBAA8;&amp;#xB4E0;&lt;/em&gt; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &lt;em&gt;&amp;#xBAA8;&amp;#xB4E0;&lt;/em&gt; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;?&amp;#x201D; &amp;#x201C;FUZZ&amp;#xB77C;&amp;#xACE0; &amp;#xC801;&amp;#xD78C; &amp;#xCEE4;&amp;#xB2E4;&amp;#xB780; &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB204;&amp;#xB974;&amp;#xAE30;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294;, &amp;#xAC70;&amp;#xC800;&amp;#xBA39;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC774; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;?&amp;#x201D;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xB2F5;&amp;#xC744; &amp;#xC54C;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC00;&amp;#xC7A5; &amp;#xD754;&amp;#xD55C; &amp;#xC2E4;&amp;#xD5D8;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC00;&amp;#xC7A5; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; Windows &amp;#xD37C;&amp;#xC9D5; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC778; WinAFL&amp;#xACFC; &amp;#xC138;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC7A5; &amp;#xC778;&amp;#xAE30; &amp;#xC788;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC81C;&amp;#xD488; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC778; Adobe Reader&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0;, &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC744; &amp;#xB9CC;&amp;#xD55C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544; harness&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5; &amp;#xB4F1; &amp;#xC804;&amp;#xCCB4; &amp;#xC791;&amp;#xC5C5;&amp;#xC5D0; 50&amp;#xC77C;&amp;#xC758; &amp;#xAE30;&amp;#xAC04;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xACFC;&amp;#xB294; &amp;#xB9E4;&amp;#xC6B0; &amp;#xCDA9;&amp;#xACA9;&amp;#xC801;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 50&amp;#xC77C; &amp;#xB3D9;&amp;#xC548; Adobe Reader&amp;#xC5D0;&amp;#xC11C; 50&amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD558;&amp;#xB8E8; &amp;#xD3C9;&amp;#xADE0; 1&amp;#xAC1C;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C;, &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC720;&amp;#xD615;&amp;#xC758; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD754;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC18D;&amp;#xB3C4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAE00;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC758; &amp;#xC804;&amp;#xB9D0;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xB4DC;&amp;#xB9AC;&amp;#xB824; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC80;&amp;#xC0C9; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xB113;&amp;#xD788;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBC29;&amp;#xBC95;&amp;#xB860;, WinAFL&amp;#xC744; &amp;#xAC1C;&amp;#xC120;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xADF8; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5BB;&amp;#xC740; &amp;#xC9C0;&amp;#xC2DD;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB824; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;What-is-WinAFL&#34;&gt;&lt;a href=&#34;#What-is-WinAFL&#34; class=&#34;headerlink&#34; title=&#34;What is WinAFL?&#34;&gt;&lt;/a&gt;What is WinAFL?&lt;/h1&gt;&lt;p&gt;AFL&amp;#xC740; coverage guided genetic fuzzer&amp;#xB85C;, &amp;#xC2E4;&amp;#xC81C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xB370; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC601;&amp;#xB9AC;&amp;#xD55C; &amp;#xD734;&amp;#xB9AC;&amp;#xC2A4;&amp;#xD2F1;&amp;#xC744; &amp;#xAC16;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;WinAFL&amp;#xC740; Windows&amp;#xC6A9; AFL&amp;#xB85C; Ivan Fratric(Google Project Zero)&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACE0; &amp;#xAD00;&amp;#xB9AC;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Closed source &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xC5EC;&amp;#xB7EC; instrumentation&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; AFL&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC790;&amp;#xC138;&amp;#xD558;&amp;#xAC8C; &amp;#xC801;&amp;#xD600;&amp;#xC788;&amp;#xB294; AFL &amp;#xAE30;&amp;#xC220; &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xC77D;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xCD94;&amp;#xCC9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xC9C0;&amp;#xC801;&amp;#xD558;&amp;#xACE0; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB3C4;&amp;#xC640;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;WinAFL&amp;#xC740; &amp;#xC555;&amp;#xCD95; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD615;&amp;#xC2DD;(&amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;, &amp;#xBE44;&amp;#xB514;&amp;#xC624;, &amp;#xC544;&amp;#xCE74;&amp;#xC774;&amp;#xBE0C;)&amp;#xC758; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xB9F7; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294;&amp;#xB370; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Attacking-Acrobat-Reader-DC&#34;&gt;&lt;a href=&#34;#Attacking-Acrobat-Reader-DC&#34; class=&#34;headerlink&#34; title=&#34;Attacking Acrobat Reader DC&#34;&gt;&lt;/a&gt;Attacking Acrobat Reader DC&lt;/h1&gt;&lt;p&gt;&amp;#xC6B0;&amp;#xC120; &amp;#xBA54;&amp;#xC778; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; AcroRd32.exe&amp;#xBD80;&amp;#xD130; &amp;#xC2DC;&amp;#xC791;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.  AcroRD32.dll &amp;#xC8FC;&amp;#xBCC0;&amp;#xC758; (&amp;#xC0C1;&amp;#xB300;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;) &amp;#xC587;&amp;#xC740; wrapper&amp;#xC774;&amp;#xBA70; &amp;#xB300;&amp;#xB7B5; 30MB&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. AcroRD32.dll&amp;#xC740; &amp;#xB9CE;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC911; &amp;#xC77C;&amp;#xBD80;&amp;#xB294; PDF &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD30C;&amp;#xC11C;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xACE0; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC740; GUI &amp;#xCF54;&amp;#xB4DC;(&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; GUI &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC120; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xCC3E;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C;)&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;WinAFL&amp;#xC740; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC5D0; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xD2B9;&amp;#xC815; &amp;#xD30C;&amp;#xC11C;&amp;#xB97C; &amp;#xACF5;&amp;#xACA9;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC9D1;&amp;#xC911;&amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xD30C;&amp;#xC11C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xD30C;&amp;#xC11C;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; harness&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Harness&amp;#xB780; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xC7A0;&amp;#xC2DC; &amp;#xD6C4;&amp;#xC5D0; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC804;&amp;#xCCB4; Reader &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;&amp;#xB3C4; &amp;#xB85C;&amp;#xB4DC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC758; &amp;#xD30C;&amp;#xC11C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Acrobat&amp;#xC758; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0;&amp;#xC11C; DLL&amp;#xC744; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC; JP2KLib.dll&amp;#xC774; &amp;#xC774;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC784;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;JP2KLib.dll&amp;#xC740; JPEG2000 &amp;#xD3EC;&amp;#xB9F7;&amp;#xC758; &amp;#xD30C;&amp;#xC11C;&amp;#xB85C; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xC720;&amp;#xC6A9;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; export &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC758; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Acrobat Reader DC &amp;#x2264; 2018.011.238&lt;/p&gt;
&lt;p&gt;JP2KLib.dll 1.2.2.39492&lt;/p&gt;
&lt;h1 id=&#34;What-is-a-Target-Function&#34;&gt;&lt;a href=&#34;#What-is-a-Target-Function&#34; class=&#34;headerlink&#34; title=&#34;What is a Target Function?&#34;&gt;&lt;/a&gt;What is a Target Function?&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://github.com/googleprojectzero/winafl#how-to-select-a-target-function&#34;&gt;&amp;#xD0C0;&amp;#xAC9F;&amp;#xD568;&amp;#xC218;&lt;/a&gt;&amp;#xB294; WinAFL&amp;#xC774; &amp;#xD37C;&amp;#xC9D5; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC5D4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. fuzz_iteration &amp;#xD69F;&amp;#xC218;&amp;#xB9CC;&amp;#xD07C; &amp;#xBC18;&amp;#xBCF5; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xBA70; &amp;#xAC01; &amp;#xC2E4;&amp;#xD589;&amp;#xB9C8;&amp;#xB2E4; input &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xD2B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F; &amp;#xD568;&amp;#xC218;&amp;#xB294;:&lt;/p&gt;
&lt;p&gt;input &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xACE0;, &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC77D;&amp;#xACE0;, &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD30C;&amp;#xC2F1; &amp;#xD55C; &amp;#xD6C4; &amp;#xB2EB;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;C++ exception &amp;#xD639;&amp;#xC740; TermainateProcess&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB9AC;&amp;#xD134;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xCC3E;&amp;#xAE30;&amp;#xB780; &amp;#xC27D;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC77C; &amp;#xB550; &amp;#xB300;&amp;#xAC1C; harness&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;What-is-a-Harness&#34;&gt;&lt;a href=&#34;#What-is-a-Harness&#34; class=&#34;headerlink&#34; title=&#34;What is a Harness?&#34;&gt;&lt;/a&gt;What is a Harness?&lt;/h1&gt;&lt;p&gt;Harness&amp;#xB294; &amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD558;&amp;#xB294; &amp;#xC791;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Harness&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; WinAFL &amp;#xB808;&amp;#xD3EC;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; gdiplus&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C; harness&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;main&amp;#xC758; &amp;#xCCAB; argument&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xB824;&amp;#xB294; API&amp;#xC778; Image::Image parser&amp;#xB97C; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB958; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC885;&amp;#xB8CC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB97C; &amp;#xD574;&amp;#xC81C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xBB38;&amp;#xC11C;&amp;#xD654;&amp;#xB41C; API&amp;#xC5D0;&amp;#xC11C; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xC27D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC0D8;&amp;#xD50C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xB108;&amp;#xBB34; &amp;#xC27D;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;Closed Source &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC778; Adobe Reader&amp;#xB97C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC73C;&amp;#xB85C; &amp;#xC120;&amp;#xD0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC758; Harness &amp;#xC791;&amp;#xC131;&amp;#xBC95;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD37C;&amp;#xC9D5; &amp;#xD560;&amp;#xB9CC;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBD84;&amp;#xC11D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD574;&amp;#xB2F9; API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC798; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; Harness&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBC18;&amp;#xBCF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xC139;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; JP2KLib.dll&amp;#xC744; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD558;&amp;#xACE0; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xD558;&amp;#xB2C8;&amp;#xC2A4;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC04;&amp;#xB7B5;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xB860;&amp;#xC5D0;&amp;#xB9CC; &amp;#xAD00;&amp;#xC2EC;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xB3C5;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C; &amp;#xC139;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xC2DC;&amp;#xAE38; &amp;#xBC14;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Writing-a-Harness-for-JP2KLib-dll&#34;&gt;&lt;a href=&#34;#Writing-a-Harness-for-JP2KLib-dll&#34; class=&#34;headerlink&#34; title=&#34;Writing a Harness for JP2KLib.dll&#34;&gt;&lt;/a&gt;Writing a Harness for JP2KLib.dll&lt;/h1&gt;&lt;p&gt;JP2KLib.dll&amp;#xC758; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0;, &amp;#xBA3C;&amp;#xC800; &amp;#xD574;&amp;#xB2F9; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xAC00; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4;&amp;#xC778;&amp;#xC9C0; &amp;#xD639;&amp;#xC740; public &amp;#xC2EC;&amp;#xBCFC;&amp;#xC744; &amp;#xAC16;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CE;&amp;#xC740; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xC808;&amp;#xC57D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xD754;&amp;#xD55C; &amp;#xC77C;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC800;&amp;#xD76C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC6B4;&amp;#xC774; &amp;#xBCC4;&amp;#xB85C; &amp;#xC88B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; Adobe Reader&amp;#xAC00; JP2KLib&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xACFC; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; Harness&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBA3C;&amp;#xC800; &amp;#xC801;&amp;#xC808;&amp;#xD55C; PDF&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC81C;&amp;#xD488; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC6A9; PDF corpus&amp;#xB97C; &amp;#xB9CE;&amp;#xC774; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC911; JPEG2000&amp;#xC6A9; PDF &amp;#xD544;&amp;#xD130;&amp;#xC778; &amp;#x201C;/JPXdecode&amp;#x201D;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC7A5; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6C;&amp;#xAE00;&amp;#xB9C1; &amp;#xB610;&amp;#xB294; Abrocat Pro/Phantom PDF&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; testcase&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Pro Tip 1: reader&amp;#xC5D0; &amp;#xC0CC;&amp;#xB4DC;&amp;#xBC15;&amp;#xC2A4;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4; debugging/triaging&amp;#xC5D0; &amp;#xC131;&amp;#xAC00;&amp;#xC2E0; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xC808;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://forums.adobe.com/thread/2110951&#34;&gt;https://forums.adobe.com/thread/2110951&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Pro Tip 2: &lt;a href=&#34;https://docs.microsoft.com/en-us/windows-hardware/drivers/debugger/gflags-and-pageheap&#34;&gt;PageHeap&lt;/a&gt;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xD560;&amp;#xB2F9; &amp;#xC704;&amp;#xCE58;&amp;#xC640; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xC6D4;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;PDF wrapper &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; harness&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC0D8;&amp;#xD50C; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; jp2 &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB098;&amp;#xC911;&amp;#xC5D0; harness&amp;#xC758; test input&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xB4E4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xCD5C;&amp;#xC18C; &amp;#xC0D8;&amp;#xD50C;&amp;#xC744; &amp;#xC5BB;&amp;#xC5C8;&amp;#xC73C;&amp;#xB2C8; &amp;#x201C;sxe ld jp2klib&amp;#x201D;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; JP2KLib.dll&amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xC5B4;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xAC00; &amp;#xAC78;&amp;#xB9AC;&amp;#xBA74; JP2KLib&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; export &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xC5B4; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; call stack, &amp;#xC778;&amp;#xC790;, &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC744; &amp;#xAE30;&amp;#xB85D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;bm /a jp2klib!* &amp;#x201C;.&lt;span class=&#34;hljs-built_in&#34;&gt;echo&lt;/span&gt; callstack; k L5; .&lt;span class=&#34;hljs-built_in&#34;&gt;echo&lt;/span&gt; parameters:;  dc esp L8;  .&lt;span class=&#34;hljs-built_in&#34;&gt;echo&lt;/span&gt; &lt;span class=&#34;hljs-built_in&#34;&gt;return&lt;/span&gt; value: ; pt; &amp;#x201D;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC0D8;&amp;#xD50C; PDF&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD574; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; output&amp;#xC744; &amp;#xC5BB;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;JP2KLib&amp;#xAC00; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xD6C4; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB294; JP2KLibInitEx&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. JP2KLibInitEx&amp;#xAC00; &amp;#xBC1B;&amp;#xB294; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;AcrobRd32.dll&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xAC00; &amp;#xB2F4;&amp;#xAE34; 0x20 &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xBC14;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB824;&amp;#xB4E4;&amp;#xBA74; &amp;#xC548;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xD0C0;&amp;#xAC9F; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC4F0;&amp;#xC77C;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xC120; &amp;#x201C;nopX&amp;#x201D;(X&amp;#xB294; &amp;#xC22B;&amp;#xC790;)&amp;#xB77C;&amp;#xB294; &amp;#xC774;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &amp;#xBE48; &amp;#xD568;&amp;#xC218; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB123;&amp;#xC5B4;&amp;#xB193;&amp;#xACE0; Harness&amp;#xC758; &amp;#xBF08;&amp;#xB300;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Command line argument&amp;#xB85C;&amp;#xBD80;&amp;#xD130; input file&amp;#xC744; &amp;#xBC1B;&amp;#xB294;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;JP2KLib.dll&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xB454; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; JP2KLibInitEx&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;LOAD_FUNC&amp;#xB294; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. nopX &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; NOP&amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xD558;&amp;#xACE0; sample.jp2&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC798; &amp;#xC791;&amp;#xB3D9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#x201C;g&amp;#x201D;&amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB2E4;&amp;#xC74C; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB294; JP2KGetMemObjEx&amp;#xC774;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xC778;&amp;#xC790;&amp;#xB3C4; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xB9CC; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB2E4;&amp;#xC74C; &amp;#xD568;&amp;#xC218;&amp;#xC778; JP2KDecOptCreat &amp;#xB610;&amp;#xD55C; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xB9CC; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. JP2KDecOptCreat &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; nop4&amp;#xC640; nop7 &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294;&amp;#xAD70;&amp;#xC694;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xAC01;&amp;#xAC01; &amp;#xAD6C;&amp;#xD604;&amp;#xC744; &amp;#xD574;&amp;#xC918;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; nop4&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. nop4&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xD568;&amp;#xC218; AcroRd32!CTJPEGDecoderRelease+0xa992 &amp;#xC5D0; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xC5B4;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xACC4;&amp;#xC18D; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB2E4;&amp;#xBCF4;&amp;#xBA74;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xACF3;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC989;, nop4&amp;#xB294; malloc&amp;#xC758; wrapper&amp;#xD568;&amp;#xC218;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; &amp;#xAD6C;&amp;#xD604;&amp;#xD55C; &amp;#xB4A4; nop4&amp;#xC640; &amp;#xBC14;&amp;#xAFD4;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. nop7(memset), nop5(free), nop6(memcpy)&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB3C4; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB2E4;&amp;#xC74C; &amp;#xD568;&amp;#xC218;&amp;#xC778; JP2KDecOptInitToDefaults &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC; harness&amp;#xC758; &amp;#xBAA8;&amp;#xC2B5;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD568;&amp;#xC218;&amp;#xC778; JP2KImageInitDecoderEx&amp;#xB294; 5&amp;#xAC1C;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;5&amp;#xAC1C;&amp;#xC758; &amp;#xC778;&amp;#xC790; &amp;#xC911; 3&amp;#xAC1C;&amp;#xB294; JP2KImageCreate, JP2KDecOptCreate, JP2KGetMemObjEx&amp;#xC758; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC138; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xB294; vtable&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xD2B8;&amp;#xB9AD;&amp;#xC744; &amp;#xB611;&amp;#xAC19;&amp;#xC774; &amp;#xBC18;&amp;#xBCF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. nop&amp;#xC744; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD568;&amp;#xC218; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC0C1;&amp;#xC218;&amp;#xAC12; 0xbaaddaab&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC; harness&amp;#xC758; &amp;#xBAA8;&amp;#xC2B5;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;harness&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; nop10&amp;#xC73C;&amp;#xB85C; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. nop10&amp;#xC758; &amp;#xC2E4;&amp;#xC81C; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; call stack&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;JP2KCodeStm::IsSeekable&amp;#xB97C; IDA&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;JP2KCodeStm&amp;#xC758; 0x24 &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC5D0; &amp;#xC774;&amp;#xC804; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0; &amp;#xB123;&amp;#xC5B4;&amp;#xC900; vtable&amp;#xC774;, 0x18 &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC5D0; 0xbaaddaab &amp;#xC0C1;&amp;#xC218;&amp;#xAC12;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; Windbg&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. JP2KCodeStm::IsSeekable&amp;#xC740; 0xbaaddaab&amp;#xB97C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; vtable&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC01; &amp;#xD30C;&amp;#xC11C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB2E4;&amp;#xB974;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC775;&amp;#xC219;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;(FILE/ifstream)&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; input stream&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xC885;&amp;#xC758; input stream(network/file/memory) &amp;#xCD94;&amp;#xC0C1;&amp;#xD654;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xB294; JP2KCodeStm&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBCF4;&amp;#xACE0; &amp;#xBC14;&amp;#xB85C; &amp;#xC54C;&amp;#xC544;&amp;#xCC28;&amp;#xB838;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;0xbaaddaab&amp;#xB294; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC774;&amp;#xACE0; vtable&amp;#xC740; &amp;#xADF8; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. IDA&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00; JP2KCodeStm::XXX &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xD30C;&amp;#xC77C; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/17.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB958;&amp;#xAC00; &amp;#xB098;&amp;#xBA74; &amp;#xBC84;&amp;#xB9AC;&amp;#xACE0; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;&amp;#xBA74; JP2KImageInitDecoderEx&amp;#xC758; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC744; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. JP2KImageInitDecoderEx&amp;#xC740; &amp;#xC131;&amp;#xACF5; &amp;#xC2DC; 0&amp;#xC744; &amp;#xB9AC;&amp;#xD134;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xBA87; &amp;#xBC88;&amp;#xC758; &amp;#xC2DC;&amp;#xD589;&amp;#xCC29;&amp;#xC624;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC6D0;&amp;#xD558;&amp;#xB358; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC744; &amp;#xC5BB;&amp;#xB294; &amp;#xB370; &amp;#xC131;&amp;#xACF5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD568;&amp;#xC218;&amp;#xC778; JP2KImageDataCreate&amp;#xB294; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA70; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC744; &amp;#xADF8;&amp;#xB2E4;&amp;#xC74C; &amp;#xD568;&amp;#xC218;&amp;#xC778; JP2KImageGetMaxRes&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC740; 7&amp;#xAC1C;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBC1B;&amp;#xB294; JP2KImageDecodeTileInterleaved &amp;#xD568;&amp;#xC218;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. 7&amp;#xAC1C;&amp;#xC758; &amp;#xC778;&amp;#xC790; &amp;#xC911; 3&amp;#xAC1C;&amp;#xB294; JP2KImageCreate, JP2KImageGetMaxRes, JP2KImageDataCreate&amp;#xC758; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;IDA&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF8; &amp;#xACB0;&amp;#xACFC; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; 6&amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xB294; NULL&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB124; &amp;#xBC88;&amp;#xC9F8;, &amp;#xB2E4;&amp;#xC12F; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xB294; color depth&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC774; &amp;#xB450; &amp;#xAC12;&amp;#xC774; &amp;#xACE0;&amp;#xC815;&amp;#xB41C; &amp;#xCCB4;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/18.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; JP2KImageDataDestroy, JP2KImageDestroy, JP2KDecOptDestroy &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD574; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E0; &amp;#xC624;&amp;#xD504;&amp;#xC81D;&amp;#xD2B8;&amp;#xB4E4;&amp;#xC744; &amp;#xD574;&amp;#xC81C;&amp;#xD574; memory leak&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC791;&amp;#xC5C5;&amp;#xC740; WinAFL&amp;#xB85C; fuzz_iterations&amp;#xAC00; &amp;#xB192;&amp;#xC740; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xD560; &amp;#xB54C; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC790; &amp;#xC774;&amp;#xC81C; &amp;#xC798; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; Harness&amp;#xB97C; &amp;#xC644;&amp;#xC131;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC18C;&amp;#xD55C; &amp;#xC218;&amp;#xC815;&amp;#xC744; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. JP2KLib&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBC1B;&amp;#xC544;&amp;#xC624;&amp;#xB294; &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xBD84;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9E4; &amp;#xC2E4;&amp;#xD589;&amp;#xB9C8;&amp;#xB2E4; &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD574; &amp;#xC904; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xB97C; &amp;#xBD84;&amp;#xB9AC;&amp;#xD574;&amp;#xC90C;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xD5A5;&amp;#xC0C1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; fuzzme&amp;#xB77C;&amp;#xB294; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xC9C0;&amp;#xC5B4;&amp;#xC8FC;&amp;#xACE0; export &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xBCF4;&amp;#xB2E4; export &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xD6E8;&amp;#xC52C; &amp;#xC27D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Fuzzing-Methodology&#34;&gt;&lt;a href=&#34;#Fuzzing-Methodology&#34; class=&#34;headerlink&#34; title=&#34;Fuzzing Methodology&#34;&gt;&lt;/a&gt;Fuzzing Methodology&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;Basic tests for the harness&lt;ol&gt;
&lt;li&gt;Stability&lt;/li&gt;
&lt;li&gt;Paths&lt;/li&gt;
&lt;li&gt;Timeouts&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;Fuzzing Setup&lt;/li&gt;
&lt;li&gt;Initial corpus&lt;/li&gt;
&lt;li&gt;Initial line coverage&lt;/li&gt;
&lt;li&gt;Fuzzing loop&lt;ol&gt;
&lt;li&gt;Fuzz&lt;/li&gt;
&lt;li&gt;Check coverage / crashes&lt;/li&gt;
&lt;li&gt;cmin &amp;amp; repeat&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;Triage&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Basic-Tests-for-the-Harness&#34;&gt;&lt;a href=&#34;#Basic-Tests-for-the-Harness&#34; class=&#34;headerlink&#34; title=&#34;Basic Tests for the Harness&#34;&gt;&lt;/a&gt;Basic Tests for the Harness&lt;/h1&gt;&lt;p&gt;&amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xAE30; &amp;#xC55E;&amp;#xC11C; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; sanity test&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC800; &amp;#xC11C;&amp;#xBC84;&amp;#xC2E4; &amp;#xC628;&amp;#xB3C4;&amp;#xB9CC; &amp;#xB192;&amp;#xC774;&amp;#xB294; &amp;#xC77C;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8;. &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xC740; &amp;#xD37C;&amp;#xC800;&amp;#xAC00; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC2E4;&amp;#xD589; path&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xB294;&amp;#xAC00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, total path count&amp;#xAC00; &amp;#xAFB8;&amp;#xC900;&amp;#xD788; &amp;#xC0C1;&amp;#xC2B9;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; path count&amp;#xAC00; 0&amp;#xC774;&amp;#xAC70;&amp;#xB098; &amp;#xAC70;&amp;#xC758; 0&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD568;&amp;#xC815;&amp;#xB4E4;&amp;#xC744; &amp;#xC870;&amp;#xC0AC;&amp;#xD574;&amp;#xBD10;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xD0C0;&amp;#xAC9F;&amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC778;&amp;#xB77C;&amp;#xC778; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xC5B4; WinAFL&amp;#xC774; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC778;&amp;#xC790; &amp;#xAC1C;&amp;#xC218;&amp;#xB098; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xADDC;&amp;#xC57D;&amp;#xC774; &amp;#xC798;&amp;#xBABB;&amp;#xB410;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD0C0;&amp;#xC784;&amp;#xC544;&amp;#xC6C3;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xB0AE;&amp;#xC544; harness&amp;#xAC00; &amp;#xB108;&amp;#xBB34; &amp;#xC77C;&amp;#xCC0D; &amp;#xC885;&amp;#xB8CC;&amp;#xB41C;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xBA87; &amp;#xBD84; &amp;#xC815;&amp;#xB3C4; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C; &amp;#xB4A4; &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC774; &amp;#xB0AE;&amp;#xC544;(80% &amp;#xBBF8;&amp;#xB9CC;) &amp;#xC774;&amp;#xC288;&amp;#xB97C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Harness&amp;#xC758; &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC740; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC131;&amp;#xB2A5;&amp;#xACFC; &amp;#xC9C1;&amp;#xACB0;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD754;&amp;#xD788; &amp;#xBE60;&amp;#xC9C0;&amp;#xB294; &amp;#xD568;&amp;#xC815;&amp;#xB4E4;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB09C;&amp;#xC218; element&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD10;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xBA87;&amp;#xBA87; hash table&amp;#xB4E4;&amp;#xC740; collision&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB09C;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; coverage&amp;#xC758; &amp;#xC815;&amp;#xD655;&amp;#xB3C4;&amp;#xB97C; &amp;#xB5A8;&amp;#xC5B4;&amp;#xB728;&amp;#xB9AC;&amp;#xB294; &amp;#xC791;&amp;#xC5C5;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xB09C;&amp;#xC218;&amp;#xC758; seed&amp;#xB97C; &amp;#xC0C1;&amp;#xC218;&amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xACE0;&amp;#xC815;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xBA87;&amp;#xBA87; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; global object&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; cach&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. nop run&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Windows 10 64-bit &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB294; 32-bit &amp;#xD0C0;&amp;#xAC9F;&amp;#xC758; stack alignment&amp;#xB294; &amp;#xD56D;&amp;#xC0C1; 8&amp;#xC774; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; memcpy&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xB2E4;&amp;#xB978; AVX &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xCF54;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xBA70; coverage &amp;#xB610;&amp;#xD55C; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. harness&amp;#xC5D0; stack aligne&amp;#xC744; &amp;#xB9DE;&amp;#xCD94;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xACB0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xC704; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &amp;#xC2E4;&amp;#xD328;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; DynamoRIO&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; harness&amp;#xC758; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC744; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xACE0; output&amp;#xC744; &amp;#xBE44;&amp;#xAD50;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Fuzzing-Setup&#34;&gt;&lt;a href=&#34;#Fuzzing-Setup&#34; class=&#34;headerlink&#34; title=&#34;Fuzzing Setup&#34;&gt;&lt;/a&gt;Fuzzing Setup&lt;/h1&gt;&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xACFC; &amp;#xAC19;&amp;#xC740; VM&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;8~16 core, 32 GB of RAM, Windows 10 x64&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &lt;a href=&#34;https://sourceforge.net/projects/imdisk-toolkit/&#34;&gt;ImDisk toolkit&lt;/a&gt;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; RAM disk drive&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE60;&amp;#xB978; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0; test case&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBCD1;&amp;#xBAA9; &amp;#xD604;&amp;#xC0C1;&amp;#xC744; &amp;#xC720;&amp;#xBC1C;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows Defender &amp;#xB610;&amp;#xD55C; &amp;#xC131;&amp;#xB2A5;&amp;#xC5D0; &amp;#xC545;&amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xB07C;&amp;#xCE58;&amp;#xB2C8; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. WinAFL&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; test case&amp;#xB4E4; &amp;#xC911; Windows Defender&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; exploit&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/19.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Windows Indexing Service&amp;#xB3C4; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC9D5; &amp;#xB3C4;&amp;#xC911; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xC7AC;&amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xB358; dll&amp;#xC744; &amp;#xB300;&amp;#xCCB4;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; Windows Update&amp;#xB3C4; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBC84;&amp;#xADF8; &amp;#xD0D0;&amp;#xC0C9;&amp;#xC5D0; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xBBC0;&amp;#xB85C; harness &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; page heap&amp;#xC740; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC18D;&amp;#xB3C4;&amp;#xB294; &amp;#xB290;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBC84;&amp;#xADF8; &amp;#xD0D0;&amp;#xC0C9;&amp;#xC5D0; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC774;&amp;#xB77C;&amp;#xB294; edge coverage type&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;afl-fuzz.exe -i R:\\jp2k\\&lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; -o R:\\jp2k\\out -t 20000+ -D c:\\DynamoRIO-Windows-7.0.0-RC1\\bin32 -S Slav02 &amp;#x2014; -fuzz_iterations 10000 -coverage_module JP2KLib.dll -target_module adobe_jp2k.exe -target_method fuzzme -nargs 1 -covtype edge &amp;#x2014; adobe_jp2k.exe @@&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;Initial-Corpus&#34;&gt;&lt;a href=&#34;#Initial-Corpus&#34; class=&#34;headerlink&#34; title=&#34;Initial Corpus&#34;&gt;&lt;/a&gt;Initial Corpus&lt;/h1&gt;&lt;p&gt;Harness&amp;#xB97C; &amp;#xC644;&amp;#xC131;&amp;#xD588;&amp;#xB2E4;&amp;#xBA74; &amp;#xC544;&amp;#xB798; &amp;#xBC29;&amp;#xBC95;&amp;#xB4E4;&amp;#xB85C; &amp;#xCD08;&amp;#xAE30; corpus&amp;#xB97C; &amp;#xD655;&amp;#xBCF4;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Online corpuses ( &lt;a href=&#34;https://lcamtuf.coredump.cx/afl/demo/&#34;&gt;afl corpus&lt;/a&gt;, &lt;a href=&#34;https://github.com/uclouvain/openjpeg-data&#34;&gt;openjpeg-data&lt;/a&gt; )&lt;/li&gt;
&lt;li&gt;Test suites from open source projects&lt;/li&gt;
&lt;li&gt;Crawlling google / duckduckgo&lt;/li&gt;
&lt;li&gt;Corpuses from our older fuzzing projects&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Corpus-Minimization&#34;&gt;&lt;a href=&#34;#Corpus-Minimization&#34; class=&#34;headerlink&#34; title=&#34;Corpus Minimization&#34;&gt;&lt;/a&gt;Corpus Minimization&lt;/h1&gt;&lt;p&gt;&amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; coverage&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xC6A9;&amp;#xB7C9;&amp;#xC774; &amp;#xD070; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC131;&amp;#xB2A5;&amp;#xC774; &amp;#xC800;&amp;#xD558;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. AFL&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; afl-cmin&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; corpus&amp;#xB97C; &amp;#xAC04;&amp;#xC18C;&amp;#xD654; &amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. WinAFL&amp;#xC740; winafl-cmin.py&amp;#xB77C;&amp;#xB294; &amp;#xD234;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD655;&amp;#xBCF4;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; winafl-cmin.py&amp;#xC5D0; &amp;#xB123;&amp;#xACE0; &amp;#xAC04;&amp;#xC18C;&amp;#xD654;&amp;#xB41C; corpus&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC19;&amp;#xC740; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; winafl-cmin&amp;#xC744; &amp;#xB450; &amp;#xBC88; &amp;#xB3CC;&amp;#xB824;&amp;#xBCF4;&amp;#xACE0; &amp;#xAC19;&amp;#xC740; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xB098;&amp;#xC624;&amp;#xB294;&amp;#xC9C0; &amp;#xBE44;&amp;#xAD50;&amp;#xD574;&amp;#xBD10;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xB450; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xB2E4;&amp;#xB974;&amp;#xB2E4;&amp;#xBA74; harness&amp;#xAC00; &amp;#xBE44;&amp;#xACB0;&amp;#xC815;&amp;#xB860; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC548;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Initial-Line-Coverage&#34;&gt;&lt;a href=&#34;#Initial-Line-Coverage&#34; class=&#34;headerlink&#34; title=&#34;Initial Line Coverage&#34;&gt;&lt;/a&gt;Initial Line Coverage&lt;/h1&gt;&lt;p&gt;Corpus&amp;#xB97C; &amp;#xC5BB;&amp;#xC5C8;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xC820; line coverage&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC; &amp;#xCC28;&amp;#xB840;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Line coverage&amp;#xB780; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB9AC; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. DynamoRIO&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; line coverage&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;[dynamoriodir]\\bin32\\drrun.exe -t drcov &amp;#x2014; harness.exe testcase&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xAC01; test case&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC704; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xACB0;&amp;#xACFC;&amp;#xAC12;&amp;#xC744; IDA &lt;a href=&#34;https://github.com/gaasedelen/lighthouse&#34;&gt;Lighthouse&lt;/a&gt;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/20.png&#34; alt&gt;&amp;#xB294;&amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Fuzzing-Cycle&#34;&gt;&lt;a href=&#34;#Fuzzing-Cycle&#34; class=&#34;headerlink&#34; title=&#34;Fuzzing Cycle&#34;&gt;&lt;/a&gt;Fuzzing Cycle&lt;/h1&gt;&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xB2E8;&amp;#xACC4;&amp;#xB294; &amp;#xB9E4;&amp;#xC6B0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Coverage&amp;#xC640; Crash &amp;#xBD84;&amp;#xC11D;&lt;/li&gt;
&lt;li&gt;Coverage &amp;#xC870;&amp;#xC0AC;, cmin &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBC18;&amp;#xBCF5;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xB3CC;&amp;#xB9AC;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xD2B9;&amp;#xBCC4;&amp;#xD788; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xC77C;&amp;#xC774; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xAD6C;&amp;#xC131;&amp;#xB300;&amp;#xB85C; &amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xAE30;&amp;#xB2A5;&amp;#xC758; &amp;#xBD07;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;(&lt;a href=&#34;http://winafl-whatsapp.py&#34;&gt;winafl-whatsapp.py&lt;/a&gt;)&lt;/li&gt;
&lt;li&gt;&amp;#xAC01; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC2DC;&amp;#xAC04;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; path &amp;#xBCC0;&amp;#xD654; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&lt;/li&gt;
&lt;li&gt;Crash triage (&amp;#xB2E4;&amp;#xC74C; &amp;#xC139;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8F8;)&lt;/li&gt;
&lt;li&gt;&amp;#xBA48;&amp;#xCD98; &amp;#xD37C;&amp;#xC800; &amp;#xC7AC;&amp;#xC2DC;&amp;#xC791;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC791;&amp;#xC5C5;&amp;#xB4E4;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xC911;&amp;#xC694;&amp;#xD55C;&amp;#xC9C0; &amp;#xAD73;&amp;#xC774; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xB294; &amp;#xC5C6;&amp;#xACA0;&amp;#xC8E0;? &amp;#xD37C;&amp;#xC9D5;&amp;#xC740; &amp;#xC9C0;&amp;#xB8E8;&amp;#xD558;&amp;#xACE0; &amp;#xC624;&amp;#xB958;&amp;#xAC00; &amp;#xB118;&amp;#xCE58;&amp;#xB294; &amp;#xC791;&amp;#xC5C5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC640; path&amp;#xB97C; &amp;#xBA87; &amp;#xC2DC;&amp;#xAC04; &amp;#xC8FC;&amp;#xAE30;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&amp;#xC5D0; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC138;&amp;#xAC00; &amp;#xBCF4;&amp;#xC778;&amp;#xB2E4;&amp;#xBA74; coverage&amp;#xB97C; &amp;#xC870;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/21.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; queue&amp;#xB97C; &amp;#xBAA8;&amp;#xC544; cmin&amp;#xC744; &amp;#xAC70;&amp;#xCE58;&amp;#xACE0; &amp;#xADF8; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; IDA&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C1;&amp;#xB300;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; coverage&amp;#xAC00; &amp;#xC791;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xD070; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB824; &amp;#xB178;&amp;#xB825;&amp;#xD558;&amp;#xACE0; &amp;#xAC01; &amp;#xC0D8;&amp;#xD50C;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xB2E8;&amp;#xACC4;&amp;#xB294; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xC0D8;&amp;#xD50C;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xBA87; &amp;#xC2DC;&amp;#xAC04;&amp;#xC758; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; 3&amp;#xAC1C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Coverage&amp;#xAC00; &amp;#xB354; &amp;#xC774;&amp;#xC0C1; &amp;#xB298;&amp;#xC5B4;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC774; &amp;#xC0AC;&amp;#xC774;&amp;#xD074;&amp;#xC744; &amp;#xBC18;&amp;#xBCF5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Coverage&amp;#xAC00; &amp;#xB298;&amp;#xC5B4;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC740; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xAC70;&amp;#xB098; harness&amp;#xB97C; &amp;#xAC1C;&amp;#xC120;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Triage&#34;&gt;&lt;a href=&#34;#Triage&#34; class=&#34;headerlink&#34; title=&#34;Triage&#34;&gt;&lt;/a&gt;Triage&lt;/h1&gt;&lt;p&gt;Crash&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; test case&amp;#xB97C; &amp;#xC5BB;&amp;#xC73C;&amp;#xBA74; &amp;#xC9C1;&amp;#xC811; crash&amp;#xC640; &amp;#xADF8; &amp;#xC785;&amp;#xB825;&amp;#xAC12;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC911;&amp;#xBCF5;&amp;#xB41C; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xB9CE;&amp;#xC544; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC804;&amp;#xB7B5;&amp;#xC744; &amp;#xBC14;&amp;#xAFE8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;a href=&#34;https://github.com/SkyLined/BugId&#34;&gt;Bugld&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC911;&amp;#xBCF5;&amp;#xB41C; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC0DD;&amp;#xB7B5;&amp;#xD558;&amp;#xACE0; unique crash&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; minimize &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/04/fabu1ous/50cve/22.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;What-We-Found&#34;&gt;&lt;a href=&#34;#What-We-Found&#34; class=&#34;headerlink&#34; title=&#34;What We Found&#34;&gt;&lt;/a&gt;What We Found&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xC804;&amp;#xB7B5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Adobe Reader&amp;#xC640; Adobe Pro&amp;#xC5D0;&amp;#xC11C; 53&amp;#xAC1C;&amp;#xC758; critical &amp;#xD55C; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xD30C;&amp;#xC11C; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xB514;&amp;#xCF54;&amp;#xB354; &amp;#xB4F1;&amp;#xC5D0; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC801;&amp;#xC6A9;&amp;#xD574;&amp;#xBD24;&amp;#xACE0; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; CVE&amp;#xB4E4;&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;CVE-2018-4985, CVE-2018-5063, CVE-2018-5064, CVE-2018-5065, CVE-2018-5068, CVE-2018-5069, CVE-2018-5070, CVE-2018-12754, CVE-2018-12755, CVE-2018-12764, CVE-2018-12765, CVE-2018-12766, CVE-2018-12767, CVE-2018-12768, CVE-2018-12848, CVE-2018-12849, CVE-2018-12850, CVE-2018-12840, CVE-2018-15956, CVE-2018-15955, CVE-2018-15954,CVE-2018-15953, CVE-2018-15952, CVE-2018-15938, CVE-2018-15937, CVE-2018-15936, CVE-2018-15935, CVE-2018-15934, CVE-2018-15933, CVE-2018-15932 , CVE-2018-15931, CVE-2018-15930 , CVE-2018-15929, CVE-2018-15928, CVE-2018-15927, CVE-2018-12875, CVE-2018-12874 , CVE-2018-12873, CVE-2018-12872,CVE-2018-12871, CVE-2018-12870, CVE-2018-12869, CVE-2018-12867 , CVE-2018-12866, CVE-2018-12865 , CVE-2018-12864 , CVE-2018-12863, CVE-2018-12862, CVE-2018-12861, CVE-2018-12860, CVE-2018-12859, CVE-2018-12857, CVE-2018-12839, CVE-2018-8464&lt;/p&gt;
&lt;p&gt;jp2k&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB294; &lt;a href=&#34;https://www.welivesecurity.com/2018/05/15/tale-two-zero-days/&#34;&gt;&amp;#xC2E4;&amp;#xC81C; &amp;#xACF5;&amp;#xACA9;&lt;/a&gt;&amp;#xC5D0; &amp;#xC545;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5B4; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xACE0; &amp;#xC5BC;&amp;#xB9C8; &amp;#xC9C0;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; Adobe&amp;#xC5D0; &amp;#xC81C;&amp;#xBCF4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBB3C;&amp;#xB860; Adobe Reader&amp;#xC758; &amp;#xC0CC;&amp;#xB4DC;&amp;#xBC15;&amp;#xC2A4;&amp;#xC640; Reader Protected Mode&amp;#xB294; exploit&amp;#xC758; &amp;#xBCF5;&amp;#xC7A1;&amp;#xB3C4;&amp;#xB97C; &amp;#xD06C;&amp;#xAC8C; &amp;#xC99D;&amp;#xAC00;&amp;#xC2DC;&amp;#xCF30;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9; &amp;#xC0AC;&amp;#xB840;&amp;#xCC98;&amp;#xB7FC; &amp;#xC0CC;&amp;#xB4DC; &amp;#xBC15;&amp;#xC2A4;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCE58;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC120; &amp;#xB610; &amp;#xB2E4;&amp;#xB978; PE exploit&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; WinAFL&amp;#xC744; &amp;#xC0AC;&amp;#xB791;&amp;#xD558;&amp;#xACE0; &amp;#xB354; &amp;#xB9CE;&amp;#xC774; &amp;#xC4F0;&amp;#xC774;&amp;#xAE38; &amp;#xBC14;&amp;#xB77C;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;WinAFL&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBC84;&amp;#xADF8;&amp;#xB098; &amp;#xAE30;&amp;#xB2A5; &amp;#xB204;&amp;#xB77D; &amp;#xB4F1;&amp;#xC744; &amp;#xC790;&amp;#xC8FC; &amp;#xB9C8;&amp;#xC8FC;&amp;#xCCE4;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Windows 10 Appifier&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC9C0;&amp;#xC6D0; &amp;#xCD94;&amp;#xAC00;, CPU &amp;#xC120;&amp;#xD638;&amp;#xB3C4;, &amp;#xBC84;&amp;#xADF8; &amp;#xC218;&amp;#xC815; &amp;#xBC0F; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; GUI &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xC5C5;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C; &amp;#xCEE4;&amp;#xBC0B; &amp;#xB9C1;&amp;#xD06C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Netanel&amp;#x2019;s commits &amp;#x2013; &lt;a href=&#34;https://github.com/googleprojectzero/winafl/commits?author=netanel01&#34;&gt;https://github.com/googleprojectzero/winafl/commits?author=netanel01&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Yoava&amp;#x2019;s commits &amp;#x2013; &lt;a href=&#34;https://github.com/googleprojectzero/winafl/commits?author=yoava333&#34;&gt;https://github.com/googleprojectzero/winafl/commits?author=yoava333&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/07/04/fabu1ous/50cve/1.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/07/04/fabu1ous/50cve/">

  <title>[Translation] 50 CVEs in 50 Days: Fuzzing Adobe Reader - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-07-04 14:00" pubdate>
      2021 7 4 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      5.9k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      118
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Translation] 50 CVEs in 50 Days: Fuzzing Adobe Reader</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="&#xBC88;&#xC5ED;-&#xCD94;&#xC2E0;"><a href="#&#xBC88;&#xC5ED;-&#xCD94;&#xC2E0;" class="headerlink" title="&#xBC88;&#xC5ED; &#xCD94;&#xC2E0;"></a>&#xBC88;&#xC5ED; &#xCD94;&#xC2E0;</h1><p>WinAFL &#xC5F0;&#xAD6C;&#xAE00;&#xC744; &#xC4F0;&#xBA74;&#xC11C; &#xD0C0;&#xAC9F;&#xD568;&#xC218; &#xCC3E;&#xAE30; &#xC704;&#xD574; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC744; &#xC880; &#xB354; &#xACF5;&#xBD80;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC77D;&#xC740; &#xAE00;&#xC785;&#xB2C8;&#xB2E4;. &#xCC38; &#xC560;&#xB9E4;&#xD55C; &#xC8FC;&#xC81C;&#xC778; &#xAC8C; &#xD0C0;&#xAC9F; &#xBD84;&#xC11D;&#xC744; &#xB108;&#xBB34; &#xB9CE;&#xC774;&#xD558;&#xBA74; &#xD37C;&#xC9D5;&#xC744; &#xD558;&#xB294; &#xC758;&#xBBF8;&#xAC00; &#xC5C6;&#xC5B4;&#xC9C0;&#xACE0; &#xADF8;&#xB807;&#xB2E4;&#xACE0; &#xBD84;&#xC11D;&#xC744; &#xB108;&#xBB34; &#xC801;&#xAC8C; &#xD558;&#xBA74; Harness &#xC791;&#xC131; &#xBC0F; &#xD37C;&#xC9D5;&#xC744; &#xB3CC;&#xB9AC;&#xB294; &#xAC70; &#xC790;&#xCCB4;&#xAC00; &#xBC88;&#xAC70;&#xC6CC;&#xC9D1;&#xB2C8;&#xB2E4;. &#xADF8; &#xC0AC;&#xC774; &#xC5B4;&#xB518;&#xAC00; &#xC801;&#xC815; &#xC120;&#xC744; &#xCC3E;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD55C;&#xB370; &#xC774; &#xAE00;&#xC774; &#xB3C4;&#xC6C0;&#xC774; &#xB420; &#xAC70;&#xB77C; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xAE00;&#xC744; &#xB530;&#xB77C;&#xC11C; &#xC9C1;&#xC811; &#xC2E4;&#xC2B5;&#xD574;&#xBCF4;&#xACE0; &#xC7AC;&#xAD6C;&#xC131;&#xD55C; &#xC5F0;&#xAD6C;&#xAE00;&#xC744; &#xC5C5;&#xB85C;&#xB4DC;&#xD560; &#xC0DD;&#xAC01;&#xC774;&#xC5C8;&#xC9C0;&#xB9CC; &#xC885;&#xAC15; &#xAE30;&#xB150;&#xC73C;&#xB85C; &#xB180;&#xB2E4; &#xC640;&#xC11C; &#xC9C4;&#xB4DD;&#xD558;&#xAC8C; &#xC5F0;&#xAD6C;&#xAE00;&#xC744; &#xC4F8; &#xC2DC;&#xAC04;&#xC774; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#x314E;&#x314E; &#xADF8;&#xB798;&#xC11C; &#xC77C;&#xB2E8; &#xBC88;&#xC5ED;&#xAE00;&#xC744; &#xC62C;&#xB9BD;&#xB2C8;&#xB2E4;. &#xD604;&#xC7AC; &#xC5C5;&#xB85C;&#xB4DC; &#xC911;&#xC778; WinAFL &#xC2DC;&#xB9AC;&#xC988;&#xC758; &#xB2E4;&#xC74C; &#xAE00;&#xC740; &#xC774;&#xBC88; &#xBC88;&#xC5ED;&#xAE00;&#xC744; &#xC880; &#xB354; &#xAE4A;&#xAC8C; &#xACF5;&#xBD80;&#xD574;&#xBCF4;&#xACE0; &#xC791;&#xC131;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC6D0;&#xBCF8;&#xAE00; :  <a target="_blank" rel="external nofollow noopener noreferrer" href="https://research.checkpoint.com/2018/50-adobe-cves-in-50-days/">https://research.checkpoint.com/2018/50-adobe-cves-in-50-days/</a></p>
<h1 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h1><p>2017&#xB144;&#xC5D0; &#xD070; &#xBCC0;&#xD654;&#xAC00; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8; &#xD574;&#xC5D0; &#xBCF4;&#xACE0;&#xB41C; &#xC0C8;&#xB85C;&#xC6B4; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC218;&#xB294; &#xC57D; 14,000&#xAC1C;&#xB85C;, &#xC804;&#xB144;&#xBCF4;&#xB2E4; &#xB450; &#xBC30; &#xC774;&#xC0C1; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xB9C8; &#xADF8; &#xC774;&#xC720;&#xB294; &#xC790;&#xB3D9; &#xCDE8;&#xC57D;&#xC810; &#xD0D0;&#xC0C9; &#xD234;&#xC778; &#x201C;&#xD37C;&#xC800;&#x201D;&#xC758; &#xC778;&#xAE30;&#xAC00; &#xB192;&#xC544;&#xC84C;&#xAE30; &#xB54C;&#xBB38;&#xC77C; &#xAC81;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/1.png" srcset="/img/loading.gif" alt></p>
<p>&#xD37C;&#xC800; &#xC790;&#xCCB4;&#xB294; 20&#xB144; &#xC774;&#xC0C1; &#xC874;&#xC7AC;&#xD574; &#xC654;&#xACE0; &#xADF8;&#xB9AC; &#xC0C8;&#xB85C;&#xC6B4; &#xAE30;&#xC220;&#xC740; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC8FC;&#xBAA9;&#xD574;&#xC57C; &#xD560; &#xC0AC;&#xC2E4;&#xC740; &#xD37C;&#xC800;&#xB4E4;&#xC774; &#xBC1C;&#xC804;&#xD588;&#xB2E4;&#xB294; &#xAC81;&#xB2C8;&#xB2E4;. &#xADF8;&#xB4E4;&#xC740; &#xB354;&#xC6B1; &#xB6F0;&#xC5B4;&#xB09C; &#xAE30;&#xB2A5;&#xACFC; &#xC26C;&#xC6B4; &#xC811;&#xADFC;&#xC131;&#xC744; &#xAC00;&#xC9C0;&#xAC8C; &#xB410;&#xC73C;&#xBA70; &#xBB34;&#xC5C7;&#xBCF4;&#xB2E4; &#xC644;&#xC131;&#xB3C4;&#xAC00; &#xB192;&#xC544;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0;, &#xD37C;&#xC800;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC740; &#x201C;&#xC5B4;&#xB450;&#xC6B4; &#xC608;&#xC220;&#x201D;&#xC774;&#xB77C;&#xB294; &#xD3C9;&#xD310;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB9CE;&#xC740; &#xC5F0;&#xAD6C;&#xC790;&#xB4E4;&#xC740; &#xD37C;&#xC800;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC744; &#xAEBC;&#xB824;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC704;&#xC758; &#xBAA8;&#xB4E0; &#xAC83;&#xC744; &#xACE0;&#xB824;&#xD574; &#xBCFC; &#xB54C;, &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xC9C8;&#xBB38;&#xC744; &#xD574;&#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#x201C;&#xB354; &#xB9CE;&#xC740; &#xC5F0;&#xAD6C;&#xC790;&#xB4E4;&#xC774; &#xB354; &#xB9CE;&#xC740; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xAE30; &#xC704;&#xD574; &#xD37C;&#xC800;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; <em>&#xBAA8;&#xB4E0;</em> &#xC5F0;&#xAD6C;&#xC790;&#xB4E4;&#xC774; <em>&#xBAA8;&#xB4E0;</em> &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xAE30; &#xC704;&#xD574; &#xD37C;&#xC800;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC744;&#xAE4C;?&#x201D; &#x201C;FUZZ&#xB77C;&#xACE0; &#xC801;&#xD78C; &#xCEE4;&#xB2E4;&#xB780; &#xBC84;&#xD2BC;&#xC744; &#xB204;&#xB974;&#xAE30;&#xB9CC; &#xD558;&#xBA74; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xB294;, &#xAC70;&#xC800;&#xBA39;&#xC744; &#xC218; &#xC788;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC774; &#xC5BC;&#xB9C8;&#xB098; &#xC788;&#xC744;&#xAE4C;?&#x201D;</p>
<p>&#xADF8; &#xB2F5;&#xC744; &#xC54C;&#xAE30; &#xC704;&#xD574;, &#xC800;&#xD76C;&#xB294; &#xC800;&#xD76C;&#xAC00; &#xC0DD;&#xAC01;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC00;&#xC7A5; &#xD754;&#xD55C; &#xC2E4;&#xD5D8;&#xC744; &#xB9CC;&#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC00;&#xC7A5; &#xC77C;&#xBC18;&#xC801;&#xC778; Windows &#xD37C;&#xC9D5; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C; &#xC911; &#xD558;&#xB098;&#xC778; WinAFL&#xACFC; &#xC138;&#xACC4;&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xC778;&#xAE30; &#xC788;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xC81C;&#xD488; &#xC911; &#xD558;&#xB098;&#xC778; Adobe Reader&#xB97C; &#xC0AC;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xD76C;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xACE0;, &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC788;&#xC744; &#xB9CC;&#xD55C; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xCC3E;&#xC544; harness&#xB97C; &#xC791;&#xC131;&#xD558;&#xACE0;, &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xD37C;&#xC9D5; &#xB4F1; &#xC804;&#xCCB4; &#xC791;&#xC5C5;&#xC5D0; 50&#xC77C;&#xC758; &#xAE30;&#xAC04;&#xC744; &#xC124;&#xC815;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xACB0;&#xACFC;&#xB294; &#xB9E4;&#xC6B0; &#xCDA9;&#xACA9;&#xC801;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. 50&#xC77C; &#xB3D9;&#xC548; Adobe Reader&#xC5D0;&#xC11C; 50&#xAC1C; &#xC774;&#xC0C1;&#xC758; &#xC0C8;&#xB85C;&#xC6B4; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBC1C;&#xACAC;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD558;&#xB8E8; &#xD3C9;&#xADE0; 1&#xAC1C;&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C;, &#xC774;&#xB7EC;&#xD55C; &#xC720;&#xD615;&#xC758; &#xC5F0;&#xAD6C;&#xC5D0;&#xC11C;&#xB294; &#xD754;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xC18D;&#xB3C4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xAE00;&#xC744; &#xD1B5;&#xD574; &#xD574;&#xB2F9; &#xC5F0;&#xAD6C;&#xC758; &#xC804;&#xB9D0;&#xC744; &#xC54C;&#xB824;&#xB4DC;&#xB9AC;&#xB824; &#xD569;&#xB2C8;&#xB2E4;. &#xAC80;&#xC0C9; &#xBC94;&#xC704;&#xB97C; &#xB113;&#xD788;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xD55C; &#xC0C8;&#xB85C;&#xC6B4; &#xBC29;&#xBC95;&#xB860;, WinAFL&#xC744; &#xAC1C;&#xC120;&#xD55C; &#xBC29;&#xBC95;, &#xADF8;&#xB9AC;&#xACE0; &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xADF8; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC5BB;&#xC740; &#xC9C0;&#xC2DD;&#xC744; &#xACF5;&#xC720;&#xD558;&#xB824; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="What-is-WinAFL"><a href="#What-is-WinAFL" class="headerlink" title="What is WinAFL?"></a>What is WinAFL?</h1><p>AFL&#xC740; coverage guided genetic fuzzer&#xB85C;, &#xC2E4;&#xC81C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xBC84;&#xADF8;&#xB97C; &#xCC3E;&#xB294; &#xB370; &#xB9E4;&#xC6B0; &#xC601;&#xB9AC;&#xD55C; &#xD734;&#xB9AC;&#xC2A4;&#xD2F1;&#xC744; &#xAC16;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>WinAFL&#xC740; Windows&#xC6A9; AFL&#xB85C; Ivan Fratric(Google Project Zero)&#xC5D0; &#xC758;&#xD574; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C0;&#xACE0; &#xAD00;&#xB9AC;&#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Closed source &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xD0C0;&#xAC9F;&#xC73C;&#xB85C; &#xD55C; &#xC5EC;&#xB7EC; instrumentation&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC6B0;&#xC120; AFL&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; &#xB3D9;&#xC791;&#xD558;&#xB294;&#xC9C0; &#xC790;&#xC138;&#xD558;&#xAC8C; &#xC801;&#xD600;&#xC788;&#xB294; AFL &#xAE30;&#xC220; &#xBB38;&#xC11C;&#xB97C; &#xC77D;&#xB294; &#xAC83;&#xC744; &#xCD94;&#xCC9C;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xB2E8;&#xC810;&#xC744; &#xC9C0;&#xC801;&#xD558;&#xACE0; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD588;&#xC744; &#xB54C; &#xB514;&#xBC84;&#xAE45;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB3C4;&#xC640;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>WinAFL&#xC740; &#xC555;&#xCD95; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xD615;&#xC2DD;(&#xC774;&#xBBF8;&#xC9C0;, &#xBE44;&#xB514;&#xC624;, &#xC544;&#xCE74;&#xC774;&#xBE0C;)&#xC758; &#xD30C;&#xC77C; &#xD3EC;&#xB9F7; &#xBC84;&#xADF8;&#xB97C; &#xCC3E;&#xB294;&#xB370; &#xB9E4;&#xC6B0; &#xD6A8;&#xACFC;&#xC801;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h1 id="Attacking-Acrobat-Reader-DC"><a href="#Attacking-Acrobat-Reader-DC" class="headerlink" title="Attacking Acrobat Reader DC"></a>Attacking Acrobat Reader DC</h1><p>&#xC6B0;&#xC120; &#xBA54;&#xC778; &#xBC14;&#xC774;&#xB108;&#xB9AC; AcroRd32.exe&#xBD80;&#xD130; &#xC2DC;&#xC791;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;.  AcroRD32.dll &#xC8FC;&#xBCC0;&#xC758; (&#xC0C1;&#xB300;&#xC801;&#xC73C;&#xB85C;) &#xC587;&#xC740; wrapper&#xC774;&#xBA70; &#xB300;&#xB7B5; 30MB&#xC785;&#xB2C8;&#xB2E4;. AcroRD32.dll&#xC740; &#xB9CE;&#xC740; &#xCF54;&#xB4DC;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xC911; &#xC77C;&#xBD80;&#xB294; PDF &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xC5D0; &#xB300;&#xD55C; &#xD30C;&#xC11C;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xACE0; &#xB300;&#xBD80;&#xBD84;&#xC740; GUI &#xCF54;&#xB4DC;(&#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; GUI &#xCF54;&#xB4DC;&#xC5D0;&#xC120; &#xBC84;&#xADF8;&#xB97C; &#xCC3E;&#xC9C0; &#xC54A;&#xC74C;)&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>WinAFL&#xC740; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xD3EC;&#xB9F7;&#xC5D0; &#xD6A8;&#xACFC;&#xC801;&#xC774;&#xBBC0;&#xB85C; &#xD2B9;&#xC815; &#xD30C;&#xC11C;&#xB97C; &#xACF5;&#xACA9;&#xD558;&#xB294;&#xB370; &#xC9D1;&#xC911;&#xD558;&#xAE30;&#xB85C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB38;&#xC81C;&#xB294; &#xD30C;&#xC11C;&#xB97C; &#xCC3E;&#xC544;&#xC11C; &#xD30C;&#xC11C;&#xB97C; &#xC704;&#xD55C; harness&#xB97C; &#xC791;&#xC131;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. Harness&#xB780; &#xC815;&#xD655;&#xD788; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xC7A0;&#xC2DC; &#xD6C4;&#xC5D0; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC804;&#xCCB4; Reader &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xB85C;&#xB4DC;&#xD558;&#xC9C0; &#xC54A;&#xACE0;&#xB3C4; &#xB85C;&#xB4DC;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xD3EC;&#xB9F7;&#xC758; &#xD30C;&#xC11C;&#xB97C; &#xCC3E;&#xC544;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Acrobat&#xC758; &#xD3F4;&#xB354;&#xC5D0;&#xC11C; DLL&#xC744; &#xD0D0;&#xC0C9;&#xD55C; &#xACB0;&#xACFC; JP2KLib.dll&#xC774; &#xC774;&#xC0C1;&#xC801;&#xC778; &#xD0C0;&#xAC9F;&#xC784;&#xC744; &#xD655;&#xC778;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/2.png" srcset="/img/loading.gif" alt></p>
<p>JP2KLib.dll&#xC740; JPEG2000 &#xD3EC;&#xB9F7;&#xC758; &#xD30C;&#xC11C;&#xB85C; &#xC0C1;&#xB2F9;&#xD788; &#xC720;&#xC6A9;&#xD55C; &#xD568;&#xC218;&#xB97C; export &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/3.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xBC88; &#xC5F0;&#xAD6C;&#xC758; &#xD0C0;&#xAC9F;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Acrobat Reader DC &#x2264; 2018.011.238</p>
<p>JP2KLib.dll 1.2.2.39492</p>
<h1 id="What-is-a-Target-Function"><a href="#What-is-a-Target-Function" class="headerlink" title="What is a Target Function?"></a>What is a Target Function?</h1><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/googleprojectzero/winafl#how-to-select-a-target-function">&#xD0C0;&#xAC9F;&#xD568;&#xC218;</a>&#xB294; WinAFL&#xC774; &#xD37C;&#xC9D5; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xC5D4;&#xD2B8;&#xB9AC; &#xD3EC;&#xC778;&#xD2B8;&#xB85C; &#xC0AC;&#xC6A9;&#xB41C;&#xB294; &#xD568;&#xC218;&#xB97C; &#xB73B;&#xD569;&#xB2C8;&#xB2E4;. fuzz_iteration &#xD69F;&#xC218;&#xB9CC;&#xD07C; &#xBC18;&#xBCF5; &#xD638;&#xCD9C;&#xB418;&#xBA70; &#xAC01; &#xC2E4;&#xD589;&#xB9C8;&#xB2E4; input &#xD30C;&#xC77C;&#xC744; &#xBBA4;&#xD14C;&#xC774;&#xD2B8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD0C0;&#xAC9F; &#xD568;&#xC218;&#xB294;:</p>
<p>input &#xD30C;&#xC77C;&#xC744; &#xC5F4;&#xACE0;, &#xD30C;&#xC77C;&#xC744; &#xC77D;&#xACE0;, &#xD30C;&#xC77C;&#xC744; &#xD30C;&#xC2F1; &#xD55C; &#xD6C4; &#xB2EB;&#xC544;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>C++ exception &#xD639;&#xC740; TermainateProcess&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xB9AC;&#xD134;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7F0; &#xD568;&#xC218;&#xB97C; &#xCC3E;&#xAE30;&#xB780; &#xC27D;&#xC9C0; &#xC54A;&#xACE0; &#xB530;&#xB77C;&#xC11C; &#xBCF5;&#xC7A1;&#xD55C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; &#xD0C0;&#xAC9F;&#xC77C; &#xB550; &#xB300;&#xAC1C; harness&#xB97C; &#xC791;&#xC131;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="What-is-a-Harness"><a href="#What-is-a-Harness" class="headerlink" title="What is a Harness?"></a>What is a Harness?</h1><p>Harness&#xB294; &#xD37C;&#xC9D5; &#xD558;&#xB824;&#xB294; &#xD568;&#xC218;&#xB97C; &#xD2B8;&#xB9AC;&#xAC70;&#xD558;&#xB294; &#xC791;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC785;&#xB2C8;&#xB2E4;. Harness&#xB294; &#xD0C0;&#xAC9F; &#xD568;&#xC218;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C;&#xC740; WinAFL &#xB808;&#xD3EC;&#xC5D0; &#xD3EC;&#xD568;&#xB41C; gdiplus&#xC5D0; &#xB300;&#xD55C; &#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC81C; harness&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/4.png" srcset="/img/loading.gif" alt></p>
<p>main&#xC758; &#xCCAB; argument&#xB294; &#xACBD;&#xB85C;&#xC785;&#xB2C8;&#xB2E4;. &#xD568;&#xC218; &#xB0B4;&#xC5D0;&#xC11C; &#xD37C;&#xC9D5; &#xD558;&#xB824;&#xB294; API&#xC778; Image::Image parser&#xB97C; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;. &#xC624;&#xB958; &#xBC1C;&#xC0DD; &#xC2DC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC885;&#xB8CC;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xB9C8;&#xC9C0;&#xB9C9;&#xC5D0; &#xBAA8;&#xB4E0; &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xD574;&#xC81C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xBB38;&#xC11C;&#xD654;&#xB41C; API&#xC5D0;&#xC11C; &#xBE44;&#xAD50;&#xC801; &#xC27D;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB38;&#xC11C;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC0D8;&#xD50C; &#xCF54;&#xB4DC;&#xB97C; &#xBCF5;&#xC0AC;&#xD558;&#xAC70;&#xB098; &#xAC04;&#xB2E8;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xADF8;&#xB7EC;&#xBA74; &#xB108;&#xBB34; &#xC27D;&#xC8E0;?</p>
<p>Closed Source &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC778; Adobe Reader&#xB97C; &#xD0C0;&#xAC9F;&#xC73C;&#xB85C; &#xC120;&#xD0DD;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xD0C0;&#xAC9F;&#xC758; Harness &#xC791;&#xC131;&#xBC95;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xD37C;&#xC9D5; &#xD560;&#xB9CC;&#xD55C; &#xD568;&#xC218;&#xB97C; &#xCC3E;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xD1B5;&#xD574; &#xBD84;&#xC11D;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xD574;&#xB2F9; API&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC798; &#xC791;&#xB3D9;&#xD558;&#xB294; Harness&#xB97C; &#xB9CC;&#xB4E4; &#xB54C;&#xAE4C;&#xC9C0; &#xBC18;&#xBCF5;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
<p>&#xB2E4;&#xC74C; &#xC139;&#xC158;&#xC5D0;&#xC11C;&#xB294; JP2KLib.dll&#xC744; &#xB9AC;&#xBC84;&#xC2F1; &#xD558;&#xACE0; &#xC791;&#xB3D9;&#xD558;&#xB294; &#xD558;&#xB2C8;&#xC2A4;&#xB97C; &#xC791;&#xC131;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC790;&#xC138;&#xD788; &#xC124;&#xBA85;&#xD569;&#xB2C8;&#xB2E4;. &#xAC04;&#xB7B5;&#xD55C; &#xBC29;&#xBC95;&#xB860;&#xC5D0;&#xB9CC; &#xAD00;&#xC2EC;&#xC774; &#xC788;&#xB294; &#xB3C5;&#xC790;&#xB4E4;&#xC740; &#xB2E4;&#xC74C; &#xC139;&#xC158;&#xC73C;&#xB85C; &#xAC74;&#xB108;&#xB6F0;&#xC2DC;&#xAE38; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;.</p>
<h1 id="Writing-a-Harness-for-JP2KLib-dll"><a href="#Writing-a-Harness-for-JP2KLib-dll" class="headerlink" title="Writing a Harness for JP2KLib.dll"></a>Writing a Harness for JP2KLib.dll</h1><p>JP2KLib.dll&#xC758; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xAE30; &#xC804;&#xC5D0;, &#xBA3C;&#xC800; &#xD574;&#xB2F9; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xAC00; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC778;&#xC9C0; &#xD639;&#xC740; public &#xC2EC;&#xBCFC;&#xC744; &#xAC16;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;. &#xB9CE;&#xC740; &#xC2DC;&#xAC04;&#xC744; &#xC808;&#xC57D;&#xD560; &#xC218; &#xC788;&#xACE0; &#xC0DD;&#xAC01;&#xBCF4;&#xB2E4; &#xD754;&#xD55C; &#xC77C;&#xC774;&#xC9C0;&#xB9CC; &#xC800;&#xD76C;&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xC6B4;&#xC774; &#xBCC4;&#xB85C; &#xC88B;&#xC9C0; &#xC54A;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xD76C;&#xB294; Adobe Reader&#xAC00; JP2KLib&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xACFC; &#xCD5C;&#xB300;&#xD55C; &#xC720;&#xC0AC;&#xD55C; Harness&#xB97C; &#xC791;&#xC131;&#xD558;&#xACE0; &#xC2F6;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBA3C;&#xC800; &#xC801;&#xC808;&#xD55C; PDF&#xD30C;&#xC77C;&#xC744; &#xCC3E;&#xC544;&#xC57C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xD76C;&#xB294; &#xC81C;&#xD488; &#xD14C;&#xC2A4;&#xD2B8;&#xC6A9; PDF corpus&#xB97C; &#xB9CE;&#xC774; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xC911; JPEG2000&#xC6A9; PDF &#xD544;&#xD130;&#xC778; &#x201C;/JPXdecode&#x201D;&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; &#xAC00;&#xC7A5; &#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC81C;&#xB97C; &#xC0AC;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAD6C;&#xAE00;&#xB9C1; &#xB610;&#xB294; Abrocat Pro/Phantom PDF&#xB97C; &#xC0AC;&#xC6A9;&#xD574; testcase&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Pro Tip 1: reader&#xC5D0; &#xC0CC;&#xB4DC;&#xBC15;&#xC2A4;&#xAC00; &#xC788;&#xC5B4; debugging/triaging&#xC5D0; &#xC131;&#xAC00;&#xC2E0; &#xACBD;&#xC6B0;&#xAC00; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xC774; &#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xC124;&#xC808;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://forums.adobe.com/thread/2110951">https://forums.adobe.com/thread/2110951</a></p>
<p>Pro Tip 2: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/windows-hardware/drivers/debugger/gflags-and-pageheap">PageHeap</a>&#xC744; &#xC124;&#xC815;&#xD558;&#xC5EC; &#xD560;&#xB2F9; &#xC704;&#xCE58;&#xC640; &#xD06C;&#xAE30;&#xB97C; &#xCD94;&#xC801;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xB9AC;&#xBC84;&#xC2F1; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xC6D4;&#xD558;&#xAC8C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>PDF wrapper &#xC5C6;&#xC774;&#xB3C4; harness&#xC5D0; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC0D8;&#xD50C; &#xC911;&#xC5D0;&#xC11C; &#xCD94;&#xCD9C;&#xD558;&#xC5EC; jp2 &#xD30C;&#xC77C;&#xC744; &#xCD94;&#xCD9C;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB098;&#xC911;&#xC5D0; harness&#xC758; test input&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD560; &#xAC83;&#xB4E4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC791;&#xB3D9;&#xD558;&#xB294; &#xCD5C;&#xC18C; &#xC0D8;&#xD50C;&#xC744; &#xC5BB;&#xC5C8;&#xC73C;&#xB2C8; &#x201C;sxe ld jp2klib&#x201D;&#xC744; &#xC0AC;&#xC6A9;&#xD574; JP2KLib.dll&#xC774; &#xB85C;&#xB4DC;&#xB418;&#xB294; &#xC2DC;&#xC810;&#xC5D0; &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8;&#xB97C; &#xAC78;&#xC5B4;&#xC90D;&#xB2C8;&#xB2E4;. &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8;&#xAC00; &#xAC78;&#xB9AC;&#xBA74; JP2KLib&#xC758; &#xBAA8;&#xB4E0; export &#xD568;&#xC218;&#xC5D0; &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8;&#xB97C; &#xAC78;&#xC5B4; &#xC90D;&#xB2C8;&#xB2E4;. &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8; &#xBA85;&#xB839;&#xC5B4;&#xB294; &#xBAA8;&#xB4E0; call stack, &#xC778;&#xC790;, &#xB9AC;&#xD134; &#xAC12;&#xC744; &#xAE30;&#xB85D;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs bash">bm /a jp2klib!* &#x201C;.<span class="hljs-built_in">echo</span> callstack; k L5; .<span class="hljs-built_in">echo</span> parameters:;  dc esp L8;  .<span class="hljs-built_in">echo</span> <span class="hljs-built_in">return</span> value: ; pt; &#x201D;</code></pre>
<p>&#xC0D8;&#xD50C; PDF&#xB97C; &#xB85C;&#xB4DC;&#xD574; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; output&#xC744; &#xC5BB;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/5.png" srcset="/img/loading.gif" alt></p>
<p>JP2KLib&#xAC00; &#xB85C;&#xB4DC;&#xB41C; &#xD6C4; &#xCCAB; &#xBC88;&#xC9F8;&#xB85C; &#xD638;&#xCD9C;&#xB418;&#xB294; &#xD568;&#xC218;&#xB294; JP2KLibInitEx&#xC785;&#xB2C8;&#xB2E4;. JP2KLibInitEx&#xAC00; &#xBC1B;&#xB294; &#xC778;&#xC790;&#xB97C; &#xBD84;&#xC11D;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/6.png" srcset="/img/loading.gif" alt></p>
<p>AcrobRd32.dll&#xC758; &#xD568;&#xC218;&#xB97C; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xD3EC;&#xC778;&#xD2B8;&#xAC00; &#xB2F4;&#xAE34; 0x20 &#xD06C;&#xAE30;&#xC758; &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xC778;&#xC790;&#xB85C; &#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0C8;&#xB85C;&#xC6B4; &#xD568;&#xC218;&#xC5D0; &#xB3C4;&#xB2EC;&#xD588;&#xB2E4;&#xACE0; &#xBC14;&#xB85C; &#xBD84;&#xC11D;&#xD558;&#xB824;&#xB4E4;&#xBA74; &#xC548;&#xB429;&#xB2C8;&#xB2E4;. &#xADF8; &#xD568;&#xC218;&#xAC00; &#xD0C0;&#xAC9F; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C; &#xC4F0;&#xC77C;&#xC9C0; &#xBAA8;&#xB974;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xC6B0;&#xC120; &#x201C;nopX&#x201D;(X&#xB294; &#xC22B;&#xC790;)&#xB77C;&#xB294; &#xC774;&#xB984;&#xC73C;&#xB85C; &#xBE48; &#xD568;&#xC218; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xAD6C;&#xC870;&#xCCB4;&#xC5D0; &#xB123;&#xC5B4;&#xB193;&#xACE0; Harness&#xC758; &#xBF08;&#xB300;&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<ol>
<li>Command line argument&#xB85C;&#xBD80;&#xD130; input file&#xC744; &#xBC1B;&#xB294;&#xB2E4;.</li>
<li>JP2KLib.dll&#xC744; &#xB85C;&#xB4DC;&#xD55C;&#xB2E4;.</li>
<li>&#xB9CC;&#xB4E4;&#xC5B4;&#xB454; &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xC778;&#xC790;&#xB85C; JP2KLibInitEx&#xB97C; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
<p><img src="/2021/07/04/fabu1ous/50cve/7.png" srcset="/img/loading.gif" alt></p>
<p>LOAD_FUNC&#xB294; &#xC800;&#xD76C;&#xAC00; &#xC791;&#xC131;&#xD55C; &#xB9E4;&#xD06C;&#xB85C;&#xC785;&#xB2C8;&#xB2E4;. nopX &#xD568;&#xC218;&#xB97C; &#xC124;&#xC815;&#xD558;&#xB294; NOP&#xB9E4;&#xD06C;&#xB85C;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/8.png" srcset="/img/loading.gif" alt></p>
<p>&#xCEF4;&#xD30C;&#xC77C;&#xD558;&#xACE0; sample.jp2&#xC640; &#xD568;&#xAED8; &#xC2E4;&#xD589;&#xD574;&#xBCF4;&#xBA74; &#xC798; &#xC791;&#xB3D9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#x201C;g&#x201D;&#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xD1B5;&#xD574; &#xB2E4;&#xC74C; &#xD568;&#xC218;&#xB85C; &#xB118;&#xC5B4;&#xAC00; &#xBD05;&#xC2DC;&#xB2E4;. &#xB2E4;&#xC74C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xD568;&#xC218;&#xB294; JP2KGetMemObjEx&#xC774;&#xACE0; &#xC5B4;&#xB5A0;&#xD55C; &#xC778;&#xC790;&#xB3C4; &#xBC1B;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xD638;&#xCD9C;&#xD558;&#xACE0; &#xB9AC;&#xD134; &#xAC12;&#xB9CC; &#xC800;&#xC7A5;&#xD569;&#xC2DC;&#xB2E4;.</p>
<p>&#xADF8;&#xB2E4;&#xC74C; &#xD568;&#xC218;&#xC778; JP2KDecOptCreat &#xB610;&#xD55C; &#xC778;&#xC790;&#xB97C; &#xBC1B;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xD638;&#xCD9C;&#xD558;&#xACE0; &#xB9AC;&#xD134; &#xAC12;&#xB9CC; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. JP2KDecOptCreat &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; nop4&#xC640; nop7 &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294;&#xAD70;&#xC694;. &#xB530;&#xB77C;&#xC11C; &#xAC01;&#xAC01; &#xAD6C;&#xD604;&#xC744; &#xD574;&#xC918;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC81C; nop4&#xAC00; &#xC5B4;&#xB5A4; &#xB3D9;&#xC791;&#xC744; &#xD558;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xB0B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. nop4&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; &#xC2E4;&#xC81C; &#xD568;&#xC218; AcroRd32!CTJPEGDecoderRelease+0xa992 &#xC5D0; &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8;&#xB97C; &#xAC78;&#xC5B4;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/9.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xACC4;&#xC18D; &#xC2E4;&#xD589;&#xD558;&#xB2E4;&#xBCF4;&#xBA74;</p>
<p><img src="/2021/07/04/fabu1ous/50cve/10.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xACF3;&#xC5D0; &#xB3C4;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/11.png" srcset="/img/loading.gif" alt></p>
<p>&#xC989;, nop4&#xB294; malloc&#xC758; wrapper&#xD568;&#xC218;&#xC785;&#xB2C8;&#xB2E4;. &#xC800;&#xD76C;&#xAC00; &#xC9C1;&#xC811; &#xAD6C;&#xD604;&#xD55C; &#xB4A4; nop4&#xC640; &#xBC14;&#xAFD4;&#xC90D;&#xB2C8;&#xB2E4;. nop7(memset), nop5(free), nop6(memcpy)&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB3C4; &#xB3D9;&#xC77C;&#xD55C; &#xC791;&#xC5C5;&#xC744; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB2E4;&#xC74C; &#xD568;&#xC218;&#xC778; JP2KDecOptInitToDefaults &#xC778;&#xC790;&#xB97C; &#xBC1B;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD638;&#xCD9C;&#xD558;&#xACE0; &#xB9AC;&#xD134; &#xAC12;&#xC744; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD604;&#xC7AC; harness&#xC758; &#xBAA8;&#xC2B5;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/12.png" srcset="/img/loading.gif" alt></p>
<p>&#xB2E4;&#xC74C; &#xD568;&#xC218;&#xC778; JP2KImageInitDecoderEx&#xB294; 5&#xAC1C;&#xC758; &#xC778;&#xC790;&#xB97C; &#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>5&#xAC1C;&#xC758; &#xC778;&#xC790; &#xC911; 3&#xAC1C;&#xB294; JP2KImageCreate, JP2KDecOptCreate, JP2KGetMemObjEx&#xC758; &#xB9AC;&#xD134; &#xAC12;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC138; &#xBC88;&#xC9F8; &#xC778;&#xC790;&#xB294; vtable&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xD3EC;&#xC778;&#xD130;&#xC785;&#xB2C8;&#xB2E4;. &#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xC0AC;&#xC6A9;&#xD55C; &#xD2B8;&#xB9AD;&#xC744; &#xB611;&#xAC19;&#xC774; &#xBC18;&#xBCF5;&#xD569;&#xB2C8;&#xB2E4;. nop&#xC744; &#xB2F4;&#xACE0; &#xC788;&#xB294; &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xC778;&#xC790;&#xB85C; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB450; &#xBC88;&#xC9F8; &#xC778;&#xC790;&#xB294; &#xAD6C;&#xC870;&#xCCB4;&#xC785;&#xB2C8;&#xB2E4;. &#xD568;&#xC218; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC0C1;&#xC218;&#xAC12; 0xbaaddaab&#xB97C; &#xBCF4;&#xB0B4;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xD604;&#xC7AC; harness&#xC758; &#xBAA8;&#xC2B5;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/13.png" srcset="/img/loading.gif" alt></p>
<p>harness&#xB97C; &#xC2E4;&#xD589;&#xD574;&#xBCF4;&#xB2C8; nop10&#xC73C;&#xB85C; &#xB3C4;&#xB2EC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. nop10&#xC758; &#xC2E4;&#xC81C; &#xD568;&#xC218;&#xC5D0; &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8;&#xB97C; &#xAC78;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; call stack&#xC744; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/14.png" srcset="/img/loading.gif" alt></p>
<p>JP2KCodeStm::IsSeekable&#xB97C; IDA&#xB85C; &#xC0B4;&#xD3B4;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/15.png" srcset="/img/loading.gif" alt></p>
<p>JP2KCodeStm&#xC758; 0x24 &#xC624;&#xD504;&#xC14B;&#xC5D0; &#xC774;&#xC804; &#xB2E8;&#xACC4;&#xC5D0; &#xB123;&#xC5B4;&#xC900; vtable&#xC774;, 0x18 &#xC624;&#xD504;&#xC14B;&#xC5D0; 0xbaaddaab &#xC0C1;&#xC218;&#xAC12;&#xC774; &#xC788;&#xB294; &#xAC83;&#xC744; Windbg&#xB85C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. JP2KCodeStm::IsSeekable&#xC740; 0xbaaddaab&#xB97C; &#xC778;&#xC790;&#xB85C; vtable&#xC5D0; &#xC788;&#xB294; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC01; &#xD30C;&#xC11C;&#xB9C8;&#xB2E4; &#xB2E4;&#xB974;&#xACA0;&#xC9C0;&#xB9CC; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC775;&#xC219;&#xD55C; &#xD30C;&#xC77C; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;(FILE/ifstream)&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; input stream&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC77C;&#xC885;&#xC758; input stream(network/file/memory) &#xCD94;&#xC0C1;&#xD654;&#xC785;&#xB2C8;&#xB2E4;. &#xC800;&#xD76C;&#xB294; JP2KCodeStm&#xC758; &#xB3D9;&#xC791;&#xC744; &#xBCF4;&#xACE0; &#xBC14;&#xB85C; &#xC54C;&#xC544;&#xCC28;&#xB838;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>0xbaaddaab&#xB294; &#xC2A4;&#xD2B8;&#xB9BC; &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xC774;&#xACE0; vtable&#xC740; &#xADF8; &#xC2A4;&#xD2B8;&#xB9BC; &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xC5D0; &#xB300;&#xD55C; &#xD568;&#xC218;&#xB4E4;&#xC785;&#xB2C8;&#xB2E4;. IDA&#xB85C; &#xB3CC;&#xC544;&#xAC00; JP2KCodeStm::XXX &#xD568;&#xC218;&#xB4E4;&#xC744; &#xD655;&#xC778;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/16.png" srcset="/img/loading.gif" alt></p>
<p>&#xB300;&#xBD80;&#xBD84; &#xC720;&#xC0AC;&#xD55C; &#xBC29;&#xC2DD;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC9C1;&#xC811; &#xD30C;&#xC77C; &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xB97C; &#xB9CC;&#xB4E4;&#xACE0; &#xD544;&#xC694;&#xD55C; &#xBA54;&#xC18C;&#xB4DC;&#xB97C; &#xAD6C;&#xD604;&#xD574;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/17.png" srcset="/img/loading.gif" alt></p>
<p>&#xC624;&#xB958;&#xAC00; &#xB098;&#xBA74; &#xBC84;&#xB9AC;&#xACE0; &#xC544;&#xB2C8;&#xB77C;&#xBA74; JP2KImageInitDecoderEx&#xC758; &#xB9AC;&#xD134; &#xAC12;&#xC744; &#xAC80;&#xC0AC;&#xD558;&#xB3C4;&#xB85D; &#xB9CC;&#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. JP2KImageInitDecoderEx&#xC740; &#xC131;&#xACF5; &#xC2DC; 0&#xC744; &#xB9AC;&#xD134;&#xD569;&#xB2C8;&#xB2E4;. &#xC2A4;&#xD2B8;&#xB9BC; &#xD568;&#xC218;&#xB97C; &#xAD6C;&#xD604;&#xD558;&#xB294;&#xB370; &#xBA87; &#xBC88;&#xC758; &#xC2DC;&#xD589;&#xCC29;&#xC624;&#xAC00; &#xC788;&#xC5C8;&#xC9C0;&#xB9CC; &#xC6D0;&#xD558;&#xB358; &#xB9AC;&#xD134; &#xAC12;&#xC744; &#xC5BB;&#xB294; &#xB370; &#xC131;&#xACF5;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C; &#xD568;&#xC218;&#xC778; JP2KImageDataCreate&#xB294; &#xC778;&#xC790;&#xB97C; &#xBC1B;&#xC9C0; &#xC54A;&#xC73C;&#xBA70; &#xB9AC;&#xD134; &#xAC12;&#xC744; &#xADF8;&#xB2E4;&#xC74C; &#xD568;&#xC218;&#xC778; JP2KImageGetMaxRes&#xC5D0; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;. &#xD638;&#xCD9C;&#xD558;&#xACE0; &#xB118;&#xC5B4;&#xAC11;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C;&#xC740; 7&#xAC1C;&#xC758; &#xC778;&#xC790;&#xB97C; &#xBC1B;&#xB294; JP2KImageDecodeTileInterleaved &#xD568;&#xC218;&#xC785;&#xB2C8;&#xB2E4;. 7&#xAC1C;&#xC758; &#xC778;&#xC790; &#xC911; 3&#xAC1C;&#xB294; JP2KImageCreate, JP2KImageGetMaxRes, JP2KImageDataCreate&#xC758; &#xB9AC;&#xD134; &#xAC12;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>IDA&#xB85C; &#xD655;&#xC778;&#xD574;&#xBCF8; &#xACB0;&#xACFC; &#xB450; &#xBC88;&#xC9F8; &#xADF8;&#xB9AC;&#xACE0; 6&#xBC88;&#xC9F8; &#xC778;&#xC790;&#xB294; NULL&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB124; &#xBC88;&#xC9F8;, &#xB2E4;&#xC12F; &#xBC88;&#xC9F8; &#xC778;&#xC790;&#xB294; color depth&#xC640; &#xAD00;&#xB828;&#xB41C; &#xC778;&#xC790;&#xB85C; &#xC800;&#xD76C;&#xB294; &#xC774; &#xB450; &#xAC12;&#xC774; &#xACE0;&#xC815;&#xB41C; &#xCCB4;&#xB85C; &#xD37C;&#xC9D5;&#xC744; &#xD558;&#xAE30;&#xB85C; &#xACB0;&#xC815;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/18.png" srcset="/img/loading.gif" alt></p>
<p>&#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; JP2KImageDataDestroy, JP2KImageDestroy, JP2KDecOptDestroy &#xD568;&#xC218;&#xB4E4;&#xC744; &#xD638;&#xCD9C;&#xD574; &#xC800;&#xD76C;&#xAC00; &#xB9CC;&#xB4E0; &#xC624;&#xD504;&#xC81D;&#xD2B8;&#xB4E4;&#xC744; &#xD574;&#xC81C;&#xD574; memory leak&#xC744; &#xBC29;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xC791;&#xC5C5;&#xC740; WinAFL&#xB85C; fuzz_iterations&#xAC00; &#xB192;&#xC740; &#xC791;&#xC5C5;&#xC744; &#xD560; &#xB54C; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC790; &#xC774;&#xC81C; &#xC798; &#xC791;&#xB3D9;&#xD558;&#xB294; Harness&#xB97C; &#xC644;&#xC131;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xC544;&#xC8FC; &#xC0AC;&#xC18C;&#xD55C; &#xC218;&#xC815;&#xC744; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;. JP2KLib&#xC744; &#xB85C;&#xB4DC;&#xD558;&#xACE0; &#xD544;&#xC694;&#xD55C; &#xD568;&#xC218;&#xB97C; &#xBC1B;&#xC544;&#xC624;&#xB294; &#xCD08;&#xAE30;&#xD654; &#xC791;&#xC5C5;&#xC744; &#xBD84;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xB9E4; &#xC2E4;&#xD589;&#xB9C8;&#xB2E4; &#xCD08;&#xAE30;&#xD654; &#xC791;&#xC5C5;&#xC744; &#xB2E4;&#xC2DC; &#xD574; &#xC904; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xC73C;&#xB2C8; &#xC774;&#xB97C; &#xBD84;&#xB9AC;&#xD574;&#xC90C;&#xC73C;&#xB85C;&#xC368; &#xC2E4;&#xD589; &#xC18D;&#xB3C4;&#xB97C; &#xD5A5;&#xC0C1;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0C8;&#xB85C;&#xC6B4; &#xD568;&#xC218;&#xC5D0; fuzzme&#xB77C;&#xB294; &#xC774;&#xB984;&#xC744; &#xC9C0;&#xC5B4;&#xC8FC;&#xACE0; export &#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xC720;&#xD6A8;&#xD55C; &#xC624;&#xD504;&#xC14B;&#xC744; &#xAD6C;&#xD558;&#xB294; &#xAC83;&#xBCF4;&#xB2E4; export &#xD558;&#xB294; &#xAC83;&#xC774; &#xD6E8;&#xC52C; &#xC27D;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="Fuzzing-Methodology"><a href="#Fuzzing-Methodology" class="headerlink" title="Fuzzing Methodology"></a>Fuzzing Methodology</h1><ol>
<li>Basic tests for the harness<ol>
<li>Stability</li>
<li>Paths</li>
<li>Timeouts</li>
</ol>
</li>
<li>Fuzzing Setup</li>
<li>Initial corpus</li>
<li>Initial line coverage</li>
<li>Fuzzing loop<ol>
<li>Fuzz</li>
<li>Check coverage / crashes</li>
<li>cmin &amp; repeat</li>
</ol>
</li>
<li>Triage</li>
</ol>
<h1 id="Basic-Tests-for-the-Harness"><a href="#Basic-Tests-for-the-Harness" class="headerlink" title="Basic Tests for the Harness"></a>Basic Tests for the Harness</h1><p>&#xD37C;&#xC9D5;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xAE30; &#xC55E;&#xC11C; &#xBA87; &#xAC00;&#xC9C0; sanity test&#xB97C; &#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xC800; &#xC11C;&#xBC84;&#xC2E4; &#xC628;&#xB3C4;&#xB9CC; &#xB192;&#xC774;&#xB294; &#xC77C;&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xC73C;&#xB2C8;. &#xCCAB; &#xBC88;&#xC9F8;&#xB85C; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD560; &#xAC83;&#xC740; &#xD37C;&#xC800;&#xAC00; &#xC0C8;&#xB85C;&#xC6B4; &#xC2E4;&#xD589; path&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xB294;&#xAC00;&#xC785;&#xB2C8;&#xB2E4;. &#xC989;, total path count&#xAC00; &#xAFB8;&#xC900;&#xD788; &#xC0C1;&#xC2B9;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9CC;&#xC57D; path count&#xAC00; 0&#xC774;&#xAC70;&#xB098; &#xAC70;&#xC758; 0&#xC774;&#xB77C;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xD568;&#xC815;&#xB4E4;&#xC744; &#xC870;&#xC0AC;&#xD574;&#xBD10;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xC5D0; &#xC758;&#xD574; &#xD0C0;&#xAC9F;&#xD568;&#xC218;&#xAC00; &#xC778;&#xB77C;&#xC778; &#xCC98;&#xB9AC;&#xB418;&#xC5B4; WinAFL&#xC774; &#xB3C4;&#xB2EC;&#xD558;&#xC9C0; &#xBABB;&#xD55C;&#xB2E4;.</li>
<li>&#xC778;&#xC790; &#xAC1C;&#xC218;&#xB098; &#xD568;&#xC218; &#xD638;&#xCD9C; &#xADDC;&#xC57D;&#xC774; &#xC798;&#xBABB;&#xB410;&#xB2E4;.</li>
<li>&#xD0C0;&#xC784;&#xC544;&#xC6C3;&#xC774; &#xB108;&#xBB34; &#xB0AE;&#xC544; harness&#xAC00; &#xB108;&#xBB34; &#xC77C;&#xCC0D; &#xC885;&#xB8CC;&#xB41C;&#xB2E4;.</li>
</ul>
<p>&#xD37C;&#xC800;&#xB97C; &#xBA87; &#xBD84; &#xC815;&#xB3C4; &#xC2E4;&#xD589;&#xD55C; &#xB4A4; &#xC548;&#xC815;&#xC131;&#xC744; &#xD655;&#xC778;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC548;&#xC815;&#xC131;&#xC774; &#xB0AE;&#xC544;(80% &#xBBF8;&#xB9CC;) &#xC774;&#xC288;&#xB97C; &#xB514;&#xBC84;&#xAE45;&#xD574;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. Harness&#xC758; &#xC548;&#xC815;&#xC131;&#xC740; &#xD37C;&#xC800;&#xC758; &#xC131;&#xB2A5;&#xACFC; &#xC9C1;&#xACB0;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB9E4;&#xC6B0; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD754;&#xD788; &#xBE60;&#xC9C0;&#xB294; &#xD568;&#xC815;&#xB4E4;</p>
<ul>
<li>&#xB09C;&#xC218; element&#xB4E4;&#xC744; &#xD655;&#xC778;&#xD574;&#xBD10;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xBA87;&#xBA87; hash table&#xB4E4;&#xC740; collision&#xC744; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB09C;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; coverage&#xC758; &#xC815;&#xD655;&#xB3C4;&#xB97C; &#xB5A8;&#xC5B4;&#xB728;&#xB9AC;&#xB294; &#xC791;&#xC5C5;&#xC774;&#xBBC0;&#xB85C; &#xB09C;&#xC218;&#xC758; seed&#xB97C; &#xC0C1;&#xC218;&#xAC12;&#xC73C;&#xB85C; &#xACE0;&#xC815;&#xC2DC;&#xD0A4;&#xB294; &#xD328;&#xCE58;&#xB97C; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</li>
<li>&#xBA87;&#xBA87; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; &#xD2B9;&#xC815; global object&#xC5D0; &#xB300;&#xD55C; cach&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. nop run&#xC744; &#xD1B5;&#xD574; &#xC774;&#xB97C; &#xBC29;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>Windows 10 64-bit &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#xB3CC;&#xC544;&#xAC00;&#xB294; 32-bit &#xD0C0;&#xAC9F;&#xC758; stack alignment&#xB294; &#xD56D;&#xC0C1; 8&#xC774; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; memcpy&#xB97C; &#xD3EC;&#xD568;&#xD55C; &#xB2E4;&#xB978; AVX &#xCD5C;&#xC801;&#xD654; &#xCF54;&#xB4DC;&#xB4E4;&#xC758; &#xB3D9;&#xC791;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xC8FC;&#xBA70; coverage &#xB610;&#xD55C; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;. harness&#xC5D0; stack aligne&#xC744; &#xB9DE;&#xCD94;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xCD94;&#xAC00;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xD574;&#xACB0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xB9CC;&#xC57D; &#xC704; &#xBC29;&#xBC95;&#xC774; &#xBAA8;&#xB450; &#xC2E4;&#xD328;&#xD55C;&#xB2E4;&#xBA74; DynamoRIO&#xB97C; &#xC0AC;&#xC6A9;&#xD574; harness&#xC758; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC744; &#xCD94;&#xC801;&#xD558;&#xACE0; output&#xC744; &#xBE44;&#xAD50;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="Fuzzing-Setup"><a href="#Fuzzing-Setup" class="headerlink" title="Fuzzing Setup"></a>Fuzzing Setup</h1><p>&#xC800;&#xD76C;&#xB294; &#xB2E4;&#xC74C; &#xACFC; &#xAC19;&#xC740; VM&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>8~16 core, 32 GB of RAM, Windows 10 x64</p>
<p>&#xC800;&#xD76C;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://sourceforge.net/projects/imdisk-toolkit/">ImDisk toolkit</a>&#xC744; &#xC0AC;&#xC6A9;&#xD574; RAM disk drive&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xBE60;&#xB978; &#xD0C0;&#xAC9F;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xB514;&#xC2A4;&#xD06C;&#xC5D0; test case&#xB97C; &#xC791;&#xC131;&#xD558;&#xB294; &#xAC83;&#xC740; &#xBCD1;&#xBAA9; &#xD604;&#xC0C1;&#xC744; &#xC720;&#xBC1C;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Windows Defender &#xB610;&#xD55C; &#xC131;&#xB2A5;&#xC5D0; &#xC545;&#xC601;&#xD5A5;&#xC744; &#xB07C;&#xCE58;&#xB2C8; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. WinAFL&#xC774; &#xC0DD;&#xC131;&#xD558;&#xB294; test case&#xB4E4; &#xC911; Windows Defender&#xC5D0;&#xC11C; &#xC54C;&#xB824;&#xC9C4; exploit&#xC73C;&#xB85C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/19.png" srcset="/img/loading.gif" alt></p>
<p>Windows Indexing Service&#xB3C4; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xD37C;&#xC9D5; &#xB3C4;&#xC911; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xC7AC;&#xC2DC;&#xC791;&#xD558;&#xAC70;&#xB098; &#xD37C;&#xC9D5; &#xD558;&#xB358; dll&#xC744; &#xB300;&#xCCB4;&#xD558;&#xB294; &#xB4F1;&#xC758; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xC73C;&#xB2C8; Windows Update&#xB3C4; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xBC84;&#xADF8; &#xD0D0;&#xC0C9;&#xC5D0; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xBBC0;&#xB85C; harness &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xB300;&#xD55C; page heap&#xC740; &#xD65C;&#xC131;&#xD654;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xC18D;&#xB3C4;&#xB294; &#xB290;&#xB9AC;&#xC9C0;&#xB9CC; &#xBC84;&#xADF8; &#xD0D0;&#xC0C9;&#xC5D0; &#xD6A8;&#xACFC;&#xC801;&#xC774;&#xB77C;&#xB294; edge coverage type&#xC744; &#xC0AC;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD37C;&#xC9D5;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xBA85;&#xB839;&#xC5B4;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs bash">afl-fuzz.exe -i R:\\jp2k\\<span class="hljs-keyword">in</span> -o R:\\jp2k\\out -t 20000+ -D c:\\DynamoRIO-Windows-7.0.0-RC1\\bin32 -S Slav02 &#x2014; -fuzz_iterations 10000 -coverage_module JP2KLib.dll -target_module adobe_jp2k.exe -target_method fuzzme -nargs 1 -covtype edge &#x2014; adobe_jp2k.exe @@</code></pre>
<h1 id="Initial-Corpus"><a href="#Initial-Corpus" class="headerlink" title="Initial Corpus"></a>Initial Corpus</h1><p>Harness&#xB97C; &#xC644;&#xC131;&#xD588;&#xB2E4;&#xBA74; &#xC544;&#xB798; &#xBC29;&#xBC95;&#xB4E4;&#xB85C; &#xCD08;&#xAE30; corpus&#xB97C; &#xD655;&#xBCF4;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Online corpuses ( <a target="_blank" rel="external nofollow noopener noreferrer" href="https://lcamtuf.coredump.cx/afl/demo/">afl corpus</a>, <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/uclouvain/openjpeg-data">openjpeg-data</a> )</li>
<li>Test suites from open source projects</li>
<li>Crawlling google / duckduckgo</li>
<li>Corpuses from our older fuzzing projects</li>
</ul>
<h1 id="Corpus-Minimization"><a href="#Corpus-Minimization" class="headerlink" title="Corpus Minimization"></a>Corpus Minimization</h1><p>&#xB3D9;&#xC77C;&#xD55C; coverage&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xC6A9;&#xB7C9;&#xC774; &#xD070; &#xD30C;&#xC77C;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xD37C;&#xC800;&#xC758; &#xC131;&#xB2A5;&#xC774; &#xC800;&#xD558;&#xB429;&#xB2C8;&#xB2E4;. AFL&#xC740; &#xC774;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574; afl-cmin&#xC744; &#xC0AC;&#xC6A9;&#xD574; corpus&#xB97C; &#xAC04;&#xC18C;&#xD654; &#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;. WinAFL&#xC740; winafl-cmin.py&#xB77C;&#xB294; &#xD234;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD655;&#xBCF4;&#xD55C; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC744; winafl-cmin.py&#xC5D0; &#xB123;&#xACE0; &#xAC04;&#xC18C;&#xD654;&#xB41C; corpus&#xB97C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC19;&#xC740; &#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD574; winafl-cmin&#xC744; &#xB450; &#xBC88; &#xB3CC;&#xB824;&#xBCF4;&#xACE0; &#xAC19;&#xC740; &#xACB0;&#xACFC;&#xAC00; &#xB098;&#xC624;&#xB294;&#xC9C0; &#xBE44;&#xAD50;&#xD574;&#xBD10;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xB450; &#xACB0;&#xACFC;&#xAC00; &#xB2E4;&#xB974;&#xB2E4;&#xBA74; harness&#xAC00; &#xBE44;&#xACB0;&#xC815;&#xB860; &#xBB38;&#xC81C;&#xB97C; &#xC548;&#xACE0; &#xC788;&#xB2E4;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="Initial-Line-Coverage"><a href="#Initial-Line-Coverage" class="headerlink" title="Initial Line Coverage"></a>Initial Line Coverage</h1><p>Corpus&#xB97C; &#xC5BB;&#xC5C8;&#xC73C;&#xB2C8; &#xC774;&#xC820; line coverage&#xB97C; &#xC0B4;&#xD3B4;&#xBCFC; &#xCC28;&#xB840;&#xC785;&#xB2C8;&#xB2E4;. Line coverage&#xB780; &#xC2E4;&#xC81C;&#xB85C; &#xC2E4;&#xD589;&#xB41C; &#xC5B4;&#xC148;&#xBE14;&#xB9AC; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC744; &#xB73B;&#xD569;&#xB2C8;&#xB2E4;. DynamoRIO&#xB97C; &#xC0AC;&#xC6A9;&#xD574; line coverage&#xB97C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs bash">[dynamoriodir]\\bin32\\drrun.exe -t drcov &#x2014; harness.exe testcase</code></pre>
<p>&#xAC01; test case&#xC5D0; &#xB300;&#xD574; &#xC704; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xACB0;&#xACFC;&#xAC12;&#xC744; IDA <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/gaasedelen/lighthouse">Lighthouse</a>&#xB85C; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/20.png" srcset="/img/loading.gif" alt>&#xB294;&#xB370; &#xB3C4;&#xC6C0;&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h1 id="Fuzzing-Cycle"><a href="#Fuzzing-Cycle" class="headerlink" title="Fuzzing Cycle"></a>Fuzzing Cycle</h1><p>&#xB2E4;&#xC74C; &#xB2E8;&#xACC4;&#xB294; &#xB9E4;&#xC6B0; &#xAC04;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xD37C;&#xC800;&#xB97C; &#xC2E4;&#xD589;&#xD55C;&#xB2E4;.</li>
<li>Coverage&#xC640; Crash &#xBD84;&#xC11D;</li>
<li>Coverage &#xC870;&#xC0AC;, cmin &#xADF8;&#xB9AC;&#xACE0; &#xBC18;&#xBCF5;</li>
</ol>
<p>&#xD37C;&#xC800;&#xB97C; &#xB3CC;&#xB9AC;&#xB294; &#xAC83;&#xC740; &#xD2B9;&#xBCC4;&#xD788; &#xC5B4;&#xB824;&#xC6B4; &#xC77C;&#xC774; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xC704;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD55C; &#xAD6C;&#xC131;&#xB300;&#xB85C; &#xD37C;&#xC800;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xAE30;&#xB9CC; &#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xD76C;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xAE30;&#xB2A5;&#xC758; &#xBD07;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xBAA8;&#xB4E0; &#xD37C;&#xC800;&#xC758; &#xC0C1;&#xD0DC;(<a target="_blank" rel="external nofollow noopener noreferrer" href="http://winafl-whatsapp.py">winafl-whatsapp.py</a>)</li>
<li>&#xAC01; &#xD37C;&#xC800;&#xC758; &#xC2DC;&#xAC04;&#xC5D0; &#xB530;&#xB978; path &#xBCC0;&#xD654; &#xADF8;&#xB798;&#xD504;</li>
<li>Crash triage (&#xB2E4;&#xC74C; &#xC139;&#xC158;&#xC5D0;&#xC11C; &#xB2E4;&#xB8F8;)</li>
<li>&#xBA48;&#xCD98; &#xD37C;&#xC800; &#xC7AC;&#xC2DC;&#xC791;</li>
</ol>
<p>&#xC704; &#xC791;&#xC5C5;&#xB4E4;&#xC744; &#xC790;&#xB3D9;&#xD654;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC5BC;&#xB9C8;&#xB098; &#xC911;&#xC694;&#xD55C;&#xC9C0; &#xAD73;&#xC774; &#xC124;&#xBA85;&#xD560; &#xD544;&#xC694;&#xB294; &#xC5C6;&#xACA0;&#xC8E0;? &#xD37C;&#xC9D5;&#xC740; &#xC9C0;&#xB8E8;&#xD558;&#xACE0; &#xC624;&#xB958;&#xAC00; &#xB118;&#xCE58;&#xB294; &#xC791;&#xC5C5;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xD37C;&#xC800;&#xC758; &#xC0C1;&#xD0DC;&#xC640; path&#xB97C; &#xBA87; &#xC2DC;&#xAC04; &#xC8FC;&#xAE30;&#xB85C; &#xD655;&#xC778;&#xD558;&#xACE0; &#xADF8;&#xB798;&#xD504;&#xC5D0; &#xC0C1;&#xC2B9;&#xC138;&#xAC00; &#xBCF4;&#xC778;&#xB2E4;&#xBA74; coverage&#xB97C; &#xC870;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/21.png" srcset="/img/loading.gif" alt></p>
<p>&#xBAA8;&#xB4E0; &#xD37C;&#xC800;&#xC758; &#xBAA8;&#xB4E0; queue&#xB97C; &#xBAA8;&#xC544; cmin&#xC744; &#xAC70;&#xCE58;&#xACE0; &#xADF8; &#xACB0;&#xACFC;&#xB97C; IDA&#xB85C; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. &#xC0C1;&#xB300;&#xC801;&#xC73C;&#xB85C; coverage&#xAC00; &#xC791;&#xC73C;&#xBA74;&#xC11C; &#xD06C;&#xAE30;&#xAC00; &#xD070; &#xD568;&#xC218;&#xB97C; &#xCC3E;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC01; &#xD568;&#xC218;&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xC774;&#xD574;&#xD558;&#xB824; &#xB178;&#xB825;&#xD558;&#xACE0; &#xAC01; &#xC0D8;&#xD50C;&#xC774; &#xC5B4;&#xB5A4; &#xAE30;&#xB2A5;&#xC744; &#xD2B8;&#xB9AC;&#xAC70;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xBC88; &#xB2E8;&#xACC4;&#xB294; &#xB9E4;&#xC6B0; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xB098;&#xC758; &#xC0D8;&#xD50C;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xACE0; &#xBA87; &#xC2DC;&#xAC04;&#xC758; &#xD37C;&#xC9D5;&#xC744; &#xD1B5;&#xD574; &#xC0C8;&#xB85C;&#xC6B4; &#xCDE8;&#xC57D;&#xC810; 3&#xAC1C;&#xB97C; &#xCC3E;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Coverage&#xAC00; &#xB354; &#xC774;&#xC0C1; &#xB298;&#xC5B4;&#xB098;&#xC9C0; &#xC54A;&#xC744; &#xB54C;&#xAE4C;&#xC9C0; &#xC774; &#xC0AC;&#xC774;&#xD074;&#xC744; &#xBC18;&#xBCF5;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. Coverage&#xAC00; &#xB298;&#xC5B4;&#xB098;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xB73B;&#xC740; &#xD0C0;&#xAC9F;&#xC744; &#xBCC0;&#xACBD;&#xD558;&#xAC70;&#xB098; harness&#xB97C; &#xAC1C;&#xC120;&#xD574;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h1 id="Triage"><a href="#Triage" class="headerlink" title="Triage"></a>Triage</h1><p>Crash&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xB294; test case&#xB97C; &#xC5BB;&#xC73C;&#xBA74; &#xC9C1;&#xC811; crash&#xC640; &#xADF8; &#xC785;&#xB825;&#xAC12;&#xC744; &#xBD84;&#xC11D;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC911;&#xBCF5;&#xB41C; &#xACB0;&#xACFC;&#xAC00; &#xB9CE;&#xC544; &#xBE60;&#xB974;&#xAC8C; &#xC804;&#xB7B5;&#xC744; &#xBC14;&#xAFE8;&#xC2B5;&#xB2C8;&#xB2E4;. <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/SkyLined/BugId">Bugld</a>&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC911;&#xBCF5;&#xB41C; &#xACB0;&#xACFC;&#xB97C; &#xC0DD;&#xB7B5;&#xD558;&#xACE0; unique crash&#xC5D0; &#xB300;&#xD55C; minimize &#xC791;&#xC5C5;&#xC744; &#xC790;&#xB3D9;&#xD654;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/04/fabu1ous/50cve/22.png" srcset="/img/loading.gif" alt></p>
<h1 id="What-We-Found"><a href="#What-We-Found" class="headerlink" title="What We Found"></a>What We Found</h1><p>&#xC774;&#xB7F0; &#xC804;&#xB7B5;&#xC744; &#xD1B5;&#xD574; Adobe Reader&#xC640; Adobe Pro&#xC5D0;&#xC11C; 53&#xAC1C;&#xC758; critical &#xD55C; &#xBC84;&#xADF8;&#xB97C; &#xBC1C;&#xACAC;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xD76C;&#xB294; &#xB2E4;&#xB978; &#xC774;&#xBBF8;&#xC9C0; &#xD30C;&#xC11C; &#xC2A4;&#xD2B8;&#xB9BC; &#xB514;&#xCF54;&#xB354; &#xB4F1;&#xC5D0; &#xC774;&#xB7EC;&#xD55C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC801;&#xC6A9;&#xD574;&#xBD24;&#xACE0; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; CVE&#xB4E4;&#xC744; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>CVE-2018-4985, CVE-2018-5063, CVE-2018-5064, CVE-2018-5065, CVE-2018-5068, CVE-2018-5069, CVE-2018-5070, CVE-2018-12754, CVE-2018-12755, CVE-2018-12764, CVE-2018-12765, CVE-2018-12766, CVE-2018-12767, CVE-2018-12768, CVE-2018-12848, CVE-2018-12849, CVE-2018-12850, CVE-2018-12840, CVE-2018-15956, CVE-2018-15955, CVE-2018-15954,CVE-2018-15953, CVE-2018-15952, CVE-2018-15938, CVE-2018-15937, CVE-2018-15936, CVE-2018-15935, CVE-2018-15934, CVE-2018-15933, CVE-2018-15932 , CVE-2018-15931, CVE-2018-15930 , CVE-2018-15929, CVE-2018-15928, CVE-2018-15927, CVE-2018-12875, CVE-2018-12874 , CVE-2018-12873, CVE-2018-12872,CVE-2018-12871, CVE-2018-12870, CVE-2018-12869, CVE-2018-12867 , CVE-2018-12866, CVE-2018-12865 , CVE-2018-12864 , CVE-2018-12863, CVE-2018-12862, CVE-2018-12861, CVE-2018-12860, CVE-2018-12859, CVE-2018-12857, CVE-2018-12839, CVE-2018-8464</p>
<p>jp2k&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xD55C; &#xCDE8;&#xC57D;&#xC810; &#xC911; &#xD558;&#xB098;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.welivesecurity.com/2018/05/15/tale-two-zero-days/">&#xC2E4;&#xC81C; &#xACF5;&#xACA9;</a>&#xC5D0; &#xC545;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xB418;&#xC5B4; &#xBC1C;&#xACAC;&#xD558;&#xACE0; &#xC5BC;&#xB9C8; &#xC9C0;&#xB098;&#xC9C0; &#xC54A;&#xC544; Adobe&#xC5D0; &#xC81C;&#xBCF4;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBB3C;&#xB860; Adobe Reader&#xC758; &#xC0CC;&#xB4DC;&#xBC15;&#xC2A4;&#xC640; Reader Protected Mode&#xB294; exploit&#xC758; &#xBCF5;&#xC7A1;&#xB3C4;&#xB97C; &#xD06C;&#xAC8C; &#xC99D;&#xAC00;&#xC2DC;&#xCF30;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC704;&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xD55C; &#xACF5;&#xACA9; &#xC0AC;&#xB840;&#xCC98;&#xB7FC; &#xC0CC;&#xB4DC; &#xBC15;&#xC2A4;&#xB85C;&#xBD80;&#xD130; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCE58;&#xAE30; &#xC704;&#xD574;&#xC120; &#xB610; &#xB2E4;&#xB978; PE exploit&#xC744; &#xC694;&#xAD6C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xD76C;&#xB294; WinAFL&#xC744; &#xC0AC;&#xB791;&#xD558;&#xACE0; &#xB354; &#xB9CE;&#xC774; &#xC4F0;&#xC774;&#xAE38; &#xBC14;&#xB77C;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>WinAFL&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74;&#xC11C; &#xBC84;&#xADF8;&#xB098; &#xAE30;&#xB2A5; &#xB204;&#xB77D; &#xB4F1;&#xC744; &#xC790;&#xC8FC; &#xB9C8;&#xC8FC;&#xCCE4;&#xC2B5;&#xB2C8;&#xB2E4;. Windows 10 Appifier&#xC5D0; &#xB300;&#xD55C; &#xC9C0;&#xC6D0; &#xCD94;&#xAC00;, CPU &#xC120;&#xD638;&#xB3C4;, &#xBC84;&#xADF8; &#xC218;&#xC815; &#xBC0F; &#xBA87; &#xAC00;&#xC9C0; GUI &#xAE30;&#xB2A5;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xACE0; &#xC5C5;&#xC2A4;&#xD2B8;&#xB9BC; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xD76C; &#xCEE4;&#xBC0B; &#xB9C1;&#xD06C;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Netanel&#x2019;s commits &#x2013; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/googleprojectzero/winafl/commits?author=netanel01">https://github.com/googleprojectzero/winafl/commits?author=netanel01</a></p>
<p>Yoava&#x2019;s commits &#x2013; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/googleprojectzero/winafl/commits?author=yoava333">https://github.com/googleprojectzero/winafl/commits?author=yoava333</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Translation/">Translation</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/cve/">cve</a>
                  
                  <a class="hover-with-bg" href="/tags/Fabu1ous/">Fabu1ous</a>
                  
                  <a class="hover-with-bg" href="/tags/winafl/">winafl</a>
                  
                  <a class="hover-with-bg" href="/tags/fuzzing/">fuzzing</a>
                  
                  <a class="hover-with-bg" href="/tags/harness/">harness</a>
                  
                  <a class="hover-with-bg" href="/tags/bug-bounty/">bug bounty</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_Fabu1ous.jpg" srcset="/img/loading.gif" alt="Fabu1ous">
                  </div>

                  <div class="link-text">
                    <div class="link-title">Fabu1ous</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/Fabu1ous">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/07/05/idioth/2021-07-05/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] Abusing Kerberos S4U2self local privilege escalation</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/07/04/j0ker/2021-07-04/">
                    <span class="hidden-mobile">[] CVE-2020-1170 - Microsoft Windows Defender Elevation of Privilege Vulnerability</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/07/04/fabu1ous/50cve/';
        this.page.identifier = '/2021/07/04/fabu1ous/50cve/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Translation] 50 CVEs in 50 Days: Fuzzing Adobe Reader&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
